[
  {
    "original_filename": "0048_au_begins",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<style type=\"text/css\">\n.blue { color: blue; }\n.teal { color: teal; }\n.maroon { color: maroon; }\n</style>"
  },
  {
    "original_filename": "0048_au_begins",
    "header_text": "AU Begins",
    "local_header_href": "#au-begins",
    "chunk_text": "<h3>AU Begins</h3><p>I have now arrived safely and happily at AU, with a day or two to acclimatise, un-jetlag, enjoy desert and nature and go climbing with Lisa and Steve on limestone in the Gun Club and with Manuela and Norbert on sandstone in the \n\n<a href=\"http://en.wikipedia.org/wiki/Red_Rock_Canyon_National_Conservation_Area\">\nRed Rock Canyon</a>\n\non the way. Here is a list of the climbs I did in Red Rock with some \n\n<a href=\"http://gallery.me.com/mabertchh#100274\">\nphotos</a>:</p><ul>\n<li>Black Corridor</li>\n<ul>\n<li>71 Bonaire 5.9</li>\n<li>72 Bon Ez 5.9+</li>\n<li>73 Crude Boys 5.10d</li>\n<li>76 Vega Bonds 5.10a</li>\n<li>79 Crude Street Blues 5.9+</li>\n<li>80 Crude Behaviour 5.9+</li>\n</ul>\n<li>Magic Bus</li>\n<ul>\n<li>44 Electric Kool-Aid 5.10a</li>\n<li>45 Blonde Dwarf 5.10a</li>\n</ul>\n</ul><p>I also climbed the first pitch of the Great Red Book, after which we had to abort and abseil down from the middle of the wall because we were running too late in time. The sunset was wonderful from up there.</p><p>Another memorable image in my inner eye is sunrise with an orange sky above the distant black mountain silhouettes, and the shimmering orange Las Vegas lightscape in almost the exact some colour below.\nCan you imagine? Beautiful presunrise orange sky lighting up the east, stars in dark blue in the west, black mountain silhouettes at the horizon all around, and the huge flat orange ocean of lights in between?\n</p><p>Anyway, now I am sitting in the perfumed air of the Venetian and the adjoining conference centre and AU is finally beginning. My AU\n\n<a href=\"http://au.autodesk.com/sessions/?speaker=Jeremy+Tammik&amp;year=2008\">\nsessions</a>\n\nare all just about full ... the one that still has places free is actually of special interest, because it provides an opportunity to meet and interact directly with some members of the AutoCAD Architecture and Revit development teams:</p><ul>\n<li><a href=\"http://au.autodesk.com/sessions/?speaker=Jeremy+Tammik&amp;year=2008\">\nDE315-1 AEC API Talk</a> <span class=\"teal\">(Thu. 12/4 3:15 pm - 4:45 pm)</span></li>\n</ul><p>Another thing that Stephen Preston reminded me of is the fact we are offering free attendance at an \n\n<a href=\"http://www.autodesk.com/apitraining\">\nAPI training class</a>\n\nto anyone who participates in one of our \n\n<a href=\"http://through-the-interface.typepad.com/through_the_interface/2008/07/au-2008-class-s.html\">\ndeveloper track classes</a>\n\nat AU. The offer is one free training class per attendee to be taken at any time during calendar year 2009. To get this, you must attend the AU class and leave your contact details with the presenter in the class, e.g. a business card. The free training is non-transferable and limited to one free training class per person. To use the free training, just register for a class on \n\n<a href=\"http://www.autodesk.com/apitraining\">\nwww.autodesk.com/apitraining</a>,\n\ntell us you attended the class at AU and would like the free training. Then we can check your name against the collected business cards.</p><p>I'm looking forward to seeing you at one of the sessions or in between in a break, if you are here, or hear from you otherwise, if you are not.</p>"
  }
]