[
  {
    "original_filename": "0062_happy_new_year",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<style>\n.blue { color: blue; }\n.teal { color: teal; }\n.maroon { color: maroon; }\n.green { color: green; }\n</style>"
  },
  {
    "original_filename": "0062_happy_new_year",
    "header_text": "Happy New Year 2009",
    "local_header_href": "#happy-new-year-2009",
    "chunk_text": "<h3>Happy New Year 2009</h3><p>This break is great.\nI am really relaxing, and this machine is taboo ... and yet ... \nThis is just a short note to say that I am having a good time, enjoying life, spending time with my kids and friends, occasionally looking in a mirror to watch at least some of the creases in my face relax a little.\nOn December 26 I went for a brief climbing session just before sunset with my son Cornelius and his friend Simon on the \n\n<a href=\"http://pagesperso-orange.fr/serge.haffner/fluh.htm\">\nHofstettenchoepfli</a>\n\nin Flueh near Basle. \nI led two short climbs on the Elsaesserwand, Gelbe Kante Direkt 5c+ and \n\n<a href=\"http://blog.rockrun.com/2008/08/x-file-8-basel-jura-switzerland.html\">\nSargdeggel 6a</a>,\n\ninitially with rather cold and numb fingertips, especially when reaching deep into frozen cracks, but one does warm up and stay warm pretty quickly ... at least until the rather early sunset around four in the afternoon.</p><img alt=\"Leading Sargdeggel\" src=\"file:////j/photo/jeremy/2009/2009_12_26_flueh_climbing/sargdeggel_6a_1.jpg\" width=\"400\"/><p>I still notice that I am a bit out of shape after the conference tour ...\nAnother enjoyable event for improving that was a ski tour on December 29 to the summit of\n\n<a href=\"http://www.bergfuehrer-engelberg.ch/winter/skitouren.htm#Rotsandnollen\">\nRotsandnollen</a>\n<a href=\"http://www.hikr.org/tour/post666.html\">\n[2]</a>\n\nnear Melchsee-Frutt, 800 meters ascent from Stöckalp past Melchsee, Tannensee, Unter Boden, Zigenboden, and over 1600 m descent, unfortunately with rather difficult snow.</p><img alt=\"Picture not yet uploaded: Long gradual ascent though a beautiful valley to the Rotsandnollen\" src=\"img/???\"/><p>Anyway, I'm enjoying another few days of relaxation and reduced computer interaction before getting down to serious business again next week, although there are some things such as travel and API trainings I will be presenting later in January that require preparation and attention already now.</p><p>I wish all readers a happy and harmonious new year!</p>"
  }
]