[
  {
    "original_filename": "0082_unit_type",
    "header_text": "Unit Types and Format Options",
    "local_header_href": "#unit-types-and-format-options",
    "chunk_text": "<h3>Unit Types and Format Options</h3><p>Here is a question from\n\n<a href=\"http://cadappdev.blogspot.com\">\nMatt Mason</a>\n\nand some exhaustive research results by Saikat Bhattacharya of Autodesk on unit types and their format options.</p><p>To provide some context, UnitType is an enumeration listing all the unit types supported by Revit. The FormatOptions class is used to manage information for the ProjectUnit.FormatOptions property, which returns a FormatOptions instance containing the user's current project unit settings for each UnitType queried. Through the project units and the format options management, each unit type is associated with one FormatOptions instance, which provides the following properties and values:</p><ul>\n<li>Group, a UnitGroup enumeration value,</li>\n<li>Name, a string,</li>\n<li>Units, a display unit type, represented by a DisplayUnitType enumeration value,</li>\n<li>Symbol, a UnitSymbolType enumeration value,</li>\n<li>Rounding, a double value.</li>\n</ul><p>In this context, Matt asks:</p><p><strong>Question:</strong>\nWhen attempting to get the FormatOptions for a given UnitType, I am getting exceptions for certain UnitTypes:</p><ul>\n<li>AreaForceScale </li>\n<li>DecSheetLength </li>\n<li>Electrical Apparent Power </li>\n<li>Electrical Current </li>\n<li>Electrical Frequency </li>\n<li>Electrical Luminance </li>\n<li>Electrical Potential </li>\n<li>Electrical Power </li>\n<li>Electrical Power Density </li>\n<li>ForceScale </li>\n<li>HVAC * </li>\n<li>Linear Force Scale </li>\n<li>Moment Scale </li>\n<li>Number </li>\n<li>Pipe Size </li>\n<li>Piping * </li>\n<li>SheetLength </li>\n<li>SiteAngle </li>\n<li>WireSize </li>\n</ul><p>Some of these might be related to the fact that I am running the Revit Architecture flavour, but it is not clear to me that all of these are based on Revit flavour issues.\nAre some of these legacy or otherwise invalid types? </p><p><strong>Answer:</strong>\nSaikat created the following mapping of the list of unit types provided with the disciplines in RAC as well as RME.\nMost of the unit types listed below belong to the MEP flavour of Revit and thus do not throw an exception in RME:</p><ul>\n<li>AreaForceScale - Structural</li>\n<li>DecSheetLength - </li>\n<li>Electrical Apparent Power - Electrical</li>\n<li>Electrical Current - Electrical</li>\n<li>Electrical Frequency - Electrical</li>\n<li>Electrical Luminance - Electrical</li>\n<li>Electrical Potential - Electrical</li>\n<li>Electrical Power - Electrical</li>\n<li>Electrical Power Density - Electrical</li>\n<li>ForceScale - Structural</li>\n<li>HVAC * - HVAC</li>\n<li>Linear Force Scale - Structural</li>\n<li>Moment Scale - Structural</li>\n<li>Number - </li>\n<li>Pipe Size - Piping</li>\n<li>Piping * - Piping</li>\n<li>SheetLength - </li>\n<li>SiteAngle - </li>\n<li>WireSize - Electrical</li>\n</ul><p>After contacting the engineering team for more details, he compiled a more comprehensive list including 80 unit types with their format option groups and names, and additional notes on some of them.\nHere is a spreadsheet\n\n<a href=\"zip/ProjectUnit.csv\">\nProjectUnit.csv</a>\n\nwith the complete mapping in a neutral comma delimited CSV format. </p><p>After reviewing these results, Matt adds a note that the four 'special' unit types DecSheetLength, SheetLength, Number, and SiteAngle are 'fixed' and will throw an exception if you attempt to access them in any Revit Flavour.\nSaikat adds: As mentioned in the CSV file, there are more than the four special cases that Matt refers to as 'special'.\nThe CSV file contains others which apply to all disciplines and also cannot be edited, which Matt refers to as 'fixed', and includes some notes on each of them.</p>"
  }
]