[
  {
    "original_filename": "0118_deeper_param_exploration",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<style>\n.blue { color: blue; }\n.teal { color: teal; }\n.maroon { color: maroon; }\n.green { color: green; }\n.gray { color: gray; }\n</style>"
  },
  {
    "original_filename": "0118_deeper_param_exploration",
    "header_text": "Deeper Parameter Exploration",
    "local_header_href": "#deeper-parameter-exploration",
    "chunk_text": "<h3>Deeper Parameter Exploration</h3><p>We already discussed\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2008/11/exploring-element-parameters.html\">\nexploring element parameters</a>\n\nin some depth.\nNicholas raised a\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2008/11/exploring-element-parameters.html?cid=6a00e553e16897883301156fc3e679970b#comment-6a00e553e16897883301156fc3e679970b\">\nquestion</a>\n\non this that prompted me to take the discussion one step further:</p><p><strong>Question:</strong>\nI noticed for certain special parameters I can't access the value.\nFor example with Lighting Fixtures, there are parameters like Light Loss Factor, Initial Intensity and Initial Color. The value field is a button, which opens a special window.\nDo you think it's possible to access the value of these parameters?\nThese parameters are available when there is a Light Source Definition in the family and can be found under the Type parameters.\nWhen I check the ParameterType property on them, the result is \"Invalid\".\nTheir value is \"0\" and its StorageType is Integer.</p><p><strong>Answer:</strong>\nI found a component that has the parameters that you are interested in.\nIt is the studio light, which I can insert using Modelling &gt; Component CM &gt; Load &gt; Lighting Fixtures &gt; M_Studio Light.rfa.\nIn the Revit user interface element properties dialogue, I see these properties, and I see that their value field is a button which opens a special custom dialogue to edit their settings.</p><p>Looking at the element instance parameters using the built-in parameter checker that is part of the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/files/rac_labs_20081117.zip\">\nRevit API introduction labs</a>,\n\nI see that several different parameters seem to be related to these.\nThey all seem to be associated with FBX and rendering.\nHere is a partial list, as obtained from the built-in parameter checker (copy and paste to an editor to see complete text of truncated over-long lines):</p><pre>\nFBX_LIGHT_LOSS_FACTOR_CTRL : Light Loss Factor : Integer\nFBX_LIGHT_INITIAL_COLOR_CTRL : Initial Color : Integer\nFBX_LIGHT_LOSS_FACTOR_METOD : Light Loss Input Method : Integer/Integer\nFBX_LIGHT_INITIAL_COLOR_NAME : Temperature Color : Integer\nFBX_LIGHT_INITIAL_INTENSITY_INPUT_METOD : Initial Light Intensity Input Method : Integer/Integer\nFBX_LIGHT_SURFACE_LOSS : Surface Depreciation Loss : Double\nFBX_LIGHT_LAMP_TILT_LOSS : Lamp Tilt Loss : Double\nFBX_LIGHT_VOLTAGE_LOSS : Voltage Loss : Double\nFBX_LIGHT_TEMPERATURE_LOSS : Temperature Loss : Double\nFBX_LIGHT_COLOR_FILTER : Color Filter : Integer\nFBX_LIGHT_INITIAL_COLOR_TEMPERATURE : Initial Color Temperature : Double\nFBX_LIGHT_INITIAL_INTENSITY : Initial Intensity : Integer\nFBX_LIGHT_BALLAST_LOSS : Ballast Loss : Double\nFBX_LIGHT_TOTAL_LIGHT_LOSS : Total Light Loss Factor : Double\n</pre><p>As you say, most of these have the storage type Integer, although some have Double, their values are all zero, and they are all marked as read-write.</p><p>Notice that a few of these have a rather strange value type of Integer/Integer, and their built-in parameter enumeration name has the suffix METOD. I assume this is a misspelling of 'method', and that these parameters internally provide access to some event handling routines which display the dialogues you are seeing for inputting the values.</p><p>Exploring these further, I found out how to read two of the parameter values that you are asking for.\nAs you say, these are type parameters, not instance ones.</p><p>I first set up my own values for the parameters I am exploring through the Revit user interface element properties dialogue, and then use the built-in parameter checker to see how to access the values through the API.</p><p>Select the studio light instance &gt; Right click context menu &gt; Element properties... &gt; Edit/New to access the type properties. Type Properties &gt; Light Loss Factor &gt; a dialogue appears. Drag the slider or enter a value in the edit box, such as 3.45. Click OK twice. Select the instance again, open the built-in parameter checker, and select the type parameters by answering 'No' to  the question:\n\n<i>\"This element is a family instance, so it has both type and instance parameters. By default, the instance parameters are displayed. If you select 'No', the type parameters will be displayed instead. Would you like to see the instance parameters?\"</i></p><p>Look at the value of the parameter FBX_LIGHT_TOTAL_LIGHT_LOSS 'Total Light Loss Factor'. It contains the Light Loss Factor value you just entered.</p><p>Similarly, I set the values of Initial Intensity to 4567.00 lm and used the built-in parameter checker to find its value in the parameter FBX_LIGHT_LIMUNOUS_FLUX 'Luminous Flux'.</p><p>I hope this answers your question, and also explains better what use we can make of the built-in parameter checker to explore the Revit model and its data. It also shows that we really do have pretty good access to the data we are interested in.</p>"
  }
]