[
  {
    "original_filename": "0130_mep_connectors",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<style>\n.blue { color: blue; }\n.teal { color: teal; }\n.maroon { color: maroon; }\n.green { color: green; }\n</style>"
  },
  {
    "original_filename": "0130_mep_connectors",
    "header_text": "MEP Connectors",
    "local_header_href": "#mep-connectors",
    "chunk_text": "<h3>MEP Connectors</h3><p>We had an internal discussion on the relationship between the different API classes involved in defining connectors in \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2009/06/revit-mep-api.html\">\nRevit MEP</a>\n\nwhich I thought might be of general interest as well.</p><p><strong>Question:</strong>\nWhat is the difference between the Connector class versus the DuctConnector, PipeConnector and ElectricalConnector ones?\nI know one of them is used in the context of family documents only, and the other one is in project context. \nBut what is the main difference between them?</p><p><strong>Answer:</strong>\nIn Revit MEP, we work with different groups of elements, which all live in the project file, such as:</p><ul>\n<li>Equipment\n<li>Pipe and duct\n<li>Fitting\n</li></li></li></ul><p>Fittings and equipment are family instances, pipes and ducts are defined internally in Revit.\nThey connect to their neighbour elements using connectors.\nThe connectors are not elements, nor family instances, and do not live in the project file.\nThey are contained within the family instances. \nTherefore, they have to be added to the family definition.\n\n<p>There are different types of connectors for the different types of systems.\nA single piece of MEP equipment can have none, some or all connector types. \n\n<p>For instance, a piece of HVAC equipment such as a cooler may have electrical connections for power, pipes for cooling water in- and outlets, and ducts for air in- and outlets. \nAll these connectors are defined in the family editor. \nWhen the equipment is inserted into the model, the connectors are used to hook it up to neighbouring elements, in this case electrical system, pipes and ducts.\n\n<p>We thus have one set of classes for <strong>defining</strong> connectors, which reside in the family document.\nWe have another class to <strong>represent</strong> the connectors on the resulting family instances, once they have been inserted into a project document. The former are the DuctConnector, PipeConnector and ElectricalConnector classes, the latter the Connector class.\n\n<p>The API documentation says the following about the DuctConnector class: \"This element type is accessible only in Autodesk Revit MEP family documents. Duct connectors that are accessible in MEP project documents are not elements, and are represented by Autodesk::Revit::MEP::Connector.\"\n\n<p>In the documentation on the Connector class, it says: \"This connector is an item that is a part of another element (duct, pipe, fitting, or equipment). This connector does not represent the connector element that can be created inside a family; for that element, please refer to Revit::MEP::DuctConnector, Revit::MEP::PipeConnector and Revit::MEP::ElectricalConnector.\"\n\n<p>So, when you are inside a family document, building your equipment, you add a DuctConnector class to the model. This is then transformed into some information on the equipment hosting it. \nWhen you insert that equipment into the model and query it for its connectors, it returns Connector instances to you.\n\n<p>Here are the results looking at the situation in the Revit user interface and RvtMgdDbg:</p>\n<p>DuctConnector, PipeConnector and ElectricalConnector are the classes you see and use in the family editor.\nThese objects are the MEP connector definition classes used as a part of the building blocks to define an MEP part:</p>\n<img alt=\"MEP family editor connector definition tools\" src=\"img/mep_connector_1.png\"/>\n<p>Once you define a family type and insert it in a Revit project, you have a family instance, for instance this air handler:</p>\n<img alt=\"Air handler family instance with connectors in a project file\" src=\"img/mep_connector_3.png\"/>\n<p>This instance contains connectors, which are managed by the connection manager and represented by the Connector class:</p>\n<img alt=\"Air handler connector class instances in RvtMgdDbg\" src=\"img/mep_connector_4.png\"/>\n<h4>Autodesk Structural Engineering Partner Program</h4>\n<p>Autodesk announced a Structural Engineering Partner Program to establish a framework for participating structural analysis software partners to engage and collaborate with Autodesk in delivering solutions for the field of structural engineering. \nHere are the links to the \n\n<a href=\"http://usa.autodesk.com/adsk/servlet/item?siteID=123112&amp;id=12414379\">\npartner site</a>\n\nand the \n\n<a href=\"http://images.autodesk.com/adsk/files/structural_engineering_partner_program_guide_final.pdf\">\npartner guide</a>.</p>\n<h4>Offspring Activities</h4>\n<p>My son Christopher started\n\n<a href=\"http://dropdeadmoviez.wordpress.com\">\nblogging</a>\n\nas well, and posted his first \n\n<a href=\"http://www.youtube.com/watch?v=aisb3Mc__z0\">\nfilm</a>,\n\nthough completely unrelated to Revit, or CAD, or computers, of course.</p>\n</p></p></p></p></p></p></p>"
  },
  {
    "original_filename": "0130_mep_connectors",
    "header_text": "Autodesk Structural Engineering Partner Program",
    "local_header_href": "#autodesk-structural-engineering-partner-program",
    "chunk_text": "<h4>Autodesk Structural Engineering Partner Program</h4><p>Autodesk announced a Structural Engineering Partner Program to establish a framework for participating structural analysis software partners to engage and collaborate with Autodesk in delivering solutions for the field of structural engineering. \nHere are the links to the \n\n<a href=\"http://usa.autodesk.com/adsk/servlet/item?siteID=123112&amp;id=12414379\">\npartner site</a>\n\nand the \n\n<a href=\"http://images.autodesk.com/adsk/files/structural_engineering_partner_program_guide_final.pdf\">\npartner guide</a>.</p>"
  },
  {
    "original_filename": "0130_mep_connectors",
    "header_text": "Offspring Activities",
    "local_header_href": "#offspring-activities",
    "chunk_text": "<h4>Offspring Activities</h4><p>My son Christopher started\n\n<a href=\"http://dropdeadmoviez.wordpress.com\">\nblogging</a>\n\nas well, and posted his first \n\n<a href=\"http://www.youtube.com/watch?v=aisb3Mc__z0\">\nfilm</a>,\n\nthough completely unrelated to Revit, or CAD, or computers, of course.</p>"
  }
]