[
  {
    "original_filename": "0137_vb_samples",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<style>\n.blue { color: blue; }\n.teal { color: teal; }\n.maroon { color: maroon; }\n.green { color: green; }\n</style>"
  },
  {
    "original_filename": "0137_vb_samples",
    "header_text": "VB Samples and Other Questions",
    "local_header_href": "#vb-samples-and-other-questions",
    "chunk_text": "<h3>VB Samples and Other Questions</h3><p>I have been very quiet now for a few days.\nThe reason is that I went on a climbing weekend to Mallorca with my brother and left my laptop in the car while we went for a climb.\nThe car was broken into, and the laptop and all my valuables were stolen, right down to the bicycle keys.\nSince I had actually used the bicycle to get to the airport, the first thing I had to do on arriving back was to borrow a saw to break my own bicycle lock.\nNow I am in the painful process of restoring data to a temporary computer.\nA valuable lesson in letting go, I suppose. More on this below.</p><p>Anyway, here are some queries on different topics, some of which have been touched upon previously, and an updated reiteration may be of general interest:</p><ol>\n<li><a href=\"#1\">Programmatically triggering IFC export.</a></li>\n<li><a href=\"#2\">ImportExport SDK sample in VB.</a></li>\n<li><a href=\"#3\">OnStartup sample code in VB.</a></li>\n<li><a href=\"#4\">64 bit OLE DB access.</a></li>\n</ol><a name=\"1\"></a><p><strong>Question:</strong>\nHow can I trigger a daily export of a Revit model to an IFC file?</p><p><strong>Answer:</strong>\nI am sorry to say that there is currently no API access to this functionality.\nOne option that you might explore is to simulate the user input required for this repetitive task programmatically. \nYou might do this directly using the Win32 API, or make use of some utilities that provide easier access to this functionality. \nHere are some of the previous posts dealing with related topics:</p><ul>\n<li><a href=\"http://thebuildingcoder.typepad.com/blog/2008/12/driving-revit-from-outside.html\">\nDriving Revit from outside.</a></li>\n<li><a href=\"http://thebuildingcoder.typepad.com/blog/2009/02/revit-window-handle-and-modeless-dialogues.html\">\nThe Revit Window handle and modeless dialogues.</a></li>\n<li><a href=\"http://thebuildingcoder.typepad.com/blog/2009/01/autohotkey.html\">\nAutoHotKey.</a></li>\n</ul><p>Another option that may fit your requirements perfectly but is not officially supported is the use of the Revit journal file.\nEvery action performed through the Revit user interface is recorded in a journal file, located in a subfolder of the Revit installation folder.\nWe once discussed \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2009/02/getting-the-journal-file-path.html\">\nhow to obtain the path of the current journal file</a>.\n\nJournal files can be rerun to reproduce the actions performed in a previous session, for instance by specifying them on the Revit command line during start-up.\nCustom applications can define what data their commands register in the journal file, and how to process that data when a journal file is replayed, as demonstrated by the Revit SDK Journaling sample.\nIn your case, however, you would possibly not need to do any programming or customisation at all, just start up Revit, perform the IFC export, close down Revit again, and save the resulting journal file.\nThis file might be reusable to automate the IFC export on a daily basis, just as you require.</p><a name=\"2\"></a><p><strong>Question:</strong>\nThe Revit SDK 2010 provides a sample application named ImportExport which is of interest to me.\nUnfortunately, it is in C#, I am only familiar with VB, and the example is quite comprehensive. \nHow can I convert this to VB, please?</p><p><strong>Answer:</strong>\nWe already discussed the topics of conversion, disassembly, decompilation, Lutz Roeder's \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2008/10/converting-between-vb-and-c-and-net-decompilation.html\">\nReflector</a> \n\ntool and the related topic of \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2008/10/converting-between-vb-and-c-and-net-decompilation.html\">\nobfuscation</a> \n\nin previous posts.\n\nThis tool can be used perfectly well to decompile the Revit SDK Samples, as well.\nThe decompiled code can be displayed in a variety of different languages, including Delphi, managed C++, Chrome and Visual Basic.\nAs said, the ImportExport sample is written in C#.\nI opened the compiled assembly ImportExport.dll in Reflector and asked to see the source code of the Command class disassembled into Visual Basic.\nHere is the result:</p><pre class=\"code\">\nPublic Class Command\n  Implements IExternalCommand\n  ' Methods\n  Public Function Execute( _\n    ByVal commandData As ExternalCommandData, _\n    ByRef message As String, _\n    ByVal elements As ElementSet _\n  ) As Result\n    Try \n      If (Nothing Is commandData.Application.ActiveDocument) Then\n        message = \"Active view is null.\"\n        Return Result.Failed\n      End If\n      Dim mainData As New MainData(commandData)\n      Using mainForm As MainForm = New MainForm(mainData)\n        If (mainForm.ShowDialog = DialogResult.Cancel) Then\n          Return Result.Cancelled\n        End If\n      End Using\n    Catch ex As Exception\n      message = ex.ToString\n      Return Result.Failed\n    End Try\n    Return Result.Succeeded\n  End Function\nEnd Class\n</pre><p>I will leave it up to you to decompile the rest of the classes, if you wish.\nAlternatively, there are other tools available which decompile an entire application in one go.</p><p>Nowadays, Reflector is available from <a href=\"http://www.red-gate.com\">Red Gate</a>.</p><a name=\"3\"></a><p><strong>Question:</strong>\nI would like my application to run automatically every time a file is opened.\nI assume this can be achieved using the OnStartup method. \nHow is OnStartup used in VB.NET?</p><p><strong>Answer:</strong>\nWe already looked at this topic once previously, and provided a short description on registering to \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2008/10/application-events-in-vb.html\">\napplication events in VB</a>.\n\nI repeated the steps described there in the Visual Studio 2008 environment for Revit Architecture 2010, \nand implemented a simple sample external application named OnStartupVb and implementing OnStartup in Visual Basic for you. \nThe description provided in the previous post for Revit 2009 remains valid for 2010 as well.\nHere is the resulting source code of the external application class:</p><pre class=\"code\">\nImports Autodesk.Revit\n\nPublic Class App\n  Implements IExternalApplication\n\n  Public Function OnShutdown(ByVal a As ControlledApplication) _\n  As IExternalApplication.Result _\n  Implements IExternalApplication.OnShutdown\n    Return IExternalApplication.Result.Succeeded\n  End Function\n\n  Public Function OnStartup(ByVal a As ControlledApplication) _\n  As IExternalApplication.Result _\n  Implements IExternalApplication.OnStartup\n    System.Windows.Forms.MessageBox.Show( _\n      \"OnStartup says Hello from Jeremy\", _\n      \"OnStartup VB\")\n  End Function\n\nEnd Class\n</pre><p>Here is a copy of the full Visual Studio solution <a href=\"zip/OnStartupVb.zip\">OnStartupVb</a>.</p><a name=\"4\"></a><p><strong>Question:</strong>\nNo OLEDB provider registered ... \nHow can I retrieve a record set from an Access 2007 database using VB.NET in 64-bit Vista?\n\n</p><p><strong>Answer:</strong>\nIf you install 32-bit Revit 2009 in 64-bit Vista, then this is possible. \nThis requires compiling your Revit plug-in in a 32-bit OS, then loading it into 32-bit Revit in the 64-bit OS.\nOn the other hand, if the Revit version is 64-bit, one possible approach is to use the SQL server database accessing driver. \nNote that the 32-bit version of Revit 2010 cannot be installed on a 64-bit OS, so in that case using SQL Server or SQL Server Express would be the recommended option.</p><p>Thanks to Joe Ye for this answer!</p><p>Back to the topic of Mallorca.\nApart from criminality, it is a surprisingly beautiful place with large areas of untouched nature, mountains, and almost inaccessible beaches, in spite of the strong touristic focus in the cities and villages.\nAlso a huge amount of beautiful climbing opportunities.\nHere I am walking along a path heading for both a lonesome beach and a challenging cliff:</p><img alt=\"Lonesome path on Mallorca\" src=\"img/1_jeremy_on_a_path.jpg\"/><p>The weather was hot enough to require some protection against the sun:</p><img alt=\"Jeremy as a colourful Tuareg\" src=\"img/2_jeremy_tuareg.jpg\"/>"
  }
]