[
  {
    "original_filename": "0147_shared_param_rfa",
    "header_text": "Adding a Shared Parameter to an RFA File",
    "local_header_href": "#adding-a-shared-parameter-to-an-rfa-file",
    "chunk_text": "<h3>Adding a Shared Parameter to an RFA File</h3><p>Back again from my vacation in Avignon.\nWe had a wonderful drive back up again through the gorges of the\n\n<a href=\"http://en.wikipedia.org/wiki/Buech\">\nBuëch river</a>\n\nwith a beautiful camp near Rosans.\nI knew the place from last year, and here are two photos from that visit.\nHere is Cornelius at the camp fire in the evening:</p><img alt=\"Cornelius at the camp fire near Rosans\" src=\"img/rosans_cornelius_campfire.jpg\" width=\"400\"/><p>Here is our camp site in the early morning dew:</p><img alt=\"Our camp site in the morning dew\" src=\"img/rosans_morning_dew.jpg\" width=\"400\"/><p>We were lucky with the weather, sleeping outside with no roof, preferring the open sky to a tent, and it started raining just after we left but not before.</p><p>Looking at old and new subjects to write about, I just discovered a rather overdue issue, a question raised quite a while ago by Arun Shankar of\n\n<a href=\"http://www.reedbusiness.com\">\nReed Business</a>\n\nin a comment on the discussion on\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2008/11/adding-a-shared-parameter-to-a-dwg-file.html\">\nadding a shared parameter to a DWG file</a>:</p><p><strong>Question:</strong>\nIs it possible to add a shared parameter to an RFA file using the DotNet Revit API?\nThe example for adding shared parameters to a DWG file does not work for RFA files.\nCan you please post some sample code for adding shared parameters to an RFA file?</p><p><strong>Answer:</strong>\nAs pointed out in a private note by\n\n<a href=\"http://cadappdev.blogspot.com\">\nMatt Mason</a>,\n\nadding a shared parameter to an RFA file is a completely different issue from adding it to a DWG file instance in a project.\nIn the latter case, we work in the project file and bind a shared parameter to a certain category specific to the inserted DWG file.\nFor an RFA file, you wish to define the shared parameter in the content, and the first step is to add it to the family itself.</p><p>You can add a shared parameter to an RFA file as a type or instance parameter by using the new Family API provided in Revit 2010.\nIt provides the new method FamilyManager.AddParameter().\nIts use is demonstrated by the Revit SDK samples AutoParameter, DWGFamilyCreation and WindowWizard, which are located in the FamilyCreation subdirectory of the Samples folder.\nIt provides the following overloads:</p><ul>\n<li>AddParameter(ExternalDefinition, BuiltInParameterGroup, Boolean): Add a new shared parameter to the family.\n<li>AddParameter(String, BuiltInParameterGroup, Category, Boolean): Add a new family type parameter to control the type of a nested family within another family.\n<li>AddParameter(String, BuiltInParameterGroup, ParameterType, Boolean): Add a new family parameter with a given name.\n</li></li></li></ul><p>To add a shared parameter, you would use the overload taking an ExternalDefinition argument.\nDWGFamilyCreation and WindowWizard both only add standard type parameters using the third overload with the fourth isInstance argument set to false, whereas AutoParameter uses both the first and third overloads to create instance, type and shared parameters.</p><p>Very many thanks to Matt for pointing this out!</p>"
  }
]