[
  {
    "original_filename": "0151_auto_confirm_save",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<style>\n.blue { color: blue; }\n.teal { color: teal; }\n.maroon { color: maroon; }\n.green { color: green; }\n</style>"
  },
  {
    "original_filename": "0151_auto_confirm_save",
    "header_text": "Auto-Confirm Save Using DialogBoxShowing Event",
    "local_header_href": "#auto-confirm-save-using-dialogboxshowing-event",
    "chunk_text": "<h3>Auto-Confirm Save Using DialogBoxShowing Event</h3><p>Simon Del Faveo of \n\n<a href=\"http://www.revittv.com\">\nRevitTV Limited</a>\n\nasked an interesting question which I decided to implement a sample application for, since it may be of general interest and even general use.\nIt demonstrates a specific use of the \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2009/04/new-2010-events.html\">\nnew events</a>\n\nprovided by the Revit 2010 API.</p><p><strong>Question:</strong>\nWe are trying to save loaded family files after some parameters have been added.\nWhen using the Save or Close functions, Revit always prompts you with the confirm message box asking 'Do you want to save changes to filename.rfa?' and offering Yes, No, and Cancel options.\nWe are processing a whole series of RFA files, so we don't want that message box appearing hundreds of times.\nIs there any way via the API to prevent the message box from appearing?</p><p><strong>Answer:</strong>\nYou can request notification on the display of certain dialogue boxes by registering to the Application.DialogBoxShowing event. Its event handler takes two arguments, the sender and a DialogBoxShowingEventArgs instance. The sender argument is actually the Revit application object. The event args parameter provides a HelpId property to enable you to identify the dialogue, and an OverrideResult method to define how the dialogue should be handled.</p><p>Note that not all dialogues in Revit raise a DialogBoxShowing event. Only dialogs derived from a specific internal class do so, unless a specific derived class overrides that default behaviour. I do not have a list of exceptions, but the at least the file open dialogs are derived from a different class, so these events are not raised for the SaveAs dialog. Luckily, this does not affect your case.</p><p>The event argument DialogBoxShowingEventArgs class is actually a parent class for more specialised subclasses MessageBoxShowingEventArgs and TaskDialogShowingEventArgs. The actual instance class depends on the dialogue being handled.</p><p>The confirm message box is a task dialogue, so the latter subclass is used and the help id is set to -1.</p><p>The task dialogue event args provides additional properties to access the dialogue id and message being displayed. For the confirm message box, these are TaskDialog_Save_File and something similar to 'Do you want to save changes to filename.rvt?'</p><p>Therefore, we can install an external application which registers for this event, keeps its eyes open for this task dialogue being displayed, and then uses the OverrideResult method to answer Yes to the confirmation message.</p><p>The OverrideResult method takes an integer argument to specify the dialogue result, and is described a follows in the API documentation:</p><span style=\"color:darkblue\">\n<p>The range of valid result values depends on the type of dialog as follows:</p>\n<ul>\n<li>DialogBox: Any non-zero value will cause a dialog to be dismissed. \n<li>MessageBox: Standard Message Box IDs, such as IDOK and IDCANCEL, are accepted. For all possible IDs, please refer to the Windows API documentation. Naturally, the ID used must be relevant to the buttons in a message box. \n<li>TaskDialog: Either standard Message Box IDs or Revit Custom IDs are accepted depending on the buttons used in a dialog. Standard buttons, such as OK and Cancel, have standard IDs as described in Windows API documentation. Buttons with custom text have custom IDs with incremental values starting at 1001 for the left-most or top-most button in a task dialog. \n</li></li></li></ul>\n</span><p>The options displayed by the confirm message are Yes, No and Cancel, which correspond to standard Windows API message box ids. These are accessible through the DialogResult enumeration in the System.Windows.Forms namespace.</p><p>To explore and test this issue, I implemented an external application named AutoConfirmSave for you. It implements the IExternalApplication interface as follows, registering an event handler named a_DialogBoxShowing to react to Revit dialogues popping up:</p><pre class=\"code\">\n<span class=\"blue\">public</span> <span class=\"teal\">IExternalApplication</span>.<span class=\"teal\">Result</span> OnShutdown( \n  <span class=\"teal\">ControlledApplication</span> a )\n{\n  <span class=\"blue\">return</span> <span class=\"teal\">IExternalApplication</span>.<span class=\"teal\">Result</span>.Succeeded;\n}\n \n<span class=\"blue\">public</span> <span class=\"teal\">IExternalApplication</span>.<span class=\"teal\">Result</span> OnStartup( \n  <span class=\"teal\">ControlledApplication</span> a )\n{\n  a.DialogBoxShowing \n    += <span class=\"blue\">new</span> <span class=\"teal\">EventHandler</span>&lt;<span class=\"teal\">DialogBoxShowingEventArgs</span>&gt;( \n      a_DialogBoxShowing );\n  <span class=\"blue\">return</span> <span class=\"teal\">IExternalApplication</span>.<span class=\"teal\">Result</span>.Succeeded;\n}\n</pre><p>Here is the implementation of the event handler:</p><pre class=\"code\">\n<span class=\"blue\">void</span> a_DialogBoxShowing( \n  <span class=\"blue\">object</span> sender, \n  <span class=\"teal\">DialogBoxShowingEventArgs</span> e )\n{\n  <span class=\"teal\">TaskDialogShowingEventArgs</span> e2 \n    = e <span class=\"blue\">as</span> <span class=\"teal\">TaskDialogShowingEventArgs</span>;\n \n  <span class=\"blue\">string</span> s = <span class=\"blue\">string</span>.Empty;\n \n  <span class=\"blue\">if</span>( <span class=\"blue\">null</span> != e2 )\n  {\n    s = <span class=\"blue\">string</span>.Format( \n      <span class=\"maroon\">\", dialog id {0}, message '{1}'\"</span>, \n      e2.DialogId, e2.Message );\n \n    <span class=\"blue\">bool</span> isConfirm = e2.DialogId.Equals( \n      <span class=\"maroon\">\"TaskDialog_Save_File\"</span> );\n \n    <span class=\"blue\">if</span> ( isConfirm )\n    {\n      e2.OverrideResult( \n        (<span class=\"blue\">int</span>) WinForms.<span class=\"teal\">DialogResult</span>.Yes );\n \n      s += <span class=\"maroon\">\", auto-confirmed.\"</span>;\n    }\n  }\n \n  <span class=\"teal\">Debug</span>.Print( \n    <span class=\"maroon\">\"DialogBoxShowing: help id {0}, cancellable {1}{2}\"</span>,\n    e.HelpId,\n    e.Cancellable ? <span class=\"maroon\">\"Yes\"</span> : <span class=\"maroon\">\"No\"</span>,\n    s );\n}\n</pre><p>This method checks whether the dialogue being displayed is a task dialogue by attempting to cast the event arguments to TaskDialogShowingEventArgs.\nIf this succeeds, it is a task dialogue and we can use the event argument DialogId to check whether it is the confirm message.\nIf so, we specify DialogResult.Yes as the result of the dialogue, which causes it not to be displayed to the user at all.\nFinally, we print out some of the event argument properties, regardless of which dialogue it was.</p><p>Opening and closing a project named wall_footing.rvt on my system displays the following message in the Visual Studio debug output window and automatically confirms the save, so the dialogue box is not displayed to the user:</p><pre>\nDialogBoxShowing: \n  help id -1, \n  cancellable No, \n  dialog id TaskDialog_Save_File, \n  message 'Do you want to save changes to wall_footing.rvt?', \n  auto-confirmed.\n</pre><p>So all you need to do to achieve your task is to install the AutoConfirmSave external application alongside any existing applications, and the question whether to save your project will always be automatically answered with Yes.\nYou obviously need to be careful to remove the external application from Revit.ini again once you are finished processing your files, or you will never again see the message box asking you to confirm changes.</p><p>Here is the complete \n\n<a href=\"zip/AutoConfirmSave.zip\">\nAutoConfirmSave</a>\n\nVisual Studio solution implementing this external application.</p>"
  }
]