[
  {
    "original_filename": "0224_doc_elements",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0224_doc_elements",
    "header_text": "Document Elements",
    "local_header_href": "#document-elements",
    "chunk_text": "<h3>Document Elements</h3><p>We have already used the Document.Elements property a couple of hundred times in previous posts to this blog, so this explanation is rather belated, but addresses a question that does keep on popping up from time to time anyway:\n\n<p><strong>Question:</strong> How can I access the Document.Elements property in C#?\n\n<p>The Revit help document lists the property named Document.Elements, stating that it is an overloaded property providing access to a set of elements from the document. The overloads are listed as\n\n<ul>\n<li>Elements: Provides access to all elements within the document. \n<li>Elements( Filter ): Provides access to all elements which satisfy specified filter. \n<li>Elements( Type ): Provides access to all elements of specified type. \n<li>Elements( Filter, ElementArray ): Collects all elements which satisfy specified filter. \n<li>Elements( Filter, ICollection of Element ): Collects all elements which satisfy specified filter. \n<li>Elements( Type, ElementArray ): Collects all elements which satisfy specified type. \n<li>Elements( Type, ICollection of Element ): Collects all elements which satisfy specified type. \n</li></li></li></li></li></li></li></ul>\n<p>However, when I try to access these properties in C#, the Visual Studio compiler reports an error and says that they do not exist.\nHow can I access these properties in C#?\n\n<p><strong>Answer:</strong> You can look at the C# source code generated automatically by the definition of the Document class by Visual Studio, by positioning the cursor over the Document type and pressing F12.\nThis shows a completely different list of overloads:\n\n<ul>\n<li>public ElementIterator Elements;\n<li>public ElementIterator get_Elements( Filter );\n<li>public ElementIterator get_Elements( Type );\n<li>public int get_Elements( Filter, ElementArray );\n<li>public int get_Elements( Filter, ICollection<element> );\n<li>public int get_Elements( Type, ElementArray );\n<li>public int get_Elements( Type, ICollection<element> );\n</element></li></li></element></li></li></li></li></li></ul>\n<p>As you can see, only the Elements property with no filter or type argument is available using the name given in the help file. \nThe other Document.Elements members are considered to be methods, not properties, and have therefore been automatically decorated with the accessor prefix \"get_\".\nTo call them, you need to prepend \"get_\" and obviously also provide the required arguments.\n\n<p><strong>Question:</strong> How can I access the Document.Elements property in VB?\n\n<p>I have converted some C# sample the code to VB but have an error with a function in the line \n\n<pre class=\"code\">\n  m_doc.getElements(viewFilter, views) \n</pre>\n<p>The error states that .GetElements is not a member of Autodesk.Revit.Document, although I have defined m_doc as an Autodesk.Revit.Document.\n\n<p><strong>Answer:</strong> You can use the Visual Studio Intellisense functionality or the object browser to determine the real name of the method you are trying to invoke in whatever language you prefer to use. \n\n<p>The method or property you are accessing is called Elements in the Revit API help. In C#, it is accessed using the call\n\n<pre class=\"code\">\n  m_doc.get_Elements(viewFilter, views);\n</pre>\n<p>In VB, you have to drop the \"get_\" prefix, so the call is\n\n<pre class=\"code\">\n  m_doc.Elements(viewFilter, views)\n</pre>\n<p><strong>Reply:</strong> Thanks for the response. \nI did try with Elements, but this causes an error saying \"property access must assign to the property or use its value\", as it is returning an Integer. \nThis problem goes away if I use\n\n<pre class=\"code\">\n  Dim i as Integer = m_doc.getElements(viewFilter, views)\n</pre>\n<p>What are we using the return value from this line for anyway?\n\n<p><strong>Answer:</strong> Oops, yes, right you are.\nThe return value of these properties is the number of elements matching the specified criteria.\n\n<p>In VB, this is a read-only property, and the VB syntax requires you to make use of it as such.\nThis means that you must read the value returned by the property, regardless of whether you make use of it or not.\n\n<p>Maybe this is part of the reason why these members are considered methods instead of properties in C#. \nIn C#, you are not forced to read the return value, but you can, if you like.\n</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p>"
  }
]