[
  {
    "original_filename": "0240_rdblink",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0240_rdblink",
    "header_text": "Adding a Column to RDBLink",
    "local_header_href": "#adding-a-column-to-rdblink",
    "chunk_text": "<h3>Adding a Column to RDBLink</h3><p>Probably the most complex Revit SDK sample of all is the RDBLink one.\nWe mentioned it briefly in Anthony Hauck's note on\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2009/07/integration-with-a-database-or-erp-system.html\">\nintegration with a database or ERP system</a>,\n\nbut provided no additional details.\nLike all the SDK samples, RDBLink comes with its own readme document, which is actually a lot more extensive than most others due to the size and complexity of this sample.\nIn brief, RDBLink demonstrates how to export Revit model data into an ODBC database and how to import data back from a database into Revit, possibly modifying or creating new Revit elements.\nHere is a simple question on that topic, answered by my colleague Joe Ye:\n\n<p><strong>Question:</strong> I am using RDBLink to export Revit data to a database.\nI would like to add a few custom columns to the generated tables.\nHow can I do that?\n\n<p>Also, when I dump the data, it overwrites all the previous data.\nCan I append data to existing tables?\n\n<p><strong>Answer:</strong> First the short answer to your second question:\n\n<p>Unfortunately, RDBLink cannot append to existing tables.\nIt always synchronises the Revit document with the exported database.\n\n<p>It is however possible to add custom columns to the exported database.\nWhich table do you want to add columns to?\nWould you please tell me the table name?\n\n<p><strong>Question:</strong> I would like to add a column \"Facility Id\" to the tables:\n\n<ul>\n<li>CurtainSystems\n<li>DistributionSystems\n<li>DuctSystems\n<li>FurnitureSystems\n<li>PipingSystems\n<li>[dbo].[ElectricalEquipment]\n</li></li></li></li></li></li></ul>\n<p><strong>Answer:</strong> To add the columns you require, you can add shared parameters to the respective elements.\nThen RDBLink will automatically generate new columns populated by the values of these shared parameters.\nThe readme file ReadMe_RDBLink.rtf provides more information on this:\n\n<p style=\"color:darkblue\">Create shared parameters: In the database editing form, user can add shared parameters to current document, and after\nthat new fields in the related tables for the elements will be created, user can give values to these new fields.\nAfter importing, these new parameters will be updated.</p>\n<p><strong>Question:</strong> I am quite new to this.\nCan you please give me some more details?\nIs there some other documentation available for it?\n\n<p><strong>Answer:</strong> I just tested adding a shared parameter named 'test' to all doors in a project document and\nthen called the RDBLink external command to export the model data to an access database file.\nThe database contains a new column 'test' generated by this shared parameter, and populates it with the shared parameter values.\nHere is the parameter that I added to the Revit BIM:</p>\n<center>\n<img alt=\"Shared parameter\" src=\"img/rdblink_shared_param.png\"/>\n</center>\n<p>Here is the exported data displayed in the database table:</p>\n<center>\n<img alt=\"Database columns\" src=\"img/rdblink_db_column.png\"/>\n</center>\n<p>The shared parameter can be created using the Revit user interface.\nThe command is described in the Revit product help file HelpArchitectureENU.chm in the Program subfolder, where you can find it through\nRevit Architecture 2010 User's Guide &gt; Customizing Project Settings &gt; Custom Parameters.\n\n<p>Thank you, Joe, for these answers!\n\n<p>Shared parameters can also be created programmatically, and here are some pointers to previous posts on related topics:\n\n<ul>\n<li><a href=\"http://thebuildingcoder.typepad.com/blog/2008/11/adding-a-shared-parameter-to-a-dwg-file.html\">\nAdding a shared parameter to a DWG file</a>.</li>\n<li><a href=\"http://thebuildingcoder.typepad.com/blog/2009/06/adding-a-shared-parameter-to-an-rfa-file.html\">\nAdding a shared parameter to a family</a>.</li>\n<li><a href=\"http://thebuildingcoder.typepad.com/blog/2009/06/model-group-shared-parameter.html\">\nAdding a shared parameter to almost any BIM element, including a model group</a>.</li>\n<li><a href=\"http://thebuildingcoder.typepad.com/blog/2009/08/deleting-a-shared-parameter.html\">\nDeleting a shared parameter</a>.</li>\n<li><a href=\"http://thebuildingcoder.typepad.com/blog/2009/08/shared-parameter-visibility.html\">\nShared parameter visibility</a>.</li>\n</ul>\n</p></p></p></p></p></p></p></p></p></p></p></p>"
  }
]