[
  {
    "original_filename": "0403_2011_wu1",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0403_2011_wu1",
    "header_text": "Revit 2011 Web Update 1",
    "local_header_href": "#revit-2011-web-update-1",
    "chunk_text": "<h3>Revit 2011 Web Update 1</h3><p>Rather belatedly, I note that the first web update of Revit 2011 was released in the beginning of this month and can be downloaded from the public Revit product pages:\n\n<ul>\n<li><a href=\"http://www.autodesk.com/revitarchitecture\">Revit Architecture</a> &gt; <a href=\"http://usa.autodesk.com/adsk/servlet/index?siteID=123112&amp;id=9262001\">Product Download</a></li>\n<li><a href=\"http://www.autodesk.com/revitmep\">Revit MEP</a> &gt; <a href=\"http://usa.autodesk.com/adsk/servlet/item?siteID=123112&amp;id=14973660\">Product Download</a></li>\n<li><a href=\"http://www.autodesk.com/revitstructure\">Revit Structure</a> &gt; <a href=\"http://usa.autodesk.com/adsk/servlet/index?siteID=123112&amp;id=9262026\">Product Download</a></li>\n</ul>\n<p>Here is the list of the API enhancements, which is the same across all three flavours:\n\n<ul>\n<li>Elements will now be properly joined when the ExternalCommand concludes when using automatic regeneration and automatic transaction.\n<li>ExportImage(ImageExportOptions) no longer throws an exception when given a set of views.\n<li>ElementParameterFilters now operate properly against ElementType elements.\n<li>Improves stability when saving a family and there are event subscribers for Save or Save As.\n<li>Closes the Family editor environment after loading a family via the API.\n<li>Improves stability when using selection APIs to pick grid elements.\n<li>Dynamic Model Update: GetChangeTypeGeometry() now triggers properly when active type is changed.\n<li>Improves stability for Dynamic Model Update: when registering updaters and more than one application is registered.\n<li>The new API SunAndShadowSettings.CalculateTimeZone() uses Revits mechanism to calculate the time zone value for a given latitude and longitude. This calculation is more accurate than the results obtained from City.TimeZone.\n<li>Improves performance of display of Analysis Visualization framework when Hardware Acceleration is on.\n<li>VSTA is now allowed for multiple concurrent sessions of Revit; editing the same module by two sessions is prohibited.\n<li>VSTA: Document-level macros no longer become corrupted when the document is workshared and the macro is edited by more than one concurrent session.\n<li>Improves stability when calls to NewFamilyDocument() and PickObjects() are used in sequence.\n<li>VSTA: Revit no longer prematurely exits when opening a project containing corrupted macros.\n<li>The Idling event no longer generates a journal comment for each invocation.\n</li></li></li></li></li></li></li></li></li></li></li></li></li></li></li></ul>\n</p></p>"
  }
]