[
  {
    "original_filename": "0438_ribbon_icon_resolution",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0438_ribbon_icon_resolution",
    "header_text": "Ribbon Icon Resolution",
    "local_header_href": "#ribbon-icon-resolution",
    "chunk_text": "<h3>Ribbon Icon Resolution</h3><p>We are still on the \n\n<a href=\"http://www.classicsailing.de\">\nPantagruel</a>, currently \n\nsailing from Norway to the west coast of Sweden. \nHere is a view from Preikestolen down into Lysefjord, where we went for a hike before leaving the Stavanger area:</p><center>\n<img alt=\"The view from Preikestolen down into Lysefjord\" src=\"file:////j/photo/jeremy/2010/2010-09-06_norway/andreas/dsc06491.jpg\" width=\"400\"/>\n</center><center>\n<img alt=\"First hours on deck\" src=\"file:////j/photo/jeremy/2010/2010-09-06_norway/andreas/dsc06507.jpg\" width=\"400\"/>\n</center><p>That was before getting out onto the open sea and into higher winds, causing us to feel a lot less chirpy:</p><center>\n<img alt=\"Slightly stronger winds and waves\" src=\"file:////j/photo/jeremy/2010/2010-09-06_norway/andreas/dsc06512.jpg\" width=\"400\"/>\n</center><p>The weather has been pleasant all the time, but the wind is very weak now.\nYesterday we caught a few mackerel which we had for dinner.\nFor some reason I ended up playing butcher for the fish, in spite of being the only vegetarian on board.\nI did eat some of them, as well, anyway.\nWe had a nice sunset last night:</p><center>\n<img alt=\"Sunset\" src=\"file:////j/photo/jeremy/2010/2010-09-06_norway/andreas/dsc06524.jpg\" width=\"400\"/>\n</center><p>The view towards the east was like a \n\n<a href=\"http://en.wikipedia.org/wiki/Mark_Rothko\">\nRothko</a> painting, a study in blue:</p><center>\n<img alt=\"Study in blue\" src=\"file:////j/photo/jeremy/2010/2010-09-06_norway/andreas/dsc06527.jpg\" width=\"400\"/>\n</center><p>It was sunny all the time in Norway.\nNow, outside the northern coast of Denmark, we have a light cloud cover, but it is still dry.\nWe had the motor on all through the night from Saturday to Sunday, then sailed all day long Sunday, and turned on the motor again Sunday evening when we passed the southern tip of Norway and headed across more open water towards Skagen on the northern tip of Denmark.\nWe are almost there by now.\n\n<p>Later... almost there was a big exaggeration.\nThe wind came up a bit on Monday, but from the east, which is the direction we were heading.\nWe switched off the motor and sailed but had to cross against the wind, and it took us all day to cross the Skagerrak and arrive close to Skagen.\nOur skipper Micha dropped off us off on the west side of the Skagen peninsula for a beautiful walk along the beach up northwards on the west side beach of Skagen up to the point where the North Sea and the Baltic Sea meet.\nIt is pretty fascinating.\nHe headed out with a reduced crew to cross around the point and get into Skagen harbour from the east side.\nWe did not arrive in Skagen harbour until nine o'clock at night, so the showers and shops were already shut.\n\n<p>Tuesday morning our aim was to leave as early as possible and get over to the islands north of Gothenburg in Sweden, but due to a pure easterly wind we ended up further south on the Danish island of \n\n<a href=\"http://en.wikipedia.org/wiki/L%C3%A6s%C3%B8\">\nLæsø</a>, \n\nwhere I am sitting watching the sunset right now.\n\n<p>You can follow our exact route on the \n\n<a href=\"http://share.findmespot.com/shared/faces/viewspots.jsp?glId=0fQEu0hRkYX5FQpeMDEj8hms84EuXOsRl\">\nPantagruel tracker</a>.\n\n<p>Returning once again to Revit programming, we talked about the Ribbon API and \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/09/simulating-a-ribbon-textbox-label.html\">\nsimulating a textbox label</a> the other day.\n\n<p>Here is another interesting issue concerning the Revit ribbon and the icons used in it that took some research to figure out.\n\n<p><strong>Question:</strong> I have been having problems correctly displaying icons and images in my Revit add-in.  \nIt was difficult to reproduce, but I can finally describe the differences that cause the problem.\n\n<p>It seems as if Revit is influenced by the resolution or DPI (dot per inch) information in the image file. \n\n<p>You can easily see this difference using the Ribbon SDK sample:\n\n<ol>\n<li>Copy the original Ribbon sample project with all its support files. \n<li>Rename Reset.png to something else, and replace it with <a href=\"zip/__icon_16x16_org.png\">__icon_16x16_org.png</a>.\n<li>Rename RectangleWall.png to some other name, and replace it with <a href=\"zip/__icon_16x16_resaved.png\">__icon_16x16_resaved.png</a>.\n<li>Start Revit and check icons. \n</li></li></li></li></ol>\n<p>The first image is the one causing a problem.  \nThe second one was reopened in Paint and simply resaved.  \nBoth images look like this, normally:</p>\n<center>\n<img alt=\"Original icon\" src=\"img/ribbon_icon_resolution_1.png\"/>\n</center>\n<p>But in Revit, the resulting panel looks like this:</p>\n<center>\n<img alt=\"Different icons in Revit ribbon\" src=\"img/ribbon_icon_resolution_2.png\"/>\n</center>\n<p>As you can see, the top image above is not showing correctly, while the lower one looks as expected.  \n\n<p>Looking at the image attributes using Paint &gt; Image &gt; Attributes..., you can see that the resolution or DPI (dot per inch) settings differ.  \nThe one that does not work shows up like this:</p>\n<center>\n<img alt=\"Problematic icon resolution setting\" src=\"img/ribbon_icon_resolution_3.png\"/>\n</center>\n<p>If the file is resaved, it works fine, and the image attributes then look like this:</p>\n<center>\n<img alt=\"Unproblematic icon resolution setting\" src=\"img/ribbon_icon_resolution_4.png\"/>\n</center>\n<p>Apparently, once the image is saved in Paint, the DPI information is stripped out. \nThe file becomes slightly smaller and the resolution changes from 72 to 96 dpi. \n\n<p>Is this an expected behaviour of the image specification?  \nDo I need to take the DPI image attributes into consideration when creating my Revit add-in user interface?\nWhat settings do I have to use?\n\n<p><strong>Answer:</strong> From the technical point of view, the underlying Windows Presentation Foundation technology WPF used in the ribbon postulates 96 dpi as the default resolution setting.\nIf an image has a different resolution such as 72 dots per inch, it will be displayed bigger under 96 dpi. \nI would say that this is expected behaviour. \n\n<p>To have the ribbon display icons the same way you originally see them, you have to use 96 dpi resolution images.\n\n<p>Many thanks to Matt Mason for raising and pursuing this issue and to Mikako Harada and Dominic Zhang for researching and nailing it down so clearly!\n</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p>"
  }
]