[
  {
    "original_filename": "0440_rebar_inside_rebar_cover",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0440_rebar_inside_rebar_cover",
    "header_text": "Adding a Rebar inside a Rebar Cover",
    "local_header_href": "#adding-a-rebar-inside-a-rebar-cover",
    "chunk_text": "<h3>Adding a Rebar inside a Rebar Cover</h3><p>The \n\n<a href=\"http://www.classicsailing.de\">\nPantagruel</a> arrived \n\nsafely in Göteborg last night after our week-long tour of Norway, Denmark and the Swedish west coast, and our last day has arrived.\nTime to clean up, disembark, go to the airport and return home again.\n\n<p>Meanwhile, here is an interesting structural rebar issue raised by my colleagues Katsuaki Takamizawa and Tim Culver:\n\n<p><strong>Question:</strong> Here are some rebars that were created using the Revit API NewRebar method:</p>\n<center>\n<img alt=\"Rebar and rebar cover\" src=\"img/rebar_cover.png\"/>\n</center>\n<p>In the user interface, rebars can only be added inside of a rebar cover represented by the green dotted line. \nIf they are generated using the following code in a column where xVec and yVec fit the width and depth of the column profile, they can extend beyond the rebar cover.\n\n<pre class=\"code\">\n  Rebar createdRebar \n    = doc.Create.NewRebar( barShape, barType, \n      column, origin, xVec, yVec );\n</pre>\n<p>Is it possible to automatically ensure the rebar placement inside of a rebar cover when generating it programmatically? \nOr does one have to adjust the location and scale whenever a rebar is added?\n\nFor instance, using ScaleToBox:\n\n<pre>\n  createdRebar.ScaleToBox( origin, xVec, yVec );\n</pre>\n<p><strong>Answer:</strong> Keep in mind that Revit does not enforce the cover when it is generated programmatically. \nHowever you create the bars, you need to account for the cover yourself.  \nYou can specify the location and scale when generating or adjust by ScaleToBox to place a rebar inside the cover. \nScaleToBox is the same algorithm used internally by the UI. \n\n<p>However, Revit does perform one adjustment automatically: if you place the rebar so that the centre line is close to the cover (within a bar radius, I think) and parallel, the next call to the Regenerate method will move it to attach to the cover. \nYou can see this by moving the rebar in the UI. \n\n<p>There are actually three ways to create and scale the rebar: using the origin and vectors, create from curves, and ScaleToBox, where the latter requires you to create the bar in one of the other ways first.\n\n<p>No matter how you create the bars, Revit never enforces cover, except in case the rebar is very close and parallel.\nI.e., when creating rebars programmatically, the cover cannot be enforced like it is in the user interface, the developer has to take care of that explicitly herself.\n\n<p>Many thanks to Katsu-san and Tim for this explanation!</p>\n</p></p></p></p></p></p></p></p>"
  }
]