[
  {
    "original_filename": "0458_model_review",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0458_model_review",
    "header_text": "Model Review for Standards Compliance",
    "local_header_href": "#model-review-for-standards-compliance",
    "chunk_text": "<h3>Model Review for Standards Compliance</h3><p>We discussed Autodesk Revit \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2009/11/model-review.html\">\nModel Review</a> when \n\nit was originally introduced as a subscription pack add-in for Revit 2010.\n\nIn the last moments before leaving Cairo and my host Mohamed Yamani of\n\n<a href=\"http://www.kemet.com.eg\">\nKemet Corporation</a> yesterday,\n\nwe discussed some of their further Revit application development ideas and customisation needs.\nOne important item they mentioned was automated checking of building standards compliance.\n\n<p>This can obviously be implemented using the Revit API, but of course we wish to avoid reinventing the wheel where possible.\n\n<p>I am absolutely not a product or implementation expert, but I did remember that old post, largely because of frequent contact with its principal implementer \n\n<a href=\"http://cadappdev.blogspot.com\">\nMatt Mason</a>,\n\nalso a regular Autodesk University presenter.\n\n<p>We verified that Kemet already have the model review module installed and were simply not aware of its possible uses, especially its customisation facilities\n which allow a .NET programmer to plug in her own custom checks into the system.\n\n<p>So, surprisingly, in the very last minutes of my visit, yet another issue was resolved.\n\n<p>This is just to point out once again that this extremely useful functionality is available, in case you have similar needs.\n\n<p>By the way, I asked Matt what new functionality has been added to the Model Review application for Revit 2011, to which he replies:\n\n<p>Yes – the Model Review application was updated for 2011 (with some help from Avatech). It is downloadable from the subscription site.\n\n<p>As before, the principal uses of the tool are to check Revit projects or Revit families to determine if they meet with firm-specific or broad standards.\n\n<p>The primary enhancements in 2011 are:\n\n<ul>\n<li>Localized in all Revit languages\n<li>Family support – while the 2010 version could run on families standalone or in a folder, the 2011 version can run on all families embedded within a project (doing the equivalent of an 'Edit Family' to test each family individually).\n<li>Check Conditions – dynamic test to determine if a particular check is appropriate or not. For example, only run a particular check if a family is in the Furniture category, or only run a particular project check if the project is a 'Healthcare facility' type building.\n<li>Document Event-based Running (automatically running on document saves, etc.).\n<li>New Checks in 2011: \n<ul>\n<li>Model Type\n<li>Building Type\n<li>Family Category\n</li></li></li></ul>\n</li></li></li></li></li></ul>\n<p>Many thanks to Matt for the quick overview!\n</p></p></p></p></p></p></p></p></p></p></p>"
  }
]