[
  {
    "original_filename": "0502_gaps_in_shell",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0502_gaps_in_shell",
    "header_text": "Birthdays and Gaps in Shells",
    "local_header_href": "#birthdays-and-gaps-in-shells",
    "chunk_text": "<h3>Birthdays and Gaps in Shells</h3><p>On Wednesday we held our developer conference in Munich.\nIt was very successful, the biggest of these events so far, and we had many interesting discussions, both during the event itself and at the dinner and pool games with partners in the evening.\n\n<p>Thursday we continued with a DevLab, to which any developer interested in any Autodesk API is welcome.\nA couple of us DevTech guys are available, and the space is open for all discussions and questions, with no pre-defined agenda at all.\n\n<p>By the way, we also celebrated the birthday of a very special person, Karl Osti, the main organiser of this whole month-long series of European events:</p>\n<center>\n<img alt=\"Carlo's birthday cake\" src=\"file:////j/photo/jeremy/2010/2010-12-16_devlab_munich/carlo_birthday_cake.jpg\"/>\n</center>\n<p>Another very special person, Kristine Middlemiss, also celebrated her birthday at the DevLab in the Autodesk office in Tokyo yesterday.\nKristine works in the DevTech team with the multimedia and entertainment products:</p>\n<center>\n<img alt=\"Kristine's birthday cake\" src=\"file:////j/photo/jeremy/2010/2010-12-16_devlab_munich/kristine1.jpg\"/>\n</center>\n<br/>\n<center>\n<img alt=\"Kristine's card and brilliant smile\" src=\"file:////j/photo/jeremy/2010/2010-12-16_devlab_munich/kristine2.jpg\"/>\n</center>\n<p>Happy birthday, Karl and Kristine, and \n\n<!-- <a href=\"http://www.smh.com.au/news/big-questions/why-do-you-wish-a-person-many-happy-returns-of-the-day-on-theirbirthday/2005/08/25/1124562965035.html\"> -->\n<a href=\"http://en.wikipedia.org/wiki/Many_Happy_Returns_%28greeting%29\">\nmany happy returns of the day</a>!\n\n<p>Now we have arrived in Milano for yet another DevDay conference. \nWe will continue from here to Farnborough in England beginning of next week, and then finally wrap up and start preparing for Christmas.\n\n<p>Meanwhile, here is an interesting issue related to geometry retrieval from Revit that I encountered a couple of times in the past and that was now reported again by my colleague Katsuaki Takamizawa:\n\n<p><strong>Question:</strong> I am creating triangulated surfaces from a Revit family representing a sink, creating STL files to export the geometry to an external application.\n\n<p>However, some curved surfaces end up having gaps or cracks in them:</p>\n<center>\n<img alt=\"Gaps in shell of sink\" src=\"img/gaps_in_shell_of_sink.png\"/>\n</center>\n<p>I am creating the triangulated surfaces by the following steps:\n\n<ol>\n<li>Retrieve the Revit element.\n<li>Retrieve its faces via Element.get_Geometry().Objects.\n<li>Call Face.Triangulate().get_Triangle() to obtain triangles.\n</li></li></li></ol>\n<p>There also seem to be interferences between some of the resulting faces.\n\n<p>I suspect  this could be some issue with accuracy. \nIs there any way to improve the accuracy in this case? \n\n<p><strong>Answer:</strong> Yes, this is an issue I have run into previously:\nI think you are completely correct in assuming that this has to do with the precision used internally by Revit.\nThere is no way to raise the accuracy used, but I made a suggestion for handling this in those previous cases which seems to help resolve the problem.\n\n<p>The problem is that each face is triangulated independently of the others, and the precision used by Revit is pretty low, so the neighbouring edges end up with gaps between them. \n\n<p>Revit makes use of a fixed approximation size when tessellating edges and comparing points for equality. \nI believe the size used internally is about 1/16 of an inch, or about 0.0052 feet. \nSo you need to \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2009/07/think-big-in-revit.html\">\nthink big in Revit</a>!\n\n<p>My suggestion to handle this is to use the following simple algorithm:\n\n<ol>\n<li>While your add-in application iterates through the solid, its faces, and edges, it should keep track of all XYZ points encountered so far.\n\n<li>Whenever a new point is encountered, it should check whether the new point is \"close\" to any one of the previous points. \nIf it is, ignore the new one and use the existing one instead.\n</li></li></ol>\n<p>Some code that may prove useful for this is my \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2009/05/nested-instance-geometry.html\">\nXyzEqualityComparer helper class</a> and\n\nthe way I make use of it in the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2009/05/nested-instance-geometry.html\">\nGetVertices method</a>\n<p>If you are working with an own epsilon constant for equality comparisons, you should ensure that it is not too small, or you will be requesting a precision from Revit that Revit simply does not support nor care about.\n\n<p>There may be cases where this approach does not solve the issue, but for simple ones I think it should.\nHopefully, your sink geometry falls into the latter category.\n\n<p>You may want to add some assertions to check that the resulting geometry really does have a closed shell of bounding faces in the end with no gaps or cracks.\n\n<p>One developer that I discussed a similar case with reported that this suggestion helped resolve his issue with the following result:\n\n<p>\"We modified our tool and used your hints about the precision and now apply rounding to 0.##. Many problems with the edges disappeared. Because we need to rely on the tessellation, we are going to find the edge loops by ourselves and continue the export with that data.\"\n\n<p>I hope this helps in your case as well.\n</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p>"
  }
]