[
  {
    "original_filename": "0504_list_project_doors",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0504_list_project_doors",
    "header_text": "Modeless Door Lister and Deleter",
    "local_header_href": "#modeless-door-lister-and-deleter",
    "chunk_text": "<h3>Modeless Door Lister and Deleter</h3><p>I arrived safely back home after taking a tranquil and uneventful train ride from Milano through Switzerland.\nNo more airplanes or airports for me this year!\nThere was actually not all that much snow in sight, and no disturbances whatsoever.\nNow I have a couple of days to try to pick up the threads of my normal life again, both work and private, after a full month of nonstop conferences and travelling.\n\n<p>Here is a pretty little sample application by Agnius Vasiliauskas, who also runs a very interesting blog named\n\n<a href=\"http://coding-experiments.blogspot.com\">\nCoding experiments</a> covering \n\na number of programming problems in various languages, with a lot of solutions especially around mathematical Euler problems, image manipulation and analysis.\n\n<p>Agnius made his first excursion into the Revit API, with the following goals:\n\n<ul>\n<li>Create a Revit add-in with the following features:\n<li>Display a modeless form populated with all door instances in the project.\n<li>Show a preview image of each door in the form.\n<li>Add an option to delete each door in the DataGrid context menu.\n</li></li></li></li></ul>\n<p>Agnius adds: \nI want my work to be useful for everybody else who develops for Revit. \nBecause of this, I send you my work, with the hope that maybe you will find it useful too. \n\n<p>I created this add-in entirely from scratch based completely on the following publicly available information:\n\n<ul>\n<li>The <a href=\"http://thebuildingcoder.typepad.com/blog/2010/10/revit-2011-devtv.html\">DevTV recordings</a> provided on the <a href=\"http://www.autodesk.com/developrevit\">Revit Developer Center</a>.\n<li>The information provided in the Revit SDK, e.g. the Revit API help file, developer guide and samples.\n<li>Various posts on <a href=\"http://thebuildingcoder.typepad.com\">The Building Coder</a>.\n</li></li></li></ul>\n<p>Here is a \n\n<a href=\"http://oi51.tinypic.com/2gtoop2.jpg\">\nscreen snapshot of the add-in form</a> to provide a quick preview:</p>\n<center>\n<img alt=\"List project doors\" src=\"img/ListProjectDoors.png\" width=\"400\"/>\n</center>\n<p>Here is the complete \n\n<a href=\"zip/ListProjectDoors.zip\">Visual Studio 2010 C# project</a> for \n\nthis Revit add-in as well.\n\n<p>Some of the solutions incorporated into the project are the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/07/modeless-loose-connectors.html\">\nmodeless dialogue handling</a> using the \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/04/asynchronous-api-calls-and-idling.html\"> \nIdling event</a> to \n\ncommunicate with Revit and the \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/05/get-type-id-and-preview-image.html\">\nElementType preview image</a>.\n\nI totally agree that it can prove useful for others as well.\n\n<p>Agnius' project door lister is a really impressive example of what somebody with good programming knowledge can achieve using the Revit API in very little time, starting from absolutely zero.\nVery many thanks to Agnius for sharing this!\n\n</p></p></p></p></p></p></p></p>"
  }
]