[
  {
    "original_filename": "0527_material_assets",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0527_material_assets",
    "header_text": "Material Assets and FBX",
    "local_header_href": "#material-assets-and-fbx",
    "chunk_text": "<h3>Material Assets and FBX</h3><p>Last year, we discussed analysing the FBX files exported by Revit to access the \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/02/texture-data-uv-coordinates-and-fbx.html\">\ntexture data UV coordinates</a> and \n\nother material and rendering information.\n\nHowever, even something as simple as retrieving the material name from the FBX file is apparently no longer possible.\nThis has led to several questions such as the following:\n\n<p><strong>Question:</strong> When using either the FBX SDK version 2010.2 or 2011.3.1, I can no longer read the material attached to an object from an FBX file exported by Revit 2011.  \nSpecifically, the call to node-&gt;GetMaterial(mat_id) returns NULL, and node-&gt;GetMaterialCount() returns 0.  \n\n<p>However, this works perfectly well for FBX files exported by Revit 2010! \n\n<p>Therefore, this looks like a bug in the way Revit 2011 is exporting FBX files.  \nIt is no longer linking the materials with the objects as before.  \nRegardless of what FBX SDK I use, either one encounters this problem.  \n\n<p>The problem appears to be in the Revit FBX export code in Revit 2011, which is not exposed to us.\nCan you help with this? \n\n<p><strong>Answer:</strong> I have some bad news and some good news for you on this topic. \nLet's start with the bad:\n\n<p>The problem in FBX (and Revit and Max) is that the materials are now encrypted. \nThis prevents anyone from reading the information in the FBX file. \nAutodesk applications having certain libraries can 'convert' the material, but third parties will not be able to get information on materials without going through the Autodesk applications and their APIs.\n\n<p>That means that since you do not have the API to read the data embedded in the FBX file, you are stuck.\n\n<p>This will be fixed eventually on the FBX side, but we are not expecting anything in the near future.\n\n<p>On the other hand, since FBX is a completely separate product and context, I do not expect any FBX-specific features to be added to the Revit API.\n\n<p>So far for the main cause and issue why the materials are not accessible from the Revit FBX export.\n\n<p>Now for the good news, I hope:\n\n<p>Although the access to the materials in the FBX file is probably not going to be resolved in the immediate future, there is some Revit API access to materials.\n\n<p>As you probably know, the Revit SDK Materials sample shows how to read some material information from the Revit model.\n\n<p>It makes use of the .NET TypeDescriptor technology, which is somewhat similar to Reflection, but different. \nHere is the explanation from MSDN:\n\n<span style=\"color:darkblue\">\n<p>The .NET Framework provides two ways to access metadata on a type: the reflection API provided in the System.Reflection namespace, and the TypeDescriptor class. Reflection is a general mechanism available to all types because its foundation is established in the GetType method of the root Object class. The information it returns for a type is not extensible, in that it cannot be modified after compilation of the target type. For more information, see the topics in Reflection.\n\n<p>In contrast, TypeDescriptor is an extensible inspection mechanism for components: those classes that implement the IComponent interface. Unlike reflection, it does not inspect for methods. TypeDescriptor can be dynamically extended by several services available through the target component's Site. The following table shows these services.\n\n</p></p></span>\n<p>The original Materials SDK sample uses the System.ComponentModel namespace, implements a custom type descriptor class RenderAppearanceDescriptor, derived from ICustomTypeDescriptor, and uses that to access certain material properties.\nIt demonstrates 4 main features:\n\n<ol>\n<li>How to get and set the parameters of materials in the current document.\n<li>How to duplicate a material.\n<li>How to change the material of a structural element.\n<li>How to get and set a material's Render Appearance.\n</li></li></li></li></ol>\n<p>Here is an enhanced version of that sample, \n\n<a href=\"zip/Materials2.zip\">\nMaterials2</a>, \n\nwhich implements the following functionality:\n\n<ul>\n<li>Create a new pure red RGB material.\n<li>Create a new metal chrome \"bitmap\" material from an existing one and change some qualities.\n    You cannot change the bitmap or other \"RenderApearance\" aspects as they are stored generically as \"Assets\".\n<li>Curved wall creation and compound structure layer material assignment.\n<li>Furniture type creation and material assignment.\n<li>Floor creation and material assignment.\n</li></li></li></li></li></ul>\n<p>It demonstrates some additional possibilities to access individual elements,\ncreates some new materials and building elements, lists the material properties, and assigns materials to the elements and individual sub-element parts. \nHere is a screen snapshot of the model created:</p>\n<center>\n<img alt=\"Materials2 model\" src=\"img/materials2_model.png\"/>\n</center>\n<p>It contains a wall and a floor whose compound layers have been assigned a new red material, and a desk whose subcomponents have been assigned a new chrome metal material.\n\n<p>The sample also displays a dialogue box listing some of the material asset properties that can be accessed:</p>\n<center>\n<img alt=\"Materials2 asset properties\" src=\"img/materials2_asset_properties.png\"/>\n</center>\n<p>The Revit API does not provide the geometry level access like mapping coordinates, etc., but it does allow you to read some additional material data within Revit.  \nThis access is not officially supported with direct Revit API calls. \n\n<p>Of course this does not resolve anything for the FBX exporter, but it might still be useful when used in conjunction with other tools.\n\n<p>For example, you might be able to output the materials assigned to each object, then in FBX SDK remap them to the elements. \nNot being familiar with FBX SDK, I am not sure how easy that would be, e.g. what identifier to use when mapping the materials, and whether the mapping coordinates would be lost, etc. \nThis should at least provide a starting point, however.\n\n</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p>"
  }
]