[
  {
    "original_filename": "0530_phase_room_properties",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0530_phase_room_properties",
    "header_text": "Phase Dependent Room Properties",
    "local_header_href": "#phase-dependent-room-properties",
    "chunk_text": "<h3>Phase Dependent Room Properties</h3><p>Here is a recent query from a developer on the family instance FromRoom and ToRoom properties. He asked:\n\n<p><strong>Question:</strong> I am unable to retrieve the room associated with certain door and window instances.\n\n<p>I attached a Revit model where the family instance room properties return \"null\", even though the doors are associated with a room.\n\n<p>Why do the ToRoom and FromRoom family instance properties return \"null\" for these doors?\n\n<p><strong>Answer:</strong> I analysed your model and see no issues with the functionality of the inconsistent property values. \nHere is the explanation:\n\n<p>It seems that the cause of this problem is phasing. \nYour model defines three phases: existing, new construction, and optional. \nNo rooms are defined in the optional phase.\n\n<p>The FamilyInstance.FromRoom property returns the room from which the door is opened at the last phase of the project. \nI tried calling the FamilyInstance.FromRoom[Phase] method with a proper phase and it works well.\n\n<p><strong>Response:</strong> I tried using FamilyInstance.FromRoom[Phase] as you suggested, and I am still unable to get the room. \nCan you kindly send me the sample code which you used?\n\n<p><strong>Answer:</strong> Please try the code snippet below.\n\n<p>As said, your model defines the following three phases: Existing, New Construction, and Optional-in order.\n\n<p>The rooms' phasing is \"New Construction\".\n\n<p>The doors' phase created is \"New Construction\" and the phase demolished is \"None\".\n\n<p>The result of running the following code is:\n\n<ul>\n<li>Input phase \"Existing\" throws an exception, because the door does not exist in the given phase.\n<li>Input phase \"New Construction\" returns the rooms.\n<li>Input phase \"Optional\" returns null, because no rooms are defined in this phase.\n</li></li></li></ul>\n<pre class=\"code\">\n  <span class=\"blue\">foreach</span>( <span class=\"teal\">Phase</span> phase <span class=\"blue\">in</span> doc.Phases )\n  {\n    <span class=\"blue\">try</span>\n    {\n      <span class=\"teal\">Room</span> froom = door.get_FromRoom(phase);\n      <span class=\"teal\">Room</span> troom = door.get_ToRoom(phase);\n    }\n    <span class=\"blue\">catch</span>( System.<span class=\"teal\">Exception</span> ex )\n    {\n      ...\n    }\n  }\n</pre>\n<p><strong>Response:</strong> It is working and I am able to retrieve the room now.\n\n<p>Just one more thing to be aware of... Watch your phases!\n</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p>"
  }
]