[
  {
    "original_filename": "0640_changetypeid",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0640_changetypeid",
    "header_text": "Changing the Type of Many Instances",
    "local_header_href": "#changing-the-type-of-many-instances",
    "chunk_text": "<h3>Changing the Type of Many Instances</h3><p>Did you ever run into a performance problem changing the type of a large number of family instances?\n\n<p>Well, is you use the Element Symbol property or ChangeTypeId method to change them one by one, such as we did to set the type of a\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/06/set-tag-type.html\">\ntag</a>,\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/02/set-elbow-fitting-type.html\">\nelbow fitting</a> or\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/06/modifying-cable-tray-shape.html\">\ncable tray</a>,\n\nthat may trigger a regeneration within Revit for each call, even if you are using manual regeneration mode and not explicitly asking for a regeneration yourself.\nChanging a family instance type requires subsequent regeneration.  \n\n<p>Bad news.\n\n<p>But hey, wait, there is good news as well!\n\n<p>You may not have noticed another overload of the Element.ChangeTypeId method. \n\n<p>The second overload is static, does not operate on only specific single element instance, and instead takes a whole collection of element instances to operate on.\n\n<p>And the good news is that that overload changes the type of all elements in the given set at once, with only one regeneration at the end.\n\n<p>Give it a whirl and let us know whether it helps.\n\n<p><strong>Addendum:</strong> As Rudolf Honke points out, you can use the method Element.IsValidType taking the three arguments Document, ICollection elementIds, ElementId typeId to check beforehand whether all elements can accept the new element type. Thank you, Rudolf!\n</p></p></p></p></p></p></p></p></p>"
  }
]