[
  {
    "original_filename": "0651_au_2011_revit_classes",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0651_au_2011_revit_classes",
    "header_text": "Revit and AEC API Classes at Autodesk University",
    "local_header_href": "#revit-and-aec-api-classes-at-autodesk-university",
    "chunk_text": "<h3>Revit and AEC API Classes at Autodesk University</h3><p>As you certainly know by now, \n\n<a href=\"http://au.autodesk.com\">\nAutodesk University</a> is \n\nan excellent opportunity to meet with the top experts in your industry and learn about the latest trends and technologies that will help you stay competitive.\nHere are some of the benefits:\n\n<ul>\n<li>Learn techniques to use in your job right away. Whether you're designing buildings, routing transcontinental pipelines, or animating the next blockbuster movie, you can learn something immediately useful at AU.\n\n<li>Find out what others are doing. AU is the perfect place to find out what everyone else is up to and how they're doing it.\n\n<li>Peek into the future. Learn about, and even influence, the direction of upcoming Autodesk products. See what leading-edge firms have to offer in the Exhibit Hall.\n\n<li>Make important business contacts. Find firms with complementary skills or colleagues with needed expertise.\n</li></li></li></li></ul>\n<p>Autodesk University is returning to \n\n<a href=\"http://www.venetian.com\">\nThe Venetian Hotel</a> in \n\nLas Vegas, Nevada, this year. \nThe event runs from November 29 until December 1, 2011, and \n<a href=\"http://au.autodesk.com\">general registration is now open</a>.\n\n<p>I \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/08/reference-to-analytical-curve.html\">\nalready mentioned</a> my \n\nclasses at Autodesk University in Las Vegas December, and Kean provided\n\n<a href=\"http://through-the-interface.typepad.com/through_the_interface/2011/08/preview-of-the-au-2011-class-catalog.html\">\na list of all classes provided by the ADN DevTech team</a>.\n\n<p>Besides these, there are several classes of extra special interest to all Revit developers, given by member of the Revit development team themselves. \nStraight from the horse's mouth, so to speak.\nHere is a non-exhaustive list of classes that DevTech and the Engineering teams are planning to give on AEC related topics at AU this year:\n\n<ul>\n<li><a href=\"http://au.autodesk.com/?nd=event_class&amp;session_id=9124&amp;jid=1725932\">CP4011</a> Geometric Progression: Further Analysis of Geometry Using the Autodesk Revit 2012 API by Scott Conover, Revit API Development Manager\n<li><a href=\"http://au.autodesk.com/?nd=event_class&amp;session_id=9235&amp;jid=1725932\">CP4352</a> Efficiently Find the Information You Want Using the Autodesk Revit API by Kevin Vandecar, Principal Developer Consultant\n<li><a href=\"http://au.autodesk.com/?nd=event_class&amp;session_id=9263&amp;jid=1725932\">CP4451</a> &amp; <a href=\"http://au.autodesk.com/?nd=event_class&amp;session_id=9726&amp;jid=1725932\">CP6760-L</a> Extensible Storage in the Autodesk Revit 2012 API by Jeremy Tammik\n<li><a href=\"http://au.autodesk.com/?nd=event_class&amp;session_id=9267&amp;jid=1727895\">CP4453</a> Everything in Place with Autodesk Revit MEP Programming by Jeremy Tammik\n<li><a href=\"http://au.autodesk.com/?nd=event_class&amp;session_id=9528&amp;jid=1727602\">CP5211</a> Autodesk Revit Construction Modeling and API for Builders by Harry Mattison, Principal Engineer\n<li><a href=\"http://au.autodesk.com/?nd=event_class&amp;session_id=9879&amp;jid=1725932\">CP5381</a> Asynchronous Interactions and Managing Modeless UI with the Autodesk Revit API by Arnost Lobel, Principal Engineer and Miroslav Schonauer, Senior Technical Consultant\n<li><a href=\"http://au.autodesk.com/?nd=event_class&amp;session_id=9038&amp;jid=1738541\">CP3480</a> Customizing Autodesk Navisworks 2012 with the .NET API by Michael Priestman, Navisworks Development Manager\n</li></li></li></li></li></li></li></ul>\n<p>It would be great to see you there!\n</p></p></p></p></p>"
  }
]