[
  {
    "original_filename": "0689_export_solid_to_acis",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0689_export_solid_to_acis",
    "header_text": "Export Solid to ACIS",
    "local_header_href": "#export-solid-to-acis",
    "chunk_text": "<h3>Export Solid to ACIS</h3><p>Today we are en route to Tel Aviv in Israel after the successful conference held in Moscow yesterday.\nIn Tel Aviv I even have a personal activity lined up, besides the official reason for going there to hold another conference on Wednesday: a\n\n<a href=\"http://en.wikipedia.org/wiki/5Rhythms\">\n5Rhythms</a>\n<a href=\"http://www.5rhythms-rivi.co.il/Preview.asp?Page=7594&amp;WebsiteID=3751\">\nCity Wave</a> is\n\noffered very Tuesday evening by Rivi Diamond and fits my schedule perfectly.\nThat will provide another wonderful change from airplanes, taxis, hotels, and conferences.\n\n<p>Meanwhile, here is a sweet little question on exporting a Revit solid to ACIS raised yesterday by Ishwar Nagwani and answered by Miroslav Schonauer and Emmanuel Weyermann:\n\n<p><strong>Question:</strong> Is there any way to programmatically create an ACIS file from an individual solid?\n\n<p>For example, AutoCAD ObjectARX provides the method AcDbBody::acisout to achieve this.\n\n<p>As far as I can tell, the Revit API only supports exporting entire views to ACIS. \n\n\n<p><strong>Answer:</strong> You can programmatically create a 3D view, loop through all the visible elements in the view to set the individual element visibility ON for your desired solid element and OFF for all others, and export the view to the SAT file format.\n\n<p>The whole operation can be encapsulated in a transaction that is never committed and aborted afterwards so the database is not affected by this operation.\n\n<p>I can confirm that this works, because we have actually used this exact strategy ourselves.\n\n<p>Many thanks to Ishwar, Miro and Emmanuel for raising and resolving this issue!\n</p></p></p></p></p></p></p></p></p>"
  }
]