[
  {
    "original_filename": "0708_point_cloud_unit_conv",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0708_point_cloud_unit_conv",
    "header_text": "Point Cloud Unit Conversion",
    "local_header_href": "#point-cloud-unit-conversion",
    "chunk_text": "<h3>Point Cloud Unit Conversion</h3><p>Happy New Year of the Dragon!</p><center>\n<img alt=\"Happy New Year of the Dragon\" src=\"img/year_of_the_dragon.png\" width=\"400\"/>\n</center><p>Top: Happy New Year!\n\n<p>Bottom: Lucky Peace!\n\n<p>The Chinese dragon is the symbol of emperor and power.  \n\n<p>Thanks to Joe Ye and <a href=\"http://www.nipic.com\">nipic.com</a> for the image and translation!\n\n<p>Besides programming Revit and climbing mountains, I also like climbing trees:</p>\n<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"274\" src=\"http://www.youtube.com/embed/gbs4sb-wcJo\" width=\"480\"></iframe>\n<p>Returning to the Revit API, the topic of \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/units\">\nunits</a> is\n\na recurring theme, and here it is again rearing its beautiful head in the context of point cloud data access:\n\n<p><strong>Question:</strong> I am working on a point cloud engine implementation for Revit. \nIn the IPointCloudAccess interface, the GetUnitsToFeetConversionFactor method seems to define the factor between the point cloud units and feet. \nIt is not working properly for me, though. \nThe only way I am able to use it so far is to convert all my points into feet myself and have this method return a constant factor of 1.0.\n\n<p>My point clouds always have a unit of measure, which is currently defined in meters, so an \ninternal data item of 1 means 1 meter. \nIf the Revit model's internal data also uses a fixed built-in length unit and not the unit preference to visible in the user interface, then the conversion between the point cloud data and the Revit model is fixed. \nOtherwise, if the Revit model's internal data is unitless (like AutoCAD DWG), the customer has to determine what unit is to be used to map the points into the model.\n\n<p>In the Revit user interface, I experimented with creating a circle and saving it. \nWhen it is selected, it displays the radius in the current user interface unit preference. \nIf I change the unit preference, it displays a new value, showing that the actual radius did not change. \nThis makes me believe that the internal data has a unit of measure. \nWhat is it? \nIs there a difference between the US English and German versions of Revit?\n\n<p><strong>Answer:</strong> The explorations you describe toward the end of your query are leading in the absolutely right direction, and the solution is very simple, but not obvious.\n\n<p>Revit does indeed use a fixed internal database unit for all length measurements, and that unit is the imperial foot.\nThere is thus no difference between the different versions and languages of Revit; they all use the same internal database unit.\nThis fact is special enough to deserve a \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/03/internal-imperial-units.html\">\nseparate discussion</a> of its own.\n\n<p>A test very similar to the one you describe can easily be expanded to reliably determine the conversion factor between any given user interface unit and the internal Revit database one, as explained in the discussion of \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/01/unit-conversion-and-new-blogs.html\">\nunit conversion</a> and\n\npreceding posts.\n\nYou can also look at the entire collection of \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/units\">\nunit topics</a>.\n\n<p>Here is a suggestion on how to implement the IPointCloudAccess interface GetUnitsToFeetConversionFactor method, assuming the point cloud data is given in millimetres:\n\n<pre class=\"code\">\n  <span class=\"blue\">class</span> <span class=\"teal\">PointCloudAccess</span> : <span class=\"teal\">IPointCloudAccess</span>\n  {\n    <span class=\"blue\">const</span> <span class=\"blue\">double</span> _mm_per_inch = 25.4;\n    <span class=\"blue\">const</span> <span class=\"blue\">double</span> _mm_per_foot = 12 * _mm_per_inch;\n    <span class=\"blue\">const</span> <span class=\"blue\">double</span> _mm_to_feet = 1.0 / _mm_per_foot;\n \n    <span class=\"blue\">public</span> <span class=\"blue\">double</span> GetUnitsToFeetConversionFactor()\n    {\n      <span class=\"blue\">return</span> _mm_to_feet;\n    }\n \n    <span class=\"green\">// . . .</span>\n \n  }\n</pre>\n</p></p></p></p></p></p></p></p></p></p></p></p>"
  }
]