[
  {
    "original_filename": "0750_dispose_transact",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0750_dispose_transact",
    "header_text": "Scope and Dispose of Transactions",
    "local_header_href": "#scope-and-dispose-of-transactions",
    "chunk_text": "<h3>Scope and Dispose of Transactions</h3><p>Arnošt Löbel added an important comment on the sample code that I published for \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/04/devcamp-and-refresh-display-for-a-kinetic-facade.html\">\nrefreshing a view</a>:\n\n<p>It is for the best if all transaction objects are always properly scoped, e.g. within a C# 'using' block. \nThis includes transactions, sub-transactions, transaction groups, and other scope-like objects such as StairsEditScope. \nNot doing so can yield some pretty weird situations when exceptions come into play.\n\n<p>In your example, proper scoping can be implemented by adding 'using' statements, which automatically dispose of the objects when they leave the scope, like this:\n\n<pre class=\"code\">\n  <span class=\"blue\">using</span>( <span class=\"teal\">TransactionGroup</span> group \n    = <span class=\"blue\">new</span> <span class=\"teal\">TransactionGroup</span>( doc ) )\n  {\n    group.Start( <span class=\"maroon\">\"Muda a fachada\"</span> );\n \n    <span class=\"blue\">using</span>( <span class=\"teal\">Transaction</span> tran \n      = <span class=\"blue\">new</span> <span class=\"teal\">Transaction</span>( doc ) )\n    {\n      tran.Start( <span class=\"maroon\">\"Step 1 \"</span> );\n      Calcula_Padrao( doc, Paneis, 0.10 );\n      tran.Commit();\n \n      uidoc.RefreshActiveView();\n \n      <span class=\"teal\">Thread</span>.Sleep( 2000 );\n \n      tran.Start( <span class=\"maroon\">\"Step 2 \"</span> );\n      Calcula_Padrao( doc, Paneis, 0.4 );\n      tran.Commit();\n \n      uidoc.RefreshActiveView();\n \n      <span class=\"teal\">Thread</span>.Sleep( 2000 );\n \n      tran.Start( <span class=\"maroon\">\"Step 3 \"</span> );\n      Calcula_Padrao( doc, Paneis, 0.05 );\n      tran.Commit();\n \n      uidoc.RefreshActiveView();\n \n      <span class=\"teal\">Thread</span>.Sleep( 2000 );\n \n      tran.Start( <span class=\"maroon\">\"Step 4 \"</span> );\n      Calcula_Padrao( doc, Paneis, 0.4 );\n      tran.Commit();\n \n      uidoc.RefreshActiveView();\n    }\n    group.Assimilate();\n  }\n</pre>\n<p>This is the safest way to guarantee that scoped objects are destroyed in the proper order. \nIn this case, the transaction must be destroyed (and committed or rolled back) before the group is finished. \nIf not, an exception will be thrown, and since it would be thrown during garbage collection, the consequences are hard to predict.\n\n<p>Here is \n\n<a href=\"zip/FachadaCinetica2.zip\">FachadaCinetica2.zip</a> containing\n\nan updated version of the kinetic facade sample command with proper scoping and including the complete Revit 2013 source code, Visual Studio solution and add-in manifest.\n\n<p>Oh, and by the way, the final result of the kinetic facade sample up and running can be viewed on Prof. José Luis Menegotto's \n\n<a href=\"https://sites.google.com/a/poli.ufrj.br/dc_menegotto/programacao-autolisp/ArqCin\">\nKinetics Architecture</a> page\n\nfor both AutoCAD and Revit.\n\n<p><strong>Question:</strong> How is it if I have a normal external command and just start and commit a transaction within the command Execute method?\n\n<p>Does that require me to add a 'using' block around it as well, or does it get cleaned up properly by itself automatically?\n\n<p><strong>Answer:</strong> Basically, the same rules apply. \nI recommend always scoping inside 'using' blocks. \n\n<p>Again, it makes no difference if no unhandled exceptions are thrown during your command, but if they are, it might trigger some harsh treatment from the API firewall:\n\n<ul>\n<li>If you only have one transaction, which is still open: it will be rolled back and render your command unsuccessful (with a message to the user). If the GC destroys it before the API framework finds that it was left open (unlikely, but possible), it will still be rolled back, but there may be an extra error message in the journal.\n<li>If you have more than one transaction in your command and an unhandled exception is thrown while your last transaction is still open, Revit will undo ALL your transactions; your command will be a complete failure.\n<li>Things may get complicated with sub-transactions and a transaction group. Those may be nested, and Revit requires that the phases are closed in reverse order to how they were opened, meaning the inner-most phases must be closed first, while the outer-most (most likely a transaction group) must be closed last. Things can go wrong if the GC starts collecting those unfinished phases and finalises them out of order, which is perfectly possible. Revit will throw an exception when that happens, which is not going to be good if this is already happening in an exception. The framework always tries to resolve the situation as best it can, but I have heard of some unhappy endings (if I may say so).\n</li></li></li></ul>\n<p>In addition, the API may start providing more of these scope-like objects in the future, and it is better get into habit of scoping them properly in your C# and VB code, something provided automatically and for free in C++.\n\n</p></p></p></p></p></p></p></p></p></p></p>"
  }
]