[
  {
    "original_filename": "0789_central_filename",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0789_central_filename",
    "header_text": "Worksharing Central Filename",
    "local_header_href": "#worksharing-central-filename",
    "chunk_text": "<h3>Worksharing Central Filename</h3><p>Here is a simple question that several people stumbled over and apparently can use some clarification:\n\n\n<p><strong>Question:</strong> In Revit 2012, I used the Document WorksharingCentralFilename property to get the location of the central file.\n\n<p>This is marked as deprecated in Revit 2013, and the API suggests using GetWorksharingCentralModelPath instead.\n\n<p>In my experiments with a central file, I can use this function to obtain a ModelPath object which provides a property named CentralServerPath, but it is blank.\n\n<p>How can I recreate the functionality of the deprecated WorksharingCentralFilename property?\n\n\n<p><strong>Answer:</strong> CentralServerPath is the wrong thing to call to get the path to the central model.\nIt is the path to Revit Server itself.\n\n<p>You obviously need to be clear about whether you are using Revit Server or file-based centrals.\nThe central server path for a file-based central is obviously blank.\n\n<p>The ModelPath class belongs to the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/03/many-issues-resolved.html\">\nlinked model related functionality</a> provided\n\nin the Revit 2012 API, which also includes the ModelPathUtils class.\n\n<p>A ModelPath stores a path to a location on disk, a network drive, or a Revit Server location.\n\n<p>ModelPathUtils provides methods for converting between ModelPath and String.\n\n<p>When working with ModelPath objects, you can use the Compare method to test for equality or for ordering, the predicates IsServerPath and IsFilePath to test whether the path is file-based or server-based, and the ModelPathUtils ConvertModelPathToUserVisiblePath method to convert a ModelPath to a string.\n\n<p>The latter is demonstrated in the discussion of\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/05/list-linked-files-and-transmissiondata.html\">\nlisting linked files and the TransmissionData class</a>.\n\n<p>Other examples of using ModelPathUtils are given in the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/07/importexport-update.html\">\nImportExport update</a>,\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/11/access-transmissiondata-of-central-file-on-revit-server.html\">\naccessing central file TransmissionData on Revit Server</a>,\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/03/remove-dwf-links.html\">\nremoving DWF links</a>,\n\nand most esoterically for\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/05/selecting-a-face-in-a-linked-file.html\">\nselecting a face in a linked file</a>.</p></p></p></p></p></p></p></p></p></p></p></p></p>"
  }
]