[
  {
    "original_filename": "0819_ifc_guid",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0819_ifc_guid",
    "header_text": "IFC GUID Generation and Uniqueness",
    "local_header_href": "#ifc-guid-generation-and-uniqueness",
    "chunk_text": "<h3>IFC GUID Generation and Uniqueness</h3><p>We looked at IFC GUIDs a couple of times already, e.g. to discuss the relationship between\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2009/02/uniqueid-dwf-and-ifc-guid.html\">\nUniqueId, DWF and IFC GUID</a>,\n\nthe \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/06/ifc-guid-algorithm-in-c.html\">\nExportUtils.GetExportId method</a>, \n\nand the \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/06/ifc-guid-algorithm-in-c.html\">\nIFC GUID representation algorithm</a>.\n\n<p>The Revit 2012 API introduced the ExporterIFCUtils class for customizing IFC export, and the \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/09/revit-ifc-exporter-released-as-open-source.html#2\">\nIFC exporter was released as open source</a>.\n\n<p>In Revit 2013, the IFC export implementation switched to a more generic toolkit, many of the APIs introduced in Revit 2012 were removed and replaced, and new interfaces introduced that allow more flexibility in the data which is written to the IFC file. \n\n<p>Here is some clarification on some of the methods associated with IFC GUIDs:\n\n<!-- okat (olli) wrote: -->\n<p><strong>Question:</strong> Can you please tell me how these ExporterIFCUtils functions should work:\n\n<ul>\n<li>CreateGUID\n<li>CreateGUID(Element)\n<li>CreateAlternateGUID(Element)\n<li>CreateSubElementGUID(Element, int)\n</li></li></li></li></ul>\n<p>I was hoping that at least one of them would generate a consistent GUID, but it seems that they are different in every run. \nHow can I generate a consistent IFC GUID for a given element?\n\n<!--\nThanks!\n\navelez (angel) wrote:\n-->\n<p><strong>Answer:</strong> The one and only really unique id maintained by Revit and guaranteed to be unique and stable for elements across worksharing environments is the UniqueId, which is a combination of a GUID and the history signature identifying the history of a workshared file.\n\n<p>That said, the IFC GUID is also unique across sessions.  \nThis is one of the requirements of IFC.  \nIf I export a wall in one session via IFC, close the session, reopen the document, and reexport, the GUID remains the same for that wall, and should be different from any other wall's GUID.\n\n<p>The method CreateGUID with no arguments however does indeed create a random GUID every time.  \n\n<p>The other routines are intended to be stable.\n\n<p>For a given Element with an Element Id in a Document, the two methods CreateGUID(Element) and CreateAlternateGUID(Element) should create two consistent GUIDs.\n\n<p>For a given Element with an Element Id and an index (the int) in a Document, the method CreateSubElementGUID(Element, int) should create a consistent GUID, based on the GUID created with CreateGUID above.\n\n<!-- \n\nCan you provide an example where these routines aren't working as stated above?\n\narnostlobel wrote:\n\n<p>On the other hand, the GUID you obtain from IFC (or DWF, for that matter) is not a unique Id (between Revit runs) and it is not expected to be mapped back to Revit elements once an IFC (or DWF) file has been exported. \nThe GUID is only guaranteed to be unique between different exported documents, to make it possible to cross-reference elements across IFC (DWF) documents.\n\n-->\n<p>For more information, please refer to the description of the ExportUtils.GetExportId method.\n\n\n\n<!-- okat wrote: -->\n<p><strong>Response:</strong> That makes sense. \nUnfortunately, the GUID is different in every run for me.\n\n<!--\n<p>I submitted a new problem report Quasar SPR:0555 where attached a Revit & VS project (add-in) to demonstrate the issue. There's just a air terminal which is used to generate the GUID.\n\n<p>Using Revit's internal IFC export, GUIDs seems to be consistent as far I have noticed... \n\n<p>Hmmm...this is starting to be quite strange and frustrating...what I'm doing wrong?\n-->\n<p>The CreateProjectLevelGUID method also returns a different GUID in every run. \nI guess it should also be consistent, shouldn't it? \n\n<!-- avelez wrote: -->\n<p><strong>Answer:</strong> After some investigation we now understand the source of the issue.  \nThe GUID generation routines have an internal cache that prevents duplicate GUIDs from being generated.  \nIn IFC, these functions are called once per element, and then a call to the ExporterIFCUtils.EndExportInternal method clears this cache for the next IFC export.  \nPlease note that the first time you call these routines, they have consistent values from previous sessions. \n<p>For now, there are two workarounds:\n\n<ol>\n<li>Only call the functions once per session, and store their values.\n<li>Call ExporterIFCUtils.EndExportInternal to reset the internal cache.\n</li></li></ol>\n<p>I would recommend #1 over #2, as the EndExportInternal call does more than just clear the cache, and may have unintended consequences.\n\n<!-- okat wrote: -->\n<p><strong>Response:</strong> Thank you very much for your explanation. \nIt makes perfectly sense now.\n\n<p>The workarounds you mention may solve this but have some drawbacks:\n\n<ul>\n<li>I can't use the EndExportInternal method because I'm not using the Revit IFC API and therefore I don't have access to an ExporterIFC object.\n<li>I don't want to start building my own cache, because it would not be 100% water proof, and who knows how much memory it would eventually consume with really huge projects.\n</li></li></ul>\n<p>Fortunately, there's a third workaround which I decided to implement. \nI combined the \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/06/ifc-guid-algorithm-in-c.html\">\nIFC GUID representation algorithm</a> showing \n\nhow to construct an IFC GUID from a 'normal GUID' with the ExportUtils.GetExportId functionality, which produces a consistent GUID between runs.\n\n<p>Can you see any problems in this approach? \n\n<!-- avelez wrote: -->\n<p><strong>Answer:</strong> A couple of comments:\n\n<p>First of all, the approach you ended up using is the one that I was going to suggest (or close enough!)  \nYou should indeed go for that.  \n\n<p>Secondly, just to clear up one point, the Revit IFC API is part of the Revit API – if you have the Revit API, you also have the Revit IFC API.  \n\n<!--\n\nThat said, you are correct that it isn't a good idea to misuse the API!\n\nHere are some other observations:\n\nThis information was also useful to solve the following question:\n\n07171219 [Export to IFC - GUID generation logic]\n\nC:\\a\\j\\adn\\case\\sfdc\\07171219\\ifc_guid.pdf\n\n-->\n<p><strong>Question:</strong> In another case, we are exporting models from Revit Architecture to IFC and observe that the GUIDs of some entities are not consistent, e.g. of IFCRelationship, IFCTypeObject and IFCPropertySetDefinition.\n\n<p>We are not making any changes to the model, just exporting it twice.\nStill, the exported IFC files contain different GUIDs generated for those entity types.  \n\n<p>The GUID for geometric entities like IFCDOOR, IFCWalllStantdardCase etc. do not change.  \n\n<p>What might be causing this behaviour?\n\n\n<p><strong>Answer:</strong> The algorithm for generating a consistent IfcGUID depends on the IFC entity in question having a constant and predictable relationship to a Revit element.  For something like an IFCDOOR, there is a one-to-one relationship between that and a Revit door element, so we can guarantee a consistent IfcGUID.  \n\nFor things like relationships, we either \n\n<ol>\n<li>Don't have a way to make this 1-1 relationship, \n<li>Don't have enough \u001cbits\u001d to make a GUID that is unique, or \n<li>Haven't come up with or implemented the algorithm yet.\n</li></li></li></ol>\n<!-- SPR 167219 covers some of these cases, and they cover the three options above. -->\n<p>For example, for IFCRELSPACEBOUNDARY, how do you uniquely define one or more connections between a room and a nearby wall? \nThis is an example of case 1.\n\n<p>For IFCPROPERTYSET, there is a mechanism in place for some elements that allows for a consistent GUID, so this is partially done and partially case 3.\n\n<p>IFCDOORSTYLE should be handled reliably.\n \n<!-- If the user can state which cases are particularly important and why, we can prioritize those cases, if it is possible at all. -->\n\nAs with most things in IFC, it is a combination of being able to do it and having time to do it.\n\n<!--\n\n<p>Besides, there was also some discussions on the IFC GUIDs in the Revit Beta forums which I am attaching with this email for your reference, as well.\n\n<pre class=\"code\">\n</pre>\n\n<p><strong>Question:</strong> \n\n<p><strong>Answer:</strong> \n\n<ul>\n<li>\n</ul>\n\n<a name=\"2\"></a>\n\n<h4></h4>\n\n<pre class=\"code\">\n</pre>\n\n<a href=\"\">\n</a>\n\n-->\n</p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p></p>"
  }
]