[
  {
    "original_filename": "0835_element_intersection",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0835_element_intersection",
    "header_text": "Element Intersection",
    "local_header_href": "#element-intersection",
    "chunk_text": "<h3>Element Intersection</h3><p>A common question when analysing a BIM is determining whether any of its elements intersect.\n\n<p>This was actually surprisingly difficult to answer programmatically in Revit a few releases back, as some of the interesting uses of the FindReferencesByDirection method show, for example the FindColumns SDK sample.\nLater, that method was enhanced to lead to FindReferencesWithContextByDirection.\n\n<p>The FindColumns sample searches for intersections between walls and columns by shooting a ray along the wall centre line, raised above the bottom level by a foot or so, and detecting any columns hit by it.\nOne obvious problem with this approach is its inaccuracy – any column just partially intersecting the wall may easily be missed by the ray.\n\n<p>A few years ago, that was the best an add-in developer could hope for, and things looked even worse before the advent of these methods.\n\n<p>So what is the situation today?\nIn short:\n\n\n<p><strong>Question:</strong> How can I programmatically detect whether two Revit elements intersect?\n\n\n<p><strong>Answer:</strong> You can now perform a Boolean operation on Revit element solids and determine whether they intersect using the BooleanOperationsUtils class ExecuteBooleanOperation method.\n\n<p>Please note that the resulting intersection solid is transient, in-memory only.\nIt can be used for calculation and short-term visualisation using the analysis visualisation framework AVF, but it cannot be added to the Revit database or made persistent.\n\n<p>This class was introduced in the Revit 2012 API, and the \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/05/revit-2012-api-webcast.html\">\nassociated webcast</a> showed \n\nit being used impressively in a much improved version of the FindColumns SDK sample.\nThis version determines the exact intersection solids between all columns and walls instead of roughly approximating the intersection detection by casting a single ray, and displays them to the user through AVF.\n\n<p>The Boolean intersection demo is described in detail and the source can be downloaded from the discussion of a simpler derived sample\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/12/using-avf-to-display-intersections-and-highlight-rooms.html\">\nusing AVF to highlight rooms</a>.\n\n<p>Another example of making use of this class is given by the GeometryCreation_BooleanOperation SDK sample.\n\n<p>Finally, here are two discussions on element intersection before the introduction of the BooleanOperationsUtils class, on \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2010/06/intersection-between-elements.html\">\nintersection between elements in Revit 2011</a> and\n\nthe \n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2011/06/boolean-operations-and-instancevoidcututils.html\">\nInstanceVoidCutUtils class</a>.\n\n\n<a name=\"2\"></a>\n<h4>AEC Technology Update</h4>\n<p>If you are interested in a succinct summary of all the key developments in the AEC technology industry in the past couple of months, here is a potantial cancidate: the \n\n<a href=\"http://www.aecbytes.com/newsletter/2012/issue_59.html\">\nAEC Technology Updates, Fall 2012</a>,\n\nincluding some snippets of Autodesk related news such as Revit LT and the Vela acquisition.\n</p></p></p></p></p></p></p></p></p></p></p></p></p>"
  },
  {
    "original_filename": "0835_element_intersection",
    "header_text": "AEC Technology Update",
    "local_header_href": "#aec-technology-update",
    "chunk_text": "<h4>AEC Technology Update</h4><p>If you are interested in a succinct summary of all the key developments in the AEC technology industry in the past couple of months, here is a potantial cancidate: the \n\n<a href=\"http://www.aecbytes.com/newsletter/2012/issue_59.html\">\nAEC Technology Updates, Fall 2012</a>,\n\nincluding some snippets of Autodesk related news such as Revit LT and the Vela acquisition.\n</p>"
  }
]