[
  {
    "original_filename": "0841_point_cloud_batching",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0841_point_cloud_batching",
    "header_text": "Point Cloud Request Batching",
    "local_header_href": "#point-cloud-request-batching",
    "chunk_text": "<h3>Point Cloud Request Batching</h3><p>Here is some important information for point cloud engine developers, who may be confused by the SDK samples provided.\n\n\n<p><strong>Question:</strong> We have taken the Revit point cloud engine example provided and modified it to create three cells, each loading its points from an ASCII file. \nThe cell boundary is then drawn as blue random points.\n\n<p>We noticed that the maximum number of points ever requested is 512 * 512 and decreases as you zoom out. \nThis number is applied to all cells, so the third and second cells disappear rather that fewer points being drawn in each cell.\n\n<p>This of course prompts some questions:\n\n<ol>\n<li>What sets the size of the buffer that is to be filled with points?\n<li>How does the point engine pass the buffer to each cell such that a closer cell would be requesting more points than one in the distance?\n</li></li></ol>\n<p><strong>Answer:</strong> An instance of the IPointCloudAccess class will be requested by Revit when drawing the point cloud in the view.  \nFor performance reasons, when rendering every frame, Revit asks the engine to fetch the necessary points split into multiple batches.\nThe number of batches requested depends on the view: the smaller the projection of the cloud bounding box on the screen the fewer batches Revit requests. \nRevit assumes that each batch contains points uniformly distributed over the visible part of the cloud ('visible' as defined by the filter). \nThus, the points supplied by the engine should not be geometrically distinct, e.g. divided into multiple independent volumes, because otherwise, at distant zoom levels, Revit will only request a few batches and only part of the cloud will be displayed.\n\n<p>In other words, on every frame, Revit asks the engine to fetch some number of points in a few batches. \nEach batch is 256K points. \nThe number of batches requested depends on the frame: the smaller the projection of the cloud bounding box on the screen, e.g. when you zoom out or orbit, the fewer batches Revit requests. \nRevit assumes that each batch contains points uniformly distributed over the visible part of the cloud, where 'visible' is defined by the filter. \n\n<p>In the sample code, the plug-in does the complete opposite: it groups points in a few cubes, 256K each, and returns one cube per requested batch. \nSo if Revit requests 3*256K points, it gets three cubes, but if you zoom out and Revit requests only 2*256K points, it receives only 2 cubes. \nIn this example Revit expects to get 2*256K points uniformly distributed over the 3 cubes.\n\n<p>This assumption is currently not reflected adequately in the documentation.\nSorry!\nIt should say something like:\n\n<p>The main purpose of the engine is to quickly fetch points from one point cloud file satisfying certain conditions described in the client query. \nTypical request would be to get specified number of representative points within specified volume, e.g. a view frustum. \nBy representative we mean that it is responsibility of the engine to make sure that the points being returned give a good idea of the distribution of all points satisfying the query rather than, e.g. concentrating all in one area.\n\n<p>This simply shows how a contrived SDK engine sample may not provide the best example for real-world usage, not having a database of points which can be queried representatively.\n\n\n<a name=\"2\"></a>\n<h4>Programmatically Flip Work Plane</h4>\n<p>Saikat Bhattacharya provided a very clear and succinct explanation on flipping the the work plane for a family instance, and a code sample \n\n<a href=\"http://adndevblog.typepad.com/aec/2012/10/flipping-work-plane-programmatically-in-revit.html\">\nusing the IsWorkPlaneFlipped property</a> to \n\nachieve this programmatically.\n\n<center>\n<img alt=\"Flip work plane\" src=\"img/flip_work_plane_icon.png\"/>\n</center>\n</p></p></p></p></p></p></p></p></p></p></p>"
  },
  {
    "original_filename": "0841_point_cloud_batching",
    "header_text": "Programmatically Flip Work Plane",
    "local_header_href": "#programmatically-flip-work-plane",
    "chunk_text": "<h4>Programmatically Flip Work Plane</h4><p>Saikat Bhattacharya provided a very clear and succinct explanation on flipping the the work plane for a family instance, and a code sample \n\n<a href=\"http://adndevblog.typepad.com/aec/2012/10/flipping-work-plane-programmatically-in-revit.html\">\nusing the IsWorkPlaneFlipped property</a> to \n\nachieve this programmatically.\n\n<center>\n<img alt=\"Flip work plane\" src=\"img/flip_work_plane_icon.png\"/>\n</center>\n</p>"
  }
]