[
  {
    "original_filename": "0859_updater_transact",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0859_updater_transact",
    "header_text": "Updater Queues Multi-Transaction Operation for Idling",
    "local_header_href": "#updater-queues-multi-transaction-operation-for-idling",
    "chunk_text": "<h3>Updater Queues Multi-Transaction Operation for Idling</h3><p>I recently pointed out that certain operations require\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/11/temporary-transaction-trick-touchup.html\">\nmultiple transactions</a> to\n  \ncomplete.\n\n<p>The dynamic model updater framework\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/dmu\">DMU</a>,\n\non the other hand, takes complete control over the transaction handling, making it impossible to incorporate such a multi-transaction operation.\n\n<p>The updater framework is designed to enable an add-in to incorporate its own additional behaviour into a running transaction to react to changes in the model.\nThe advantage is that the entire operation including the custom add-in behaviour is encapsulated in one single transaction.\nThis comes at a price, as said: the add-in has no control whatsoever over the transaction management.\nIt thus also obviously cannot add additional transactions into the process.</p>\n<p>Let me present a powerful and generic workaround to this limitation, suggested by Rudolf Honke.</p>\n<p>He ran into this issue when trying to group elements in an updater, for instance for his\n\n<a href=\"http://www.youtube.com/watch?v=iXA264zZQ28\">\ndynamic insulation</a> and dynamic\n\n<a href=\"http://www.youtube.com/watch?v=rEj_lZ4uBcQ\">\narrangement of elements on a terrain surface</a> tools.\nThe dynamic insulation group behaves almost like a custom entity in AutoCAD:</p>\n<!-- <iframe width=\"420\" height=\"315\" src=\"http://www.youtube.com/embed/iXA264zZQ28\" frameborder=\"0\" allowfullscreen></iframe> -->\n<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"http://www.youtube.com/embed/SbpkYMzktI4\" width=\"420\"></iframe>\n<p>The element arrangement on terrain can be used to place trees, lampposts, and other objects to follow a curve and update automatically to changes in the curve:</p>\n<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"http://www.youtube.com/embed/rEj_lZ4uBcQ\" width=\"420\"></iframe>\n<p>The narration for these two videos is in German, by Mr Honke himself.\nThe dynamic insulation tool is also available in an English version, but that has not yet been uploaded.</p>\n<p>Both of these tools generate and handle groups of elements and react dynamically to later changes of the model.\n\n<p>The reaction makes use of the DMU; there is no other choice.\nHowever, the entire update operation requires ungrouping, modifying and regrouping of elements and cannot be achieved within the single transaction provided.</p>\n<p>Additional transactions in the IUpdater would be required to handle this gracefully.\n\n<p>In lack of this, here is Rudolf's workaround:\n\n<ol>\n<li>In the updater, save a list of elements requiring update.</li>\n<li>Subscribe to the Idling event.</li>\n<li>In the Idling event handler, call the standard add-in command that has no restrictions on its transaction handling.</li>\n<li>In the command, process the queued up elements and clear the list.</li>\n<li>Unsubscribe from Idling.</li>\n</ol>\n<p>In the actual implementation, the elements obviously maintain some data about their relationships, so the modification of an element can easily discover which other elements are affected.</p>\n<p>Here are a few more details and several reasons why this is necessary:</p>\n<ul>\n<li>The insulation tool needs to both delete and create new DetailCurves.\nIt also needs to create a new HermiteSpline which is not a DetailCurve at all.\nBy the way, accessing its ElementId during the insulation creation process requires a (temporary) DocumentChanged event, which is another topic that we will not explore any deeper here.\nTo avoid ForbiddenForDynamicUpdateExceptions, the creation is placed in a completely new transaction.\n<li>The dynamic fence and arranging-items-on-terrain tools require creation of new FamilyInstances, which should be avoided in the IUpdater context, as stated in the Revit API help file RevitAPI.chm.\n<li>The error handling needs to be able to use FailureHandlingOptions, which again means that the add-in has to have full access to the transaction itself.\n</li></li></li></ul>\n<p>The IUpdater context is fine for just setting parameters, but these tools need more than that, e.g. deleting elements, creating new ones, adding extensible storage data to handle the element connection logic, handling Failures, etc.\n\n<p>I recently ran into a different case where a developer was trying to make use of the InstanceVoidCutUtils class to insert a void on a modified wall within the updater Execute method.\nThis caused Revit to display an error message saying \"Third party updater Xyz has experienced a problem and its action had to be canceled.\"\nRemoving the one single line triggering the void generation from the updater enables to operation to complete, but the void is still missing, of course.\nThat seems to me like a prime use case for Rudolf's approach as well.\n\n</p></p></p></p></p></p></p>"
  }
]