[
  {
    "original_filename": "0991_animation",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<meta content=\"text/html; charset=utf-8\" http-equiv=\"Content-Type\"/>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0991_animation",
    "header_text": "Animation and the DisplacementElement Class",
    "local_header_href": "#animation-and-the-displacementelement-class",
    "chunk_text": "<h3>Animation and the DisplacementElement Class</h3><p>A recent developer query asks about animating elements in the Revit model and updating the display within a loop in the external command to show the step-by-step displacements.</p><p>This provides a welcome opportunity to highlight another one of the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2013/07/revit-2014-obj-exporter-and-new-sdk-samples.html\">\nRevit 2014 SDK Samples</a>:</p><a name=\"2\"></a>"
  },
  {
    "original_filename": "0991_animation",
    "header_text": "The DisplacementElementAnimation SDK Sample",
    "local_header_href": "#the-displacementelementanimation-sdk-sample",
    "chunk_text": "<h4>The DisplacementElementAnimation SDK Sample</h4><p>One of the very visually impressive Revit 2014 API samples is the DisplacementElementAnimation application.</p><p>It automatically animates groups of structural building members in any Revit BIM, proceeding sequentially from bottom level to top.</p><p>It creates and executes an animation of the model by disassembling and then reassembling it from the ground up.\nThe members are sorted into groups based on category and level and displaced from their actual position.\nEach group is then animated using the Idling event until the model is reassembled.</p><p>It is an external application, so it is not automatically made available by installing RvtSamples, which just provides access to the external command SDK samples.</p><p>It makes use of the new DisplacementElement to visually create a view-specific temporary displacement of the elements.\nThe DisplacementElement class is a view-specific element that causes other elements to appear to be displaced from their actual locations.</p><p>The DisplacementElement does not actually change the location of any model elements; it merely causes them to be displayed in a different location.</p><p>The add-in subscribes to the Idling event to implement the step-by-step changes to the displacement offsets required to animate the entire model.</p><p>The project files include:</p><ul>\n<li>Application.cs – implements the Revit add-in interface IExternalApplication to add the ribbon panel.</li>\n<li>DisplacementStructureModelAnimatorCommand.cs – the external command that initializes and starts the model animation.</li>\n<li>DisplacementStructureModelAnimator.cs – a class that executes an animation of structural model elements using DisplacementElements.</li>\n</ul><p>The displacement elements enable a visual animation to be presented without physically moving the elements, which would distort the model due to joins and geometric relationships between the elements.</p><p>An element may only be displaced by a single DisplacementElement in any view.\nAssigning an element to more than one DisplacementElement is an error condition.</p><p>A DisplacementElement can declare another DisplacementElement as its parent.\nIn that case, its transform will be concatenated with that of the parent, and the displacement of its associated elements will be relative to the parent DisplacementElement.</p><p>The elements are grouped using parent and child displacements, which enables the elements to inherit a displacement in Z while varying in X and Y.</p><p>This sample is geared towards a structural model.\nIt is independent of the actual model it is run in, but only foundations, structural columns, walls, floors, and structural framing will be displaced and animated.</p><p>To run it, install the external application and open the sample model provided or any other structural model.\nSelect the Add-ins &gt; Displacement &gt; Displacement animation command.\nThe animation will begin and run automatically.</p><p>For a video showing a sample run, please refer to the recording included with the Revit 2014\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2013/03/revit-2014-api-and-room-plan-view-boundary-polygon-loops.html#2\">\nDevDays online material</a>.</p><a name=\"3\"></a>"
  },
  {
    "original_filename": "0991_animation",
    "header_text": "Animating Movement of a Revit Family Instance or Other Element",
    "local_header_href": "#animating-movement-of-a-revit-family-instance-or-other-element",
    "chunk_text": "<h4>Animating Movement of a Revit Family Instance or Other Element</h4><p>With the overview of the DisplacementElementAnimation sample in hand, let's return to the developer query:</p><p><strong>Question:</strong> I would like to implement an animated movement of a family instance in the model.\n\nHere is my current code attempting this.\n\nI tried to execute it using both manual and automatic transactions, but Revit does not refresh the view per transform although I included a call to Document.Regenerate in the loop:\n\n<pre class=\"code\">\n[<span class=\"teal\">Transaction</span>( <span class=\"teal\">TransactionMode</span>.Automatic )]\n<span class=\"blue\">public</span> <span class=\"blue\">class</span> <span class=\"teal\">Command</span> : <span class=\"teal\">IExternalCommand</span>\n{\n  <span class=\"blue\">public</span> <span class=\"teal\">Result</span> Execute(\n    <span class=\"teal\">ExternalCommandData</span> commandData,\n    <span class=\"blue\">ref</span> <span class=\"blue\">string</span> message,\n    <span class=\"teal\">ElementSet</span> elements )\n  {\n    <span class=\"teal\">UIApplication</span> uiapp = commandData.Application;\n    <span class=\"teal\">UIDocument</span> uidoc = uiapp.ActiveUIDocument;\n    <span class=\"teal\">Application</span> app = uiapp.Application;\n    <span class=\"teal\">Document</span> doc = uidoc.Document;\n \n    <span class=\"teal\">Reference</span> r = uidoc.Selection.PickObject(\n      <span class=\"teal\">ObjectType</span>.Element, <span class=\"maroon\">\"Pick element\"</span> );\n \n    <span class=\"teal\">Element</span> e = doc.GetElement( r );\n \n    <span class=\"blue\">using</span>( <span class=\"teal\">Transaction</span> tx = <span class=\"blue\">new</span> <span class=\"teal\">Transaction</span>( doc ) )\n    {\n      <span class=\"blue\">for</span>( <span class=\"blue\">int</span> i = 0; i &lt; 50; i++ )\n      {\n        <span class=\"green\">//tx.Start(\"modify\");</span>\n        <span class=\"blue\">double</span> dt = 10;\n        <span class=\"teal\">XYZ</span> v = <span class=\"blue\">new</span> <span class=\"teal\">XYZ</span>( 0.0, dt, 0.0 );\n        <span class=\"teal\">ElementTransformUtils</span>.MoveElement(\n          e.Document, e.Id, v );\n        <span class=\"green\">//tx.Commit();</span>\n        System.Threading.<span class=\"teal\">Thread</span>.Sleep( 1000 );\n        doc.Regenerate();\n      }\n    }\n    <span class=\"blue\">return</span> <span class=\"teal\">Result</span>.Succeeded;\n  }\n}\n</pre>\n<p>Is it possible to achieve this kind of simulation and animation in Revit?</p>\n<p>Please let me know if I need to approach this differently or if you have other ideas.</p>\n<p><strong>Answer:</strong> While in an external command that has not yet been completed, it is not always enough to close a transaction, although closing a transaction is necessary for propagating all changes correctly throughout the mode.</p>\n<p>In order for changes to appear correctly in the current view, an additional call to the UIDocument.RefreshActiveView method may also be needed.\nPlease keep in mind that it should not be called during the Idling event.</p>\n<p>You can simply refer to the abovementioned DisplacementElementAnimation SDK sample to see how to implement a complete animation.</p>\n</p>"
  }
]