[
  {
    "original_filename": "0994_set_core_layer",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<meta content=\"text/html; charset=utf-8\" http-equiv=\"Content-Type\"/>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "0994_set_core_layer",
    "header_text": "Setting the Compound Structure Core and Shell Layers",
    "local_header_href": "#setting-the-compound-structure-core-and-shell-layers",
    "chunk_text": "<h3>Setting the Compound Structure Core and Shell Layers</h3><p>Modifying the compound layer structure of a wall or floor type is pretty well documented, and we already discussed the use of the SetCompoundStructure method to\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/03/updating-wall-compound-layer-structure.html\">update the compound layer structure</a>.</p><p>However, how to define which layers are and are not part of the core is less obvious, which lead to the developer query below.</p><p>Before I get to that, here is a snapshot of the north-east ridge and summit of the\n\n<a href=\"http://en.wikipedia.org/wiki/Spillgerte\">Hinderi Spillgerte</a>\n\n(<a href=\"http://de.wikipedia.org/wiki/Spillgerte\">German</a>) that\n\nI recently climbed:</p><center>\n<img alt=\"Hinderi Spillgerte NE ridge and summit\" src=\"file:////j/photo/jeremy/2013/2013-08-06_hintere_spillgerten/0661_ne_ridge_summit_cropped.jpg\" width=\"300\"/>\n</center><p>The climb is easier than it looks, grade II-III+, includes a number of abseil sections, both ascending the north-east ridge and descending the south one, and became a bit risky at the end due to getting caught in a thunderstorm\n\n(<a href=\"https://www.facebook.com/media/set/?set=a.10201093030740807.1073741828.1019863650&amp;type=3\">more photos</a>)...</p><p>Anyway, back safe and sound at our desks, let's return to setting the Revit core compound structure layers:</p><p><strong>Question:</strong> I found several methods in the CompoundStructure class to check the position of the core, e.g. GetCoreBoundaryLayerIndex, GetFirstCoreLayerIndex, GetLastCoreLayerIndex and IsCoreLayer, but no method to change it.</p><p>How can I achieve that, please?</p><p><strong>Answer:</strong> As mentioned above, you can change the compound layer structure a wall or floor type by creating a new collection of layers and setting them on the type using the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/03/updating-wall-compound-layer-structure.html\">\nSetCompoundStructure method</a>.\n\n<p>While this sets the layers, it does not define which of them are parts of the core.\nIn fact, the sample code uses the GetFirstCoreLayerIndex method to determine the first layer in the core, but presents no method to change it.</p>\n<p>Defining which CompoundStructure layers are part of the core is done using the CompoundStructure.SetNumberOfShellLayers method.</p>\n<p>For example, if you have 9 layers and want layers 0-3 in the exterior shell, 4-5 in the core, and 6-8 in the interior shell, you could use these two calls to achieve that:</p>\n<pre class=\"code\">\n  Cs.SetNumberOfShellLayers(\n    <span class=\"teal\">ShellLayerType</span>.Exterior, 4 );\n \n  Cs.SetNumberOfShellLayers(\n    <span class=\"teal\">ShellLayerType</span>.Interior, 3 );\n</pre>\n<p><strong>Response:</strong> Thank you very much, that is just what I was looking for.</p>\n<p>I modified my application and the two-line code example you provided works perfectly.</p>\n<p>I had in fact seen the SetNumberOfShellLayers method, but its use was not obvious to me, nor the fact that the so-called 'shell' defines and changes the contents of the core.</p>\n</p>"
  }
]