[
  {
    "original_filename": "1010_preview_control_macro",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<meta content=\"text/html; charset=utf-8\" http-equiv=\"Content-Type\"/>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n<script src=\"http://thebuildingcoder.typepad.com/google-code-prettify/run_prettify.js\"></script>\n</head>"
  },
  {
    "original_filename": "1010_preview_control_macro",
    "header_text": "Issue Using a Preview Control in a Macro",
    "local_header_href": "#issue-using-a-preview-control-in-a-macro",
    "chunk_text": "<h3>Issue Using a Preview Control in a Macro</h3><p>Here is a recent surprising little issue on using the Revit PreviewControl widget in the macro environment, brought up by Stephen Faust of\n\n<a href=\"http://www.revolutiondesign.biz\">Revolution Design</a>:\n\n<p><strong>Question:</strong> I would like to use the preview control to display previews of parts of the model.</p>\n<p>However, whenever I try to create a preview control it gives me the error \"Revit does not support more than one preview control and there is already one active\":</p>\n<center>\n<img alt=\"Revit error\" src=\"img/sf_revit_error.jpg\" width=\"600\"/>\n</center>\n<p>I have searched online and I found the UI sample in the SDK as well as\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/06/devcamp-day-two.html#2\">\nyour class</a> on\n\nthis.</p>\n<p>What I am trying to do to start off is just display the active view in a preview.\nLooking at\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/06/devcamp-day-two.html#23\">\nyour sample</a> it\n\nlooks like it just feeds the active document and active view ID to the form and constructs from there.</p>\n<p>I just have a WPF window and in the constructor it tries to create a preview control and add it to the children of the main grid with the following code:</p>\n<pre class=\"code\">\n  gd_Main.Children.Add(\n    <span class=\"blue\">new</span> <span class=\"teal\">PreviewControl</span>(\n      doc, doc.ActiveView.Id ) );\n</pre>\n<p>However this gives me the error above.\nI'm not sure where mine is different in substance than yours, or where else there might be a preview control active...</p>\n<p>What am I missing?</p>\n<p><strong>Answer:</strong> Congratulations on creating such a weird problem.</p>\n<p>I have never heard of anything similar, nor would I have thought it possible.</p>\n<p>You mention that you are aware of the UIAPI PreviewControl SDK and my simplified PreviewControlSimple samples.\nHere are pointers to those from the discussion of using a\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/08/vacation-time-and-various-notes.html#4\">\npreview control with linked document</a>:</p>\n<p>\"One if the new\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/03/revit-2013-and-its-api.html\">\nRevit 2013 API</a> features is the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/03/revit-2013-and-its-api.html#2\">\npreview control</a>,\n\nsupporting enhanced integration between Revit and an add-in.\nI presented a minimal sample named\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/06/devcamp-day-two.html#23\">\nPreviewControlSimple</a> making\n\nuse of it in my DevCamp session on the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/06/devcamp-day-two.html#2\">\nRevit 2013 UI API enhancements</a>,\n\nand a more complete and complex one is given by the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/03/new-revit-2013-sdk-samples.html#4\">\nUIAPI Revit SDK sample</a>.\"</p>\n<p>I would suggest ensuring that you can successfully compile, execute and debug both of these, to ensure that your system is not causing the problem.</p>\n<p>Are you sure you dispose properly of every preview control instance you created?</p>\n<p>You might be creating one, not disposing it, and then trying to create another...</p>\n<p>If the error persists in your add-in once that is done, I would suggest starting again from scratch, debugging regularly, and noting at what point the error occurs.</p>\n<p>There is not much more to say.</p>\n<p>After all, this is a one-liner, basically.</p>\n<p><strong>Response:</strong> I figured this out... ish.</p>\n<p>I discovered that it seems to be a problem with creating it in a macro instead of an external command.</p>\n<p>Some explanation:</p>\n<p>I often test concepts with macros to see how things work or if something is going to work or not especially if it’s a pretty simple concept and doesn’t take a lot of setup. That way I don’t have to keep waiting for Revit to load when I need to debug something, etc. Anyway that is what I was doing here and no matter what I did I got that error.</p>\n<p>I did compile the UIAPI command successfully and was able to run in properly so it’s not an issue with my machine or Revit install.</p>\n<p>I was tried to figure out what differences in substance there are between the UIAPI example and what I had.\nJust to test I created an external command in Visual Studio rather than in a macro.\nThe code is the same except that external commands have to return a result and apply attributes, etc., and the core is the same exact code.\nWhen I run it in the external command DLL it works just as expected with no error...</p>\n<p>So the culprit is the macro environment.</p>\n<p>Here is a snapshot of the code in the macro:</p>\n<pre class=\"code\">\n<span class=\"blue\">public</span> <span class=\"blue\">void</span> PreviewControl()\n{\n  <span class=\"blue\">using</span>( <span class=\"teal\">Transaction</span> t = <span class=\"blue\">new</span> <span class=\"teal\">Transaction</span>(\n    ActiveUIDocument.Document ) )\n  {\n    t.Start( <span class=\"maroon\">\"temp\"</span> );\n \n    <span class=\"teal\">Wnd_Preview</span> prv=<span class=\"blue\">new</span> <span class=\"teal\">Wnd_Preview</span>(ActiveUIDocument);\n \n    prv.ShowDialog();\n    t.RollBack();\n  }\n}\n \n<span class=\"blue\">public</span> <span class=\"blue\">partial</span> <span class=\"blue\">class</span> <span class=\"teal\">Wnd_Preview</span> : Window\n{\n  <span class=\"blue\">public</span> Wnd_Preview( <span class=\"teal\">UIDocument</span> Doc )\n  {\n    InitializeComponent();\n \n    gd_Main.Children.Add( <span class=\"blue\">new</span> <span class=\"teal\">PreviewControl</span>(\n      Doc.Document, Doc.Document.ActiveView.Id ) );\n  }\n}\n</pre>\n<p>One more minor issue: what I ultimately want to do is create a new view so that I can play with the settings and display without changing the model around. I also want to be able to create the view so that if there is not already a 3D view in the project I can create it – I will then roll the transaction back so the view doesn’t stay in the users file.</p>\n<p>I have a basic mock up of this working.\nWhen I use an actual view already present in the project I can successfully use the view cube in the preview control.\nHowever, when I create my own view, either by duplication or by View3D.CreateIsometric, it works fine, but the view cube is disabled.\nI checked and the view is not showing as locked.\nWhat could be causing this?</p>\n<p><strong>Answer:</strong> Hah!\nI thought the problem might possibly be caused by something strange in the environment.\nI am glad that the suggestion to start off by ensuring that the UIAPI sample works all right led in the right direction.</p>\n<p>Regarding the disabled view cube:</p>\n<p>You say that you are using the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/10/the-temporary-transaction-trick-for-gross-slab-data.html\">\ntemporary transaction trick</a>.</p>\n<p>Sometimes, though, you need to either regenerate the document, or, even more, commit the transaction, to ensure that the current state actual comes into effect.</p>\n<p>This led to Arnost's suggestion to\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2012/11/temporary-transaction-trick-touchup.html\">\nencapsulate the transaction in a transaction group</a>.</p>\n<p>That would enable you to commit your temporary transaction within a transaction group, ensuring that the changes take effect, and later discard the entire group, reverting the document back to its unchanged original state.</p>\n<p><strong>Response:</strong>\n<p>Thanks for the tip on transaction groups; I will give that a shot.</p>\n<p>Many thanks to Steve for sharing this!</p>\n</p></p>"
  }
]