[
  {
    "original_filename": "1039_acge_built_in",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<meta content=\"text/html; charset=utf-8\" http-equiv=\"Content-Type\"/>\n<link href=\"bc.css\" rel=\"stylesheet\" type=\"text/css\"/>\n</head>"
  },
  {
    "original_filename": "1039_acge_built_in",
    "header_text": "Using the Built-In Revit AcGe Functionality",
    "local_header_href": "#using-the-built-in-revit-acge-functionality",
    "chunk_text": "<h3>Using the Built-In Revit AcGe Functionality</h3><p>Anyone who ever used the AutoCAD API for geometrical purposes must be enamoured with AcGe.</p><p>On the other hand, the Revit geometry library is pretty meagre in comparison.</p><p>Wouldn't it be nice to be able to use all that powerful AcGe functionality in Revit as well?</p><p>Actually, if you take a look at the support DLLs included in the Revit main executable directory, AcGe is obviously present:</p><pre>\n  C:\\Program Files\\Autodesk\\Revit 2014 &gt; dir *acge*\n\n    Directory of C:\\Program Files\\Autodesk\\Revit 2014\n\n  02/05/2013  12:52 PM  1,679,688 acge19.dll\n  02/05/2013  12:52 PM    501,064 acgex19.dll\n\n    2 File(s)      2,180,752 bytes\n</pre><p>Wow.\nWouldn't it be nice to be able to access that?</p><p>Well, you can, actually.</p><p>Here is a small proof of concept created by Florian Schmid of\n\n<a href=\"http://www.sofistik.com\">SOFiSTiK AG</a> demonstrating showing the usage of AcGe geometry classes in Revit.</p><p>He originally provided it for Revit 2013.\nI did not get around to testing and verifying it until now, on Revit 2014, so here are the archive files for both of these versions:</p><ul>\n<li><a href=\"zip/acge_revit_2013.zip\">acge_revit_2013.zip</a></li>\n<li><a href=\"zip/acge_revit_2014.zip\">acge_revit_2014.zip</a></li>\n</ul><p>The latter contains the Visual Studio solution acge_revit.sln that includes three Visual Studio projects:</p><ul>\n<li>geometry_acge – a C++/CLI project that links with acge19.lib. The static Converter class provides methods to convert Revit geometry objects to AcGe objects and vice versa. The Helper class provides two higher level methods for curve projection.</li>\n<li>AcGeTest – a C# project implementing an external application that uses the Geometry.AcGe.Helper.orthoProjectIntoPlane method to project some Revit lines into a plane in its OnStartup method.</li>\n<li>AcGeTestCmd – a C# project implementing an external command providing the same functionality in its Execute mainline.</li>\n</ul><p>AcGeTest references the geometry_acge assembly, of course.</p><p>The AcGe headers and libs are those from the 2013 ObjectARX or ObjectARX 2014 installations, respectively.\nThere is no need to modify them in any way.</p><p>The acge19.dll is automatically demand loaded when geometry_acge.dll is loaded.\nBecause acge19.dll lives in the same location as revit.exe, it is found without problems, so no need to manually load it.</p><p>To get the example working, you have to adjust the 'Include Directory' and 'Additional Library Directories' of the geometry_acge project so that the ObjectARX headers and libraries can be found on your system.</p><p>Welcome back AcGe, how we’ve missed you!</p><p>Here are the steps I performed to install ObjectARX 2014 and migrate the sample to the new version:</p><ul>\n<li>Download and install\n\n<a href=\"http://usa.autodesk.com/adsk/servlet/item?siteID=123112&amp;id=785550\">ObjectARX</a>.\n\nFor all further information on that and self-help resources for AutoCAD software-based development efforts, please visit the\n\n<a href=\"http://www.autodesk.com/developautocad\">\nAutoCAD Developer Center</a>,\n\nwhich provides API overviews, getting started presentations, links to API discussion groups and more.</li>\n<li>Update the Revit API assembly references from 2013 to 2014.</li>\n<li>Migrate obsolete code, e.g. calls to NewLineBound, NewLineUnbound and get_EndPoint were replaced by Line.CreateBound, Line.CreateUnbound and GetEndPoint.\nYou might want to take a look at the definition of the Geometry class in the curve_converter.cpp module of the geometry_acge project to see examples of how these calls look in C++.</li>\n<li>Fix the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2013/07/recursively-disable-architecture-mismatch-warning.html\">\narchitecture mismatch warning</a>.</li>\n</ul><p>The result is an error and warning free compilation (copy and paste somewhere or view source to see truncated lines in full):</p><pre>\n------ Rebuild All started: Project: geometry_acge, Configuration: Debug x64 ------\n  Stdafx.cpp\n  AssemblyInfo.cpp\n  curve_converter.cpp\n  Generating Code...\n  .NETFramework,Version=v4.0.AssemblyAttributes.cpp\n  geometry_acge.vcxproj -&gt; C:\\a\\vs\\acge_revit\\x64\\Debug\\geometry_acge.dll\n------ Rebuild All started: Project: AcGeTest, Configuration: Debug Any CPU ------\n  AcGeTest -&gt; C:\\a\\vs\\x64\\AcGeTest.dll\n========== Rebuild All: 2 succeeded, 0 failed, 0 skipped ==========\n</pre><p>There was one more hiccup: the debug version had an erroneous C++ compilation setting, generating a Multi-threaded Debug DLL.\nI had to change that to generate a Multi-threaded DLL instead, to ensure that the correct runtime library is used.</p><p>Many thanks to Florian for pointing out and demonstrating the access to this powerful geometry functionality.</p><a name=\"2\"></a>"
  },
  {
    "original_filename": "1039_acge_built_in",
    "header_text": "Disclaimer",
    "local_header_href": "#disclaimer",
    "chunk_text": "<h4>Disclaimer</h4><p>Note that I am not sure of the legality of making use of this undocumented access.</p><p>If you plan to use this approach in a commercial product, I suggest checking with the appropriate Autodesk channels first.</p><p>I also took this opportunity of adding a\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/about-the-author.html#3\">\nlicense</a> and a\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/about-the-author.html#4\">\ndisclaimer</a> to\n\nthis blog itself, covering all its contents.</p><p>I recently discovered the\n\n<a href=\"http://thebuildingcoder.typepad.com/blog/2013/10/the-building-coder-samples-on-github.html#2\">\nimportance of a license</a> when starting to publish more diligently on GitHub.</p>"
  }
]