[
  {
    "original_filename": "1420_forge_devcon",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\">\n<link rel=\"stylesheet\" type=\"text/css\" href=\"bc.css\">\n<script src=\"run_prettify.js\" type=\"text/javascript\"></script>\n<!---\n<script src=\"https://google-code-prettify.googlecode.com/svn/loader/run_prettify.js\" type=\"text/javascript\"></script>\n-->\n</head>\n\n<!---\n\n- http://adndevblog.typepad.com/cloud_and_mobile/2016/04/early-bird-registration-for-forge-devcon.html\n\n- upcoming events:\n  Barcelona May 16-20 -- cloud accelerator http://autodeskcloudaccelerator.com\n  Athens June 1-2 -- meetup, BIM und forge workshop\n  San Fransico June 15-16 -- forge developer conference http://forge.autodesk.com/conference\n  San Fransico June 20-24 -- forge accelerator http://autodeskcloudaccelerator.com\n  Porto October 20-22 -- RTC Europe Revit Technology Conference http://www.revitconference.com/rtc2016eur/\n\n- David Manning <dlmanning@me.com> Re: Application for Autodesk Developer Network/Open source\n\n- my class mate passed away\n  a close friend. we travelled together for a couple of months after finishing high school together and before moving on to university and adult life\n  https://internwebben.ki.se/en/memory-professor-lorenz-poellinger\n\n- pictures of spring\n\nForge DevCon, Spring, Impermanence, BIM Cloud #revitAPI #3dwebcoder @AutodeskRevit #adsk #aec #bim @adskForge #3dwebaccel\n\nSpring is getting into swing, and new life is budding.\nI hope the same holds true for all your development efforts and visions of the future.\nNot everything is budding into new life, though... part of existence is passing away, as well.\nOne of my dearest school classmates and closest friends of my youth, Prof. Dr. Lorenz Poellinger, unexpectedly passed on.\nThe two of us travelled together for several of months, climbing and hitchhiking...\n\n-->"
  },
  {
    "original_filename": "1420_forge_devcon",
    "header_text": "Forge DevCon, Spring, Impermanence, BIM Cloud",
    "local_header_href": "#forge-devcon-spring-impermanence-bim-cloud",
    "chunk_text": "### Forge DevCon, Spring, Impermanence, BIM Cloud\n\nSpring is getting into swing, and new life is budding.\n\n<center>\n<img src=\"/p/2016/2016-04-07_spring_budding/923_tree_in_bloom_cropped.jpg\" alt=\"Tree in bloom\" width=\"300\">\n</center>\n\nI hope the same holds true for all your development efforts and visions of the future."
  },
  {
    "original_filename": "1420_forge_devcon",
    "header_text": "<a name=\"2\"></a>Impermanence",
    "local_header_href": "#a-name2aimpermanence",
    "chunk_text": "#### <a name=\"2\"></a>Impermanence\n\nNot everything is budding into new life, though... part of existence is passing away, as well.\n\n<center>\n<img src=\"/p/2016/2016-04-07_spring_budding/912_petals_cropped.jpg\" alt=\"Petals\" width=\"300\">\n</center>\n\nOne of my dearest school classmates and closest friends of my youth,\n[Prof. Dr. Lorenz Poellinger](https://internwebben.ki.se/en/memory-professor-lorenz-poellinger),\nunexpectedly passed on.\n\nLorenz was an active and successful scientist at [Karolinska Institutet](http://ki.se/en) in Stockholm\nand the [Cancer Science Institute CSI](https://www.csi.nus.edu.sg/ws/uncategorized/remembering-prof-lorenz-poellinger/remembering-professor-lorenz-poellinger) in Singapore.\n\nThe two of us travelled together for several of months, climbing and hitchhiking all over southern Europe, just after finishing high school and before moving on to university and adult life.\n\nHe was the one who initiated climbing in our hiking circle, and he died in the mountains as well.\n\n[Impermanence](https://en.wikipedia.org/wiki/Impermanence),\n[arising and passing away](http://www.changesurfer.com/Bud/Begin.html).\n\nHej då, Lolle."
  },
  {
    "original_filename": "1420_forge_devcon",
    "header_text": "<a name=\"3\"></a>Sommerlied",
    "local_header_href": "#a-name3asommerlied",
    "chunk_text": "#### <a name=\"3\"></a>Sommerlied\n\n<p style=\"padding-left: 10%\">wir sind menschen auf den wiesen\n<br/>bald sind wir menschen unter den wiesen\n<br/>und werden wiesen, und werden wald\n<br/>das wird ein heiterer landaufenthalt</p>\n\n<p style=\"text-align: right; padding-right: 10%\"><i>Ernst Jandl</i></p>"
  },
  {
    "original_filename": "1420_forge_devcon",
    "header_text": "<a name=\"4\"></a>Projects",
    "local_header_href": "#a-name4aprojects",
    "chunk_text": "#### <a name=\"4\"></a>Projects\n\nLooking forward, I have a whole bunch of exciting events and projects lined up for the next couple of months:\n\n- [Cloud accelerator](http://autodeskcloudaccelerator.com) in Barcelona May 16-20\n- Meetup, BIM und forge workshop in Athens June 1-2\n- [Forge DevCon developer conference](http://forge.autodesk.com/conference) in San Francisco June 15-16\n- [Forge accelerator](http://autodeskcloudaccelerator.com) in San Fransisco June 20-24\n- [RTC Europe Revit Technology Conference](http://www.revitconference.com/rtc2016eur) in Porto October 20-22 &ndash; somewhat further away in time...\n\nThe most exciting event by far is the [Forge DevCon developer conference](#5).\n\nLet's look at that in more detail, and add some motivation on the [cloud-based orientation](#6) of all this:"
  },
  {
    "original_filename": "1420_forge_devcon",
    "header_text": "<a name=\"5\"></a>Forge DevCon Developer Conference",
    "local_header_href": "#a-name5aforge-devcon-developer-conference",
    "chunk_text": "#### <a name=\"5\"></a>Forge DevCon Developer Conference\n\nThe first ever Autodesk Forge Developer Conference will take place in San Francisco on June 15-16.\nThe conference is for programmers and entrepreneurs interested in using 'cloud' technologies to disrupt the AEC and Manufacturing industries.\nClick the image below to go to the conference website.\n\n<center>\n<a href=\"http://forge.autodesk.com/conference\">\n<img src=\"img/forge_devcon.png\" alt=\"Forge DevCon\" width=\"600\">\n</a>\n</center>\n\nEarly bird registration is due to end on April 15th, so you don't have much time to buy your ticket at the low cost of $499.\n\nIf you're a student, you can come for free &ndash; just sign up for a student ticket using an `.edu` email address.\n\nWe are still working on the agenda.\nYou can explore the list of the classes we currently have planned\nat [forge.autodesk.com/tracks-and-speakers](http://forge.autodesk.com/tracks-and-speakers).\n\nI will definitely be attending both the conference, a meetup or two before and afterwards, and the accelerator in the following week.\n\nI am already busy planning and researching for my presentation on BIM, connecting the desktop and cloud."
  },
  {
    "original_filename": "1420_forge_devcon",
    "header_text": "<a name=\"6\"></a>BIM Cloud? Why?",
    "local_header_href": "#a-name6abim-cloud-why",
    "chunk_text": "#### <a name=\"6\"></a>BIM Cloud? Why?\n\n**Question:** I am interested is in developing a free library that would provide some manner of abstraction over the Revit API, with an intention of making it more accessible beyond the confines of C#. There are two possible avenues I’d like to explore:\n\n1. I believe it may be fairly simply to wrap some portion of the API using an open source framework called [EdgeJS](http://tjanczuk.github.io/edge), which would enable JavaScript calls from within Node.js, and thereby provide a bridge to an existing ecosystem of tools and utilities. Developers working against the Revit API are currently unable to leverage this wider world of technologies, and many reduplicate others' efforts attempting to bridge the gap.\n\n2. A somewhat more ambitious approach would involve making some subset of the API accessible over an http server communicating directly with Revit. Traditionally such an approach would use ASP.NET’s WebAPI framework to provide a RESTful interface. However, I would also like to explore integrating an emerging web technology called [GraphQL](http://graphql.org), which has recently been developed and released by Facebook, and which allows for client definable data queries against a server-defined data schema. Here I would begin with the .NET implementation of the [GraphQL standard](https://github.com/graphql-dotnet/graphql-dotnet).\n\nAs to why I would want to do this: a friend of mine is a BIM lead for a largish architecture firm and frequently talks to me about tools she wishes existed for Revit. I know many other BIM people are asking for similar functionality. I am a software developer, with no interest in buildings or architecture, but a lot of interest in data modelling.\n\nI would like to try to make some tools to help the BIM community. Should this effort lead to anything useful, I have no interest in making money from it, but would prefer to release it as open source for others to use in their own projects.\n\n\n**Answer:** I am sure that the direct Revit API access via http that you describe can be implemented.\n\nIn fact, here is an example of exactly that,\n[driving Revit through a WCF service](Http://thebuildingcoder.typepad.com/blog/2012/11/drive-revit-through-a-wcf-service.html),\nand it is not the only one.\n\nLook at The Building Coder topic group\non [modeless access and driving Revit from outside](http://thebuildingcoder.typepad.com/blog/about-the-author.html#5.28) for\nseveral other related ideas.\n\nIt would not be stable, however, so your framework would definitely have to monitor performance, keep track of tasks queued and executed, and deal with the fact that Revit might need to be killed and restarted occasionally.\nA product designed with an end user interface in mind is simply not built to act as a pure server.\n\nThat is why we just recently published a request for feedback on what developers would like to see and to implement in the kind of scenario you describe:\n\n- [What can Revit on the cloud do for you?](Http://thebuildingcoder.typepad.com/blog/2016/02/what-can-revit-on-the-cloud-do-for-you.html#2)\n- [Reading an RVT file without Revit](Http://thebuildingcoder.typepad.com/blog/2016/02/reading-an-rvt-file-without-revit.html)\n\nOn the other hand, I can see a number of different ways to approach the wish for powerful BIM analysis and reporting.\n\nThis fits in really well with some projects I have been working on in the past year or so to connect desktop and cloud:\n\n- [RoomEditorApp](https://github.com/jeremytammik/RoomEditorApp), a 2D cloud-based Revit room editor\n- [FireRating in the cloud](https://github.com/jeremytammik/FireRatingCloud)\n    - FireRatingCloud batch upload enhancement\n    - FireRatingClient ubiquitous BIM data access and editing\n- [CompHound](https://github.com/CompHound/CompHound.github.io), a cloud-based system to analyse, visualise and report on universal component and asset usage\n- [TrackChangesCloud](https://github.com/jeremytammik/TrackChangesCloud)\n\nI am sure they will be of interest to you as well.\n\nMaybe some parts of them will provide a good basis for implementing exactly what you think your wife would need  :-)\n\n\n**Response:** Yes, I work with web centric stuff. Most of what I’ve done for the last few years has centred around Node.js and JavaScript. This is probably the perspective that makes me interested in getting Revit content accessible in a more platform agnostic form.\n\nFor example, imagine that there were a JSON serializable format for Revit objects, such as would allow modification and reintroduction into an existing model (substitute protobufs or Cap’n Proto for JSON if you like). Aside from analytics, you could make a voxel representation of a project, or write a custom ReactJS renderer to display model views. A company could hook up a real-time dashboard of statistics about how many different wall types they’ve used today (exciting!). Of course, these things are possible from the .NET API, there’s just a much higher tooling buy in to Visual Studio, .NET, et al, and a higher barrier to integration with existing technologies where many people already have existing skills. This will tend to make 3rd party development a sort of dark art practiced only by a few cognoscenti, and its broader appeal more happenstance. The more accessible the data, the more weird, little, idiosyncratic things Autodesk’s customers can do for themselves, and the more valuable Autodesk’s products become.\n\nIndeed the links you send are very interesting and I’ll no doubt be referring to them for guidance if I’m able to proceed. RoomEditorApp in particular is very close to the kind of thing I was talking about. You’ve effectively defined a serialization of a subset of Revit objects in defining your [DbObj](https://github.com/jeremytammik/RoomEditorApp/blob/master/RoomEditorApp/DbModel.cs#L12).\n\nThanks for pointing this out to me! Of course you’re right that any abstraction layer would need to track API changes, and Revit isn’t intended to function as an http server. Offhand I'd say I’d probably treat it more like a database I wasn’t sure was going to be there, make my own server, and have an addin register itself as a resource with the server when it was around as well as provide the interface.\n\nAnyway, this would all be a lot of fun to try.\n\n**Answer:** I think trying to capture the entire complexity of a Revit BIM would be a crazy undertaking.\n\nDoing something limited and specialised like the room editor on the other hand is absolutely trivial and offers an infinite number of incredibly powerful possibilities with extremely little cost and effort.\n\nThat is exactly what I thought when I first had it up and running two or three years ago.\n\nI realised that with that technology alone in hand, I could go out and found a hundred different startups right away, and dozens of them would certainly be successful.\n\nIt is so simple!\n\nAll you need is ideas.\n\nI am absolutely convinced you can easily achieve something extremely useful using some flavour or other of the room editor.\n\nOh, and have you looked at the [open source BIM](https://duckduckgo.com/?q=open+source+bim) initiatives around?\n\nThere are oodles of them!"
  }
]