[
  {
    "original_filename": "1433_firerating_arch",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\">\n<link rel=\"stylesheet\" type=\"text/css\" href=\"bc.css\">\n<script src=\"run_prettify.js\" type=\"text/javascript\"></script>\n<!--\n<script src=\"https://google-code-prettify.googlecode.com/svn/loader/run_prettify.js\" type=\"text/javascript\"></script>\n-->\n</head>\n\n<!---\n\nFireRatingCloud Context and Architecture #revitAPI #3dwebcoder @AutodeskRevit #bim @AutodeskForge #3dwebaccel\n\nA picture says more than a thousand words.\nI find a compelling and clear picture takes a lot of work, though.\nI created the image below to explain the context and architecture of\nthe FireRatingCloud and other samples connecting BIM and the cloud\nlike RoomEditorApp, followed by some musings on using Revit as a server\n&ndash; FireRatingCloud context and architecture\n&ndash; You cannot use Revit as a server...\n\n-->"
  },
  {
    "original_filename": "1433_firerating_arch",
    "header_text": "FireRatingCloud Context and Architecture",
    "local_header_href": "#fireratingcloud-context-and-architecture",
    "chunk_text": "### FireRatingCloud Context and Architecture\n\nA picture says more than a thousand words.\n\nI find a compelling and clear picture takes a lot of work, though.\n\nI normally go for the words instead, as you may have noticed.\n\nUnfortunately, it probably takes just as much effort to reduce ten thousand meandering words to the one thousand succinct and clear ones that your really need.\n\n> Perfection is achieved, not when there is nothing more to add, but when there is nothing left to take away <p style=\"text-align: right\"><i>Antoine de Saint-Exupéry</i></p>\n\nSo maybe the net effort remains the same in the end.\n\nI made an exception last night and created the image below to explain the context and architecture of\nthe [FireRatingCloud](https://github.com/jeremytammik/FireRatingCloud) and other samples connecting BIM and the cloud\nlike [RoomEditorApp](https://github.com/jeremytammik/RoomEditorApp), followed by some musings on using Revit as a server:\n\n- [FireRatingCloud context and architecture](#2)\n- [You cannot use Revit as a server](#3)"
  },
  {
    "original_filename": "1433_firerating_arch",
    "header_text": "<a name=\"2\"></a>FireRatingCloud Context and Architecture",
    "local_header_href": "#a-name2afireratingcloud-context-and-architecture",
    "chunk_text": "#### <a name=\"2\"></a>FireRatingCloud Context and Architecture\n\nI took a first stab yesterday at explaining\nthe [context of the FireRatingCloud sample](http://thebuildingcoder.typepad.com/blog/2016/04/real-time-bim-update-via-fireratingcloud-windows-client.html#2).\n\nI later took that one step further, creating the image below and adding an in-depth explanation of\nthe [context and architecture](https://github.com/jeremytammik/FireRatingCloud#context-and-architecture) to\nthe [FireRatingCloud GitHub repository](https://github.com/jeremytammik/FireRatingCloud):\n\nFireRatingCloud is a C# .NET Revit add-in. It is a multi-project re-implementation of the FireRating SDK sample.\n\nIt uses a REST API to access a cloud-based database managed by the\n[fireratingdb](https://github.com/jeremytammik/firerating)\n[node.js](https://nodejs.org)\n[MongoDB](https://www.mongodb.org) web server.\n\nThe repo also includes two other projects:\n\n- [FireRatingClient](https://github.com/jeremytammik/FireRatingCloud/tree/master/FireRatingClient), a stand-alone Windows forms executable implementing a read-write\nfireratingdb client that you can use to remotely edit the BIM without entering or even installing Revit.\n- [FireRating](https://github.com/jeremytammik/FireRatingCloud/tree/master/FireRating), a shared library used by both FireRatingClient and FireRatingCloud.\n\nHere is an image showing the links and relationships between BIM, cloud, Revit, node.js and MongoDB and explaining how and where fireratingdb and the three FireRatingCloud components fit into the picture:\n\n<center>\n<img src=\"img/fireratingcloud_architecture.png\" alt=\"FireRatingCloud modules and architecture\" width=\"\">\n</center>\n\nI created this drawing using [draw.io](https://www.draw.io), and the\nsource [XML file](https://github.com/jeremytammik/FireRatingCloud/blob/master/img/fireratingcloud_architecture.xml) is provided.\n\nAll REST API calls on the desktop are handled by the shared .NET class library FireRating.dll and passed to the `firerating` database in MongoDB via the node.js web server. It contains one single collection `doors` containing door data JSON documents. Other clients can connect to that server as well, from any kind of device. Both the node web server and the mongodb database can actually be run either in the cloud or locally on your own system, even on the Windows system running Revit. These two choices are controlled by Boolean flags in the FireRating library and web server, respectively.\n\nOnly a few technical users will interact with full-fledged Revit and the BIM. A much larger number of all kinds of users can be provided access to relevant subsets of the BIM data using this technology. This and others samples demonstrate how that access can include real-time editing and BIM updating, if you so please. The FireRatingCloud sample is intentionally kept simple and limited to managing and providing access to one single shared parameter value. The [RoomEditorApp](https://github.com/jeremytammik/RoomEditorApp) shows how you can extract and interact with graphical data as well, including graphical interaction on any mobile device with a simplified 2D view rendered using SVG in the browser.\n\nI hope that all is clear now, and [everything is illuminated](https://en.wikipedia.org/wiki/Everything_Is_Illuminated) (one of my favourite films *and* books).\n\nThe topic of connecting BIM and the cloud leads to another frequently asked question, which also just came up again this very day in\nthe [Revit API discussion forum](http://forums.autodesk.com/t5/revit-api/bd-p/160):"
  },
  {
    "original_filename": "1433_firerating_arch",
    "header_text": "<a name=\"3\"></a>You Cannot Use Revit as a Server",
    "local_header_href": "#a-name3ayou-cannot-use-revit-as-a-server",
    "chunk_text": "#### <a name=\"3\"></a>You Cannot Use Revit as a Server\n\nInevitably, talking about connecting BIM and the cloud, the question on using Revit as a server pops up.\n\nWe provided several examples in the past that might help enable that kind of usage, e.g.:\n\n- [A pattern for semi-asynchronous Idling API access](http://thebuildingcoder.typepad.com/blog/2010/11/pattern-for-semi-asynchronous-idling-api-access.html)\n- [Driving Revit through a WCF service](http://thebuildingcoder.typepad.com/blog/2012/11/drive-revit-through-a-wcf-service.html)\n- [Processing a queue of commands to control Revit from a modeless dialogue](http://thebuildingcoder.typepad.com/blog/2013/06/behind-the-scenes-of-the-nbs-revit-add-in.html#3)\n- [Batch processing Revit documents](http://thebuildingcoder.typepad.com/blog/2015/08/batch-processing-dwfx-links-and-future-proofing.html#4)\n- [Revit Python shell in the cloud as a web server](http://thebuildingcoder.typepad.com/blog/2015/07/firerating-and-the-revit-python-shell-in-the-cloud-as-web-servers.html#5)\n\nPlease be aware, though, that the EULA or *end user license agreement* clearly prohibits the use of Revit as a server, and it cannot be used as part of a web site or service.\n\nIf you would be interested in any such-like future functionality,\n[Autodesk is interested in talking with you](http://thebuildingcoder.typepad.com/blog/2016/02/what-can-revit-on-the-cloud-do-for-you.html) about\nit to help make a decision on possibly exposing some sort of 'Revit I/O' web service.\n\nHere is a question raised today by Guillaume\non [updating family information with scripts without using Revit locally](http://forums.autodesk.com/t5/revit-api/updating-family-information-with-scripts-without-using-locally/m-p/6298561):\n\n**Question:** Is it possible to modify only the information part of a RFA without modifying the geometric part by using  server scripts?\n\nI know I can do it by using the API within Revit, but is there any other way?\n\nIs it possible to use some kind of Revit cloud license to update a RFA file with the new parameters?\n\nDo you have Revit licences for Linux servers?\n\n**Answer:** Thank you for your very relevant and pertinent questions.\n\nWe were just discussing a similar topic internally this very morning.\n\nLet's start at the end:\n\nQ: Do you have Revit licences for Linux servers?\n\nA: No.\n\nQ: Is it possible to use some kind of Revit cloud license to update a RFA file with the new parameters?\n\nA: No, there is currently no such license. Revit is not suited for use as a server. It is user interface oriented. Using it as a server violates the EULA. We are thinking about it, though. More on this below.\n\nQ: Is it possible to modify only the information part of a RFA without modifying the geometric part by using server scripts? I know I can do it by using the API within Revit, but is there any other way?\n\nA: I do not think so. You can read part atoms, but can you modify them? Please try it out and let us know what you find out. Here is a discussion on the topic\nof [reading an RVT file without Revit](http://thebuildingcoder.typepad.com/blog/2016/02/reading-an-rvt-file-without-revit.html).\n\nYou should definitely contact Jim Quanci and discuss your wishes and requirements with him, as he invited all developers to do in January this year,\nasking [what can Revit on the cloud do for you?](http://thebuildingcoder.typepad.com/blog/2016/02/what-can-revit-on-the-cloud-do-for-you.html#2)\n\nI put that discussion into context later,\nexploring [why BIM Cloud?](http://thebuildingcoder.typepad.com/blog/2016/04/forge-devcon-spring-impermanence-and-bim-cloud.html#6)\n\nRegardless of the context, all external access to the Revit API has to take into account the rules and restrictions\nthat apply to [Idling and external events for modeless access and driving Revit from outside](http://thebuildingcoder.typepad.com/blog/about-the-author.html#5.28).\n\nInstead of using Revit as a server, you can always explore generating a public format and interacting with that, or interacting with specific subset of the data, as demonstrated by my samples to connect BIM and the cloud, most recently these three based on Revit 2017:\n\n- [Room Editor &ndash; First Revit 2017 Addin Migration](http://thebuildingcoder.typepad.com/blog/2016/04/room-editor-first-revit-2017-addin-migration.html)\n- [Real-Time BIM Update with FireRatingCloud 2017](http://thebuildingcoder.typepad.com/blog/2016/04/real-time-bim-update-with-fireratingcloud-2017.html)\n- [Real-Time BIM Update via a Windows Forms Client](http://thebuildingcoder.typepad.com/blog/2016/04/real-time-bim-update-via-fireratingcloud-windows-client.html)\n\nThey show how you can easily extract a minimal set of relevant data from the BIM and make that globally available, including the possibility to edit it and reintegrate the changes back into the BIM in real-time.\n\nI hope this helps and look forward to hearing the outcome of your discussion."
  }
]