[
  {
    "original_filename": "1604_au_revit_api_panel",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\">\n<link rel=\"stylesheet\" type=\"text/css\" href=\"bc.css\">\n<!--\n<script src=\"run_prettify.js\" type=\"text/javascript\"></script>\n<script src=\"https://google-code-prettify.googlecode.com/svn/loader/run_prettify.js\" type=\"text/javascript\"></script>\n-->\n<script src=\"https://cdn.rawgit.com/google/code-prettify/master/loader/run_prettify.js\" type=\"text/javascript\"></script>\n</head>\n\n<!---\n\n#RevitAPI panel @ AU Las Vegas 2017 @AutodeskRevit #bim #dynamobim @AutodeskForge #ForgeDevCon http://bit.ly/apipanel\n\nNotes on the questions and answers at the Revit API panel at Autodesk University in Las Vegas November 2017\n&ndash; Description\n&ndash; Previous panels\n&ndash; Panel members\n&ndash; Learning objectives\n&ndash; Questions and answers\n&ndash; Recording and materials...\n\n--->"
  },
  {
    "original_filename": "1604_au_revit_api_panel",
    "header_text": "Revit API Panel @ AU Las Vegas 2017",
    "local_header_href": "#revit-api-panel-au-las-vegas-2017",
    "chunk_text": "### Revit API Panel @ AU Las Vegas 2017\n\nI skipped AU in Las Vegas this year, for the first time since 2005.\n\nThe Revit API panel took place as normal, thanks to the Revit API development and consultancy team panel members and my\ncolleague [Augusto](http://adndevblog.typepad.com/autocad/augusto-goncalves.html)\n[Gonçalves](https://www.linkedin.com/in/augustomaia),\nwho took the notes:\n\n- [Description](#2)\n- [Previous panels](#3)\n- [Panel members](#4)\n- [Learning objectives](#5)\n- [Questions and answers](#6)\n- [Recording and materials](#7)\n\n\n####<a name=\"2\"></a>Description\n\nThe Revit API Panel class at Autodesk University 2017 is listed in the AU class catalogue entry\nas [SD124063 &ndash; *Revit API Expert Roundtable: Open House on the Factory Floor*](https://autodeskuniversity.smarteventscloud.com/connect/sessionDetail.ww?SESSION_ID=124625):\n\nInteract with a panel of Revit API experts to answer your questions and discuss all relevant topics of your choice. For anyone writing add-ins for Revit software, this is the perfect forum to better get to know the people who shape the APIs you work with and explain your views, ideas, and problems face to face. Please note that prior .NET programming and Revit add-in development experience is required. This class is not suitable for beginners.\n\n####<a name=\"3\"></a>Previous Panels\n\nHere are some notes from previous similar Revit API panel sessions:\n\n- [SD5156 &ndash; The Revit API Expert Panel at Autodesk University 2014](http://thebuildingcoder.typepad.com/blog/2014/12/the-revit-api-panel-at-autodesk-university.html#1)\n- [Revit Technology Conference RTC Europe 2015](http://thebuildingcoder.typepad.com/blog/2015/11/rtc-budapest-and-the-revit-api-panel.html#5)\n- [SD10181 &ndash; Revit API Expert Roundtable at Autodesk University 2015](http://thebuildingcoder.typepad.com/blog/2015/12/au-keynote-and-revit-api-panel.html#9)\n- [RTC Revit Technology Conference Europe 2016](http://thebuildingcoder.typepad.com/blog/2016/10/rtc-revit-api-panel-idea-station-edit-and-continue.html)\n- [SD20891 &ndash; Autodesk University 2016](http://thebuildingcoder.typepad.com/blog/2016/11/au-day-two-ifc-and-revit-api-panel.html#4)\n\n \n####<a name=\"4\"></a>Panel Members\n\n- Boris Shafiro, Software Development Manager, Autodesk\n- Diane Christoforo, Revit Development, Autodesk\n- Keith White, Technical Consultant, Autodesk,\n- Miroslav Schonauer, Senior Solutions Architect, Autodesk\n- Rahul Bhobe, Principal Engineer, Autodesk\n- Sasha Crotty, Revit Core Product Manager, Autodesk\n\n<center>\n<img src=\"img/1604_au_revit_api_panel.jpg\" alt=\"Revit API panel members\" width=\"500\"/>\n</center>\n\n\n####<a name=\"5\"></a>Learning Objectives\n\n- Get answers to Revit programming questions that are bugging you\n- Meet and make yourself heard to the Revit development team and developer support experts\n- Discuss your needs, wishes, and solutions with Autodesk employees and your peers\n- Gain a first-hand impression of the current hot Revit API issues\n\n\n####<a name=\"6\"></a>Questions and Answers\n\nQ: Start a project to import and having performance, looking how to reduce the cylinder mashes to reduce the complexity.\n\nA: The first thing to remember when importing geometry is about scale. Revit works best in a specific range of scale, miles and fraction of centimeters are the edges of this range. On architectural scales, it should work best. Direct shapes is something new that still needs performance improvements. When importing Direct Shapes the Revit team needs to understand more about the mashes being used. Miroslav (on Consulting) is using Direct Shapes to visualize, but can’t attach parameters, therefore using it to import entire models are not best use of the API. In terms of performance, when having many elements with the same geometry, use types and instances to reuse graphical representation. Maybe IFC can help track what’s similar and avoid duplicated instances.\n\nQ: Would grouping objects affect performance?\n\nA: Should not.\n\nQ: Code signing when dealing with single site, it doesn’t recognize the signer when moving versions. When having many different items, in case of a site license for Revit the developer doesn’t have to buy different signing.\n\nA: If on the standard Microsoft storage, it should work better.\n\nQ: If developing for local or for yourself.\n\nA: In this case it goes on the local machine registry so it recognizes. If not, there is a fix from Jeremy to fix it. For every new build, there is a new version of the DLL, therefore needs a new signature. If after a time the license is lost, then it’s a Windows issue.\n\nThere is a group policy on Windows that prevents that on Windows networks. And you can create a signature provider for local networks.\n\nQ: Is there a way to programmatically place keynotes.\n\nA: No, by Miroslav. Now it’s noticed and Dev Team will check. And remember to place your suggestions on [Revit Ideas at www.autodesk.com/revitideas](http://www.autodesk.com/revitideas), which is being actively monitored, specially for APIs. One of the requirements for the teams is to include APIs on any new product feature.\n\nQ: Room tag editing, select the views, update properties, sheets, etc., which works well when rooms are on the current model, but when rooms are on the linked model there is no way to find to which room that tag is connected to.\n\nA: That’s something that Dev Team needs to work on, the `LinkElementId` should go on that direction, but still need some work.\n\nQ: There is no way to determine if a link model exists on a view, like a room on a linked model. The workaround is to check the tag on the room and check that.\n\nA: Same as above.\n\nQ: On ray tracer, is there any precaution to make sure if it will find the nearest surface and filter by category.\n\nA: Toposurface, if it is a mesh (not a Revit surface) it will not work at its best, make sure to use Revit Surface. It may be possible to use an element filter and pass as during the ray tracer, it should be one of the arguments.\n\nQ: Having problems importing shared parameters to system families. The set function is causing problems.\n\nA: It should be added as project parameters that will be imported. If the category is visible, the binding should work. It should require finishing the binding transaction before setting any parameter (e.g. finish the binding transaction, start another transaction). Before the transaction is committed, the parameter is not actually there. Between open and close transaction, the state is not consistent, the commit will then regenerate. Sometimes it is even required to create multiple transactions.\n\nQ: How to edit family parameter programmatically without opening on the screen the reload family and to dismiss the “reload family dialog”\n\nA: As the family is a document, you can open and access the manager from there. After saves, it needs to reload, so inherit from interface `LoadFamilyOptions` and handle how the family is reloaded. After changing the family, you need to reload the family. Edit the family is necessary as the family is a separated file.\n\nQ: Display contour lines on AVF lines.\n\nA: Revit 2018 has improvements, use Direct Contacts API which allow drawing anything without passing through Revit.\n\nQ: And what about printing?\n\nA: Direct Contact is different from AVF, about printing text/number, the direct contact is a graph only. If you do use AVF with colored surface with gradient color or solid color.\n\nQ: Still not possible to assign material to family, what about improvements?\n\nA: Revit 2018 have some improvements to modify visual materials. To assign material to a family instance is to open the family for editing and assign there. For walls, you need to assign material to layers. There is no unified way as Revit different types of elements. For custom material as a parameter, you should be able to look at the parameter. But this is an area that needs investigation.\n\nQ: Replicate the project browser level and modify nested families to find them. As of now we need to go to every family.\n\nA: Nested families do not exist on the project level.\n\nQ: Spec wires and spec sheets that are sparse over several drawings.\n\nA: There are some partner working on this, but Revit does not support it. A note: Revit is not the best place to store all of that information.\n\nQ: Create legend on Revit using an empty that is modified to specific needs. `FindReference` on family symbol does not work for legends. Find by the UI is possible, but not on the API. Same for rotating these legends.\n\nA: Nothing concrete on the roadmap around legends as of today. Note that these are not part of the native geometry with reference, so needs extra work. Please vote at the Revit Ideas.\n\nQ: Have a requirement to accept design options on the project.\n\nA: Not exposed on the API, but just accept design option is easier, but needs to be on Revit Ideas.\n\nQ: Document opening event is missing the options to audit the model\n\nA: Not available, post on Revit Ideas.\n\nQ: Update the host based family loose the host when reattach.\n\nA: Host parameter is read-only, probably the API is missing a re-host method, another topic for Revit Ideas.\n\nQ: About piping via API, automate slopping piping, how this is done internally? The z coordinate is read-only via API.\n\nA: Sorry, MEP developers are not present.\n\nAudience: Workaround: do some math, calculate the points, create a line, then turn a line into a curve, then into a pipe.\n\nQ: How to specify the flow on a pipe and make sure Revit uses that property, specially on complex systems.\n\nA: Connectors are supposed to specify direction. Need to take this offline.\n\nQ: Load as group not available on the API, so mimic, but the insertion point cannot be moved\n\nA: Needs some extra work, not available.\n\nQ: How to control how an object is mirrored.\n\nA: Check (via API) if for the mirror property and use a shared parameter to monitor it.\n\nQ: When moving groups the extensible storage is lost.\n\nA: Change the level of a group loses the extensible storage as it changes the instance ID, but any problems on this should be reported.\n\nQ: Rotation information is not kept.\n\nA: Check the transform matrix of the group instance, if still null, then needs to be logged.\n\nQ: Shared parameter file not able to rename, so needs compute power to iterate though the list\n\nA: The longer term how to use parameter via cloud services instead shared parameter, which needs some extra work.\n\n\n####<a name=\"7\"></a>Recording and Materials\n\n- [Handout PDF](zip/sd124063-handout.pdf)\n- [Slide desk PDF](zip/sd124063-presentation.pdf)\n- [Recording M4A](zip/sd124063-recording.m4a)\n\nMany thanks to Augusto for facilitating and all the panel members for allowing us to pick their valuable brains!"
  }
]