[
  {
    "original_filename": "1628_get_new_element_ids",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\">\n<link rel=\"stylesheet\" type=\"text/css\" href=\"bc.css\">\n<!--\n<script src=\"run_prettify.js\" type=\"text/javascript\"></script>\n<script src=\"https://google-code-prettify.googlecode.com/svn/loader/run_prettify.js\" type=\"text/javascript\"></script>\n-->\n<script src=\"https://cdn.rawgit.com/google/code-prettify/master/loader/run_prettify.js\" type=\"text/javascript\"></script>\n</head>\n\n<!---\n\n- retrieving newly created elements:\n  https://stackoverflow.com/questions/48869272/python-revit-part-utils-how-to-get-append-the-results-out\n  https://forums.autodesk.com/t5/revit-api-forum/how-to-get-a-merged-part-after-merging-with-some-parts/td-p/7772648\nI believe I just answered a very similar question in the Revit API discussion forum thread on [how to get a merged part after merging with some parts](https://forums.autodesk.com/t5/revit-api-forum/how-to-get-a-merged-part-after-merging-with-some-parts/td-p/7772648):\nYou can subscribe to [the DocumentChanged event](http://www.revitapidocs.com/2018.1/988dd6cf-fcaa-85d2-622d-c50f13917a13.htm) just before calling CreateParts, and unsubscribe just afterwards.\nThat will tell you all the element ids added to the database during the call.\nThis is demonstrated in the discussion on [retrieving newly placed family instances](http://thebuildingcoder.typepad.com/blog/2010/06/place-family-instance.html).\n\nRetrieving newly created element ids in #RevitAPI @AutodeskRevit #bim #dynamobim @AutodeskForge #ForgeDevCon http://bit.ly/new_element_ids\n\nAn add-in will often need to retrieve the elements that it just created for further processing.\nFrequently, the Revit API method used to create them will return their element ids.\nSometimes, that is not the case.\nNow this topic arose again in a couple of cases and brought some other aspects to mind\n&ndash; Using the element lister\n&ndash; Consecutive element ids\n&ndash; Retrieving recently added elements\n&ndash; AEC job openings in Munich and elsewhere...\n\n--->"
  },
  {
    "original_filename": "1628_get_new_element_ids",
    "header_text": "Retrieving Newly Created Element Ids",
    "local_header_href": "#retrieving-newly-created-element-ids",
    "chunk_text": "### Retrieving Newly Created Element Ids\n\nAn add-in will often need to retrieve the elements that it just created for further processing.\n\nFrequently, the Revit API method used to create them will return their element ids.\n\nSometimes, that is not the case.\n\nWe already discussed a simple and effective method to retrieve all newly created elements following a call to\nthe [`PromptForFamilyInstancePlacement` method](http://www.revitapidocs.com/2018.1/b05a17df-3f63-9172-8e49-d2e1e6b8e9e2.htm) by\nsubscribing to the [`DocumentChanged` event](http://www.revitapidocs.com/2018.1/988dd6cf-fcaa-85d2-622d-c50f13917a13.htm) just\nbeforehand in the discussion\non [placing family instances](http://thebuildingcoder.typepad.com/blog/2010/06/place-family-instance.html).\n\nNow this topic arose again in a couple of cases and brought some other aspects to mind:\n\n- [Using the element lister](#2)\n- [Consecutive element ids](#3)\n- [Retrieving recently added elements](#4)\n- [AEC job openings in Munich and elsewhere](#5)\n\n\n####<a name=\"2\"></a>Using the Element Lister\n\nThe [element lister](http://thebuildingcoder.typepad.com/blog/2014/09/debugging-and-maintaining-the-image-relationship.html#2) provides\nan easy way to discover element relationships between related objects that are added to Revit by certain operations.\n\nIt is included\nin [AdnRevitApiLabsXtra, the ADN Revit API Training Labs including Xtra](https://github.com/jeremytammik/AdnRevitApiLabsXtra).\n\nAll it does is grab all elements in the entire database and list whatever properties you are interested in, e.g., element id, category, level, .NET class, etc.\n\nThen you can use\na [Unix `diff` tool](https://en.wikipedia.org/wiki/Diff_utility) to\ncompare states before and after doing your thing.\n\nIt can be well combined with\nthe [built-in parameter checker BipChecker](https://github.com/jeremytammik/BipChecker) to explore the properties in further depth.\n\nOf course,\nthe [most intimate database exploration](http://thebuildingcoder.typepad.com/blog/2013/11/intimate-revit-database-exploration-with-the-python-shell.html) requires\na live read-evaluate-print console.\n\n####<a name=\"3\"></a>Consecutive Element Ids\n\nUsing any of the techniques listed above, you will quickly determine that Revit element ids are basically consecutive numbers.\n\nThere is no guarantee for this, of course, and they can be mixed up by work-sharing operations.\n\nThey can only be used to identify an element within one single Revit document.\n\nBecause they are assigned consecutively, Revit automatically generates\nmany [undocumented `ElementId` relationships](http://thebuildingcoder.typepad.com/blog/2011/11/undocumented-elementid-relationships.html).\n\nFor more persistent identification, a `UniqueId` is recommended.\n\nFor the sake of completeness, Revit elements have two identifiers:\n\n- [Element id `ElementId`](http://www.revitapidocs.com/2018.1/44f3f7b1-3229-3404-93c9-dc5e70337dd6.htm)\n- [Unique id `UniqueId`](http://www.revitapidocs.com/2018.1/f9a9cb77-6913-6d41-ecf5-4398a24e8ff8.htm)\n\nWe discuss their uses in lots of places, e.g.,\n[understanding the use of the `UniqueId`](http://thebuildingcoder.typepad.com/blog/2015/02/understanding-the-use-of-the-uniqueid.html).\n\nFor connecting with an external database, I would suggest using the UniqueId.\n\nOne simple sample that shows the whole connection strategy is provided by\nthe [FireRatingCloud add-in](https://github.com/jeremytammik/FireRatingCloud).\n\n\n####<a name=\"4\"></a>Retrieving Recently Added Elements\n\nSo let us summarise the above again to answer\nthe [Revit API discussion forum](http://forums.autodesk.com/t5/revit-api-forum/bd-p/160) thread\non [how to get a merged part after merging with some parts](https://forums.autodesk.com/t5/revit-api-forum/how-to-get-a-merged-part-after-merging-with-some-parts/td-p/7772648) and\nthe StackOverflow question\non [Python Revit `Part.Utils` how to get append the results out](https://stackoverflow.com/questions/48869272/python-revit-part-utils-how-to-get-append-the-results-out):\n\n**Question 1:** I have merged some parts using `PartUtils.CreateMergedPart`.\n\nThe output is not a `Part`, but a `PartMaker`.\n\nI need a part output.\n\nIs there any way to get a merged part object?\n\n**Question 2:** I am using `PartUtils.CreateParts` to create parts and would like to collect the results as a list of element ids.\n\nHow can I achieve that, please?\n\n**Answer:** As said above, you can subscribe to\nthe [`DocumentChanged` event](http://www.revitapidocs.com/2018.1/988dd6cf-fcaa-85d2-622d-c50f13917a13.htm) just before calling `CreateParts`, and unsubscribe just afterwards.\n\nThat will tell you all the element ids added to the database during the call.\n\nThis is demonstrated in the discussion on [retrieving newly placed family instances](http://thebuildingcoder.typepad.com/blog/2010/06/place-family-instance.html).\n\n<center>\n<img src=\"img/road_narrows.png\" alt=\"Merge parts\" width=\"211\"/>\n</center>\n\n####<a name=\"5\"></a>AEC Job Openings in Munich and Elsewhere\n\nI see Autodesk offering several AEC related job openings.\n\nBelow are two located in Munich, Germany, for offsite and home office.\n\nFor more, please check\nthe [Autodesk job search site](https://autodesk.taleo.net/careersection/adsk_gen/jobsearch.ftl)."
  },
  {
    "original_filename": "1628_get_new_element_ids",
    "header_text": "[Industry Program Manager, AEC](https://autodesk.taleo.net/careersection/adsk_gen/jobdetail.ftl?job=18WD26910&tz=GMT%2B00%3A00)",
    "local_header_href": "#6",
    "chunk_text": "#####<a name=\"6\"></a> [Industry Program Manager, AEC](https://autodesk.taleo.net/careersection/adsk_gen/jobdetail.ftl?job=18WD26910&tz=GMT%2B00%3A00)\n\nRequisition ID: 18WD26910\n\nAre you interested in a marketing job at Autodesk and wondering if this is the right one? Start by answering these five questions:\n\n- Are you one of those unique people who can see the big picture and look after the smallest of details all at the same time?\n- Do you like complex and sometimes ambiguous problems, and digging for data and insights that might help solve those problems?\n- Do you work with a sense of purpose and urgency, motivating others to join your mission?\n- Do you like working on a wide variety of projects, and find doing the same work day after day boring?\n- Are you continually challenging yourself to do more, do it better, and do it faster?\n\nIf you said yes to all these questions, you may be the perfect fit for the role of Industry Program Manager for AEC (Architecture, Engineering, and Construction).\n\nPosition Overview\n\nThis is a unique individual contributor position at Autodesk. Your job is to make the EMEA cross-functional marketing teams (Account-based Marketing, Lead Gen Marketing, Digital Direct, Channel Marketing) successful by being the interface between them and the global industry strategy teams. You will coordinate industry strategy, programs and assets across the different sales channels (ABM, Digital Direct, Territory).\n\nYou will work with smart, global industry teams that are responsible for building and managing marketing programs and campaigns for our AEC industries. It will be your mission to:\n\n- Communicate and coordinate the execution of campaigns across the country teams\n- Gather input from the field\n- Represent EMEA Demand Gen teams back to the industry strategy teams\n\nIt requires a unique combination of marketing experience, business acumen, industry know-how, project management, communication, and leadership skills. And at the heart of it, you have love to get things done.\n\nResponsibilities\n\n- Communicate global programs and campaigns to align marketing initiatives in EMEA and execute to the AEC strategic vision\n- Ensure the availability of assets for Account-based Marketing, Lead Gen Marketing, Digital Direct teams and support Channel Marketing in communicating strategic goals to partners\n- Lead the annual planning process for EMEA with the key Sales, Marketing and Industry stakeholders\n- Develop and deliver professional written and spoken communications that ensure team members and leadership have clear, concise, and up-to-date information on progress\n- Monitor performance of campaigns and recommend changes to continuously improve them\n- Ensure clear definition of program success and present results against targets on a regular basis to Sales and Marketing leaders in EMEA\n- Identify and communicate program scope and ensure critical paths, milestones and all objectives are met\n- Work with teams and individuals to mitigate conflicts and resolve issues as needed. Leverage cross-organizational relationships for support and escalate in a savvy manner\n- Collaborate with industry business development groups\n\nMinimum Qualifications\n\n- Excellent communication & collaboration skills and organizational talent to manage projects from start to end successfully\n- Business acumen and industry knowledge to drive thought-leadership for the Architecture, Engineering, and Construction\n- Change champion, motivator, and coach; demonstrated success delivering meaningful results through teams\n- Strong analytical and problem-solving skills\n- Excellent relationship management and expectation setting skills\n- Familiarity with selling concepts and best practices; experience working with sales teams\n- Strong ability to manage and prioritize multiple, concurrent tasks while meeting aggressive deadlines in a fast-paced environment with unending optimism\n- Proficient with MS Office tools and familiar with Marketo and/or SFDC\n- Comfortable with remote video collaboration tools e.g., Skype, Zoom, Go-to-Meeting, etc.\n- BA/BS degree in marketing or communications\n- 5+ years professional marketing experience in the high-tech industry (software industry experience preferred)"
  },
  {
    "original_filename": "1628_get_new_element_ids",
    "header_text": "[BIM Implementation Consultant](https://autodesk.taleo.net/careersection/adsk_gen/jobdetail.ftl?job=17WD25466&tz=GMT%2B00%3A00)",
    "local_header_href": "#7",
    "chunk_text": "#####<a name=\"7\"></a> [BIM Implementation Consultant](https://autodesk.taleo.net/careersection/adsk_gen/jobdetail.ftl?job=17WD25466&tz=GMT%2B00%3A00)\n\nRequisition ID: 17WD25466\n\nPosition Overview\n\nAs a BIM Technical Consultant, you will be essential for working directly with our customers and developing/contributing to their BIM implementation strategy (in collaboration with our sales, consulting delivery and business development teams) for our major account customers.\n\nThe position combines your pre-sales and post-sales consultancy skills, your construction industry experience, your technical and professional know-how, and your passion for educating customers on Autodesk’s Construction BIM solutions.\n\nResponsibilities\n\n- Carry out the implementation of Autodesk's BIM solution on projects, collaborating with Autodesk sales and consulting delivery and business development teams\n- Analyse customer business workflows and document findings\n- Define, construct, and carry out the adoption of BIM implementation plans, leveraging your industry experience and best practices\n- Manage customer relationships on implementation projects\n- Document, share and promote BIM team best practices for redistribution and consistent implementation at a corporate level\n- Own a part of the BIM Solution Portfolio corresponding to your area of expertise\n- Identify opportunities for new projects to enhance customer effectiveness in their own business\n\nMinimum Qualifications\n\n- Strong experience in the Construction Industry\n- Broad understanding, garnered through work in practice, of the Construction  industries throughout the asset lifecycle\n- Broad understanding of our Autodesk technology around BIM 360 Field, Glue, Production planning, Point Layout, Naviswork\n- Understand the Construction Business Process around Production Planning, Scheduling, Commissioning, hand over to owners\n- Understand BIM principles and at least 2 years of hands-on experience implementing BIM in an enterprise and/or on projects\n- Experience in software product adoption Experience in business process improvement principles, and implementing change in complex organizations\n- Fluent oral and written in English and German. Candidates with additional language skills would have a clear advantage\n- Excellent verbal and written communication skills; ability to communicate complex technical details coherently\n- Able to travel and enjoy working with diverse groups of people with widely variable technical skills\n\nPreferred Qualifications\n\n- Mature, goal-oriented, takes initiative and responsible\n- Does not mind working on multiple projects at a time\n- Able to act independently while working on a multi-disciplinary and geographically diverse team\n- Can effectively communicate with this team, even with remote and international team members"
  }
]