[
  {
    "original_filename": "1973_estorage_rm",
    "header_text": "Introduction",
    "local_header_href": "#introduction",
    "chunk_text": "<head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\">\n<link rel=\"stylesheet\" type=\"text/css\" href=\"bc.css\">\n<script src=\"https://cdn.rawgit.com/google/code-prettify/master/loader/run_prettify.js\" type=\"text/javascript\"></script>\n</head>\n\n<!---\n\n- Not able to delete Extensible Storage schema\n  https://forums.autodesk.com/t5/revit-api-forum/not-able-to-delete-extensible-storage-schema/m-p/11541801\n  REVIT-196204 [IFC link prevents extensible storage delete]\n\ntwitter:\n\nA new team member, new Revit API and WPF tutorials, and new insights on handling extensible storage deletion and conflicts with the #RevitAPI @AutodeskForge @AutodeskRevit #bim #DynamoBim #ForgeDevCon https://autode.sk/estoragedeletion\n\nA new team member, new Revit API and WPF tutorials, and new insights on handling extensible storage\n&ndash; Welcome, George!\n&ndash; WPF form UIApplication access\n&ndash; Mazri's Revit, Dynamo, web and WPF playlists\n&ndash; Extensible storage schema deletion\n&ndash; Extensible storage schema conflict...\n\nlinkedin:\n\nA new team member, new Revit API and WPF tutorials, and new insights on handling extensible storage deletion and conflicts with the #RevitAPI\n\nhttps://autode.sk/estoragedeletion\n\n- Welcome, George!\n- WPF form UIApplication access\n- Mazri's Revit, Dynamo, web and WPF playlists\n- Extensible storage schema deletion\n- Extensible storage schema conflict...\n\n#bim #DynamoBim #ForgeDevCon #Revit #API #IFC #SDK #AI #VisualStudio #Autodesk #AEC #adsk\n\nthe [Revit API discussion forum](http://forums.autodesk.com/t5/revit-api-forum/bd-p/160) thread\n\n<center>\n<img src=\"img/\" alt=\"\" title=\"\" width=\"600\" height=\"\"/>\n<p style=\"font-size: 80%; font-style:italic\"></p>\n</center>\n\n<pre class=\"code\">\n</pre>\n\n-->"
  },
  {
    "original_filename": "1973_estorage_rm",
    "header_text": "Extensible Storage Schema Deletion",
    "local_header_href": "#extensible-storage-schema-deletion",
    "chunk_text": "### Extensible Storage Schema Deletion\n\nA new team member, new Revit API and WPF tutorials, and new insights on handling extensible storage:\n\n- [Welcome, George!](#2)\n- [WPF form UIApplication access](#3)\n- [Mazri's Revit, Dynamo, web and WPF playlists](#4)\n- [Extensible storage schema deletion](#5)\n- [Extensible storage schema conflict](#6)"
  },
  {
    "original_filename": "1973_estorage_rm",
    "header_text": "Welcome, George!",
    "local_header_href": "#2",
    "chunk_text": "####<a name=\"2\"></a> Welcome, George!\n\nA warm welcome to my new colleague George Moturi!\nHe joined the DAS Developer Advocacy and Support team in September.\nHe is based in Nairobi, Kenya.\nHe comes with a computer science background and has worked for a few companies as a web developer.\nInitially, he will be focusing on learning and supporting the Revit API, and later stepping into Forge and ACC, the Autodesk Construction Cloud.\nIn his own words:\n \n> My name is Moturi George and I am joining as a Developer Advocate.\nPrior to that, I was a software developer for 5 years.\nI worked for fintech, media &amp; advertising and a digital marketing company, involving API development and integration with different providers and vendors.\nI have developed applications using the .NET Framework in C#, built websites using PHP, Vue JS, HTML and CSS.\nWhen not working, I love to watch documentaries, play computer games and having a chat on current affairs with my neighbours and friends. \nI'm happy and excited to be part of this amazing team that is building great Autodesk Community experiences!\n\n<center>\n<img src=\"img/george_moturi.png\" alt=\"George Moturi\" title=\"George Moturi\" width=\"260\"/>  <!-- 565 × 881 pixels -->\n</center>"
  },
  {
    "original_filename": "1973_estorage_rm",
    "header_text": "WPF Form UIApplication Access",
    "local_header_href": "#3",
    "chunk_text": "####<a name=\"3\"></a> WPF Form UIApplication Access\n\nGeorge just added a helpful pointer to \nthe [Revit API discussion forum](http://forums.autodesk.com/t5/revit-api-forum/bd-p/160) thread\non [How to call UIApplication of my current Document](https://forums.autodesk.com/t5/revit-api-forum/how-to-call-uiapplication-of-my-current-document/m-p/11570137):\n\n**Question:** I defined a command class that implements the `Execute` method and some other methods and Windows form named `LoadFamily`.\nIts first parameter is `UIApplication`.\nHowever, I don't know how I should call that parameter when I'm in a form button.\nIn other word, how should I call the `UIApplication` of my command class in one of its other methods?\n\n**Answer:** Make the `UIApplication` instance a member variable of your form class.\nStore the value you receive in the constructor in the member variable.\nUse its value in the button click handler method.\n\nHere is a tutorial that explains step by step how to create WPF forms and call its methods outside your command class:\n\n- [Revit + WPF -Quick starting guide- Ep4: adding UI to a command](https://youtu.be/vHsqxRAqQOg)"
  },
  {
    "original_filename": "1973_estorage_rm",
    "header_text": "Mazri's Revit, Dynamo, Web and WPF Playlists",
    "local_header_href": "#4",
    "chunk_text": "####<a name=\"4\"></a> Mazri's Revit, Dynamo, Web and WPF Playlists\n\nLooking more closely at George's recommendation in the answer above, I am very impressed\nwith [Mazri](https://twitter.com/mazri_a),\nhis [YouTube BIM Diary](https://www.youtube.com/@mazrisbimdiary2045)\nand [tutorial playlists](https://www.youtube.com/@mazrisbimdiary2045/playlists), covering the following areas:\n\n- Web dev\n- Dynamo &amp; Data\n- Make Your own Revit Plug-ins\n- Revit Programming using Python\n- Revit + WPF\n\nSpecifically targeted at getting started with C# programming and WPF, Mazri recommends:\n\n- A [nice friendly C# course for beginners](https://www.youtube.com/playlist?list=PLLAZ4kZ9dFpNIBTYHNDrhfE9C-imUXCmk)\n- Microsoft's [XAML overview (WPF .NET)](https://learn.microsoft.com/en-us/dotnet/desktop/wpf/xaml/?view=netdesktop-6.0)\n- Tim Corey's [Intro to WPF: Learn the basics and best practices of WPF for C#](https://youtu.be/gSfMNjWNoX0)\n- AngelSix' [C# WPF UI Tutorials: 01 - The Basics](https://youtu.be/Vjldip84CXQ)\n\nLooks like great stuff!\n\nMany thanks to Mazri for his work, and to George for making me aware of it."
  },
  {
    "original_filename": "1973_estorage_rm",
    "header_text": "Extensible Storage Schema Deletion",
    "local_header_href": "#5",
    "chunk_text": "####<a name=\"5\"></a> Extensible Storage Schema Deletion\n\nSome developers have encountered issues creating and deleting extensible storage schemata.\n\nMany of these can be resolved by understanding and adhering to the underlying basic principles.\n\nThe most fundamental ones are:\n\n- A schema is identified by its GUID\n- A schema can never be modified\n- A schema is universal\n\nYou can get into as nice mess by violating any of these principles.\nTo be more precise, they cannot be violated, but people sometimes still inadvertently try to, and then things get unpleasant.\n\nA new aspect came up in the following extensive discussion \non [not able to delete extensible storage schema](https://forums.autodesk.com/t5/revit-api-forum/not-able-to-delete-extensible-storage-schema/m-p/11541801):\n\n- The [`ExtensibleStorage.Schema` version of `EraseSchemaAndAllEntities` erasing `Schema` from all open documents had been deprecated and removed](https://www.revitapidocs.com/2023/80983aac-0cca-c211-1c7b-b5350624f046.htm)\n  &ndash;\n  the [Document.EraseSchemaAndAllEntities](https://www.revitapidocs.com/2023/50debcb0-3c4f-b32b-2edb-8a6ef7b4bf8d.htm) method\nshould be used instead\n  &ndash; maybe in earlier releases as well...\n\nHere is an edited version of the conversation:\n\n**Question:** I'm trying to put together a command to erase Extensible Storage (ES) data and the corresponding Schemas for our addin in case if unwanted by the users or corrupt. I had no luck so far. \n\nAfter the ES data has been written to the file it won't go away. I am being able to delete the DataStorage elements with no troubles, but the schemas keep popping up after erasing them.\n\nThe procedure I'm trying is:\n\n- Open the Revit file with the saved ES data.\n- Delete all the DataStorage elements holding the data.\n- Save and close Revit, reopen the file again.\n- Erase all schemas created by our addin.\n- Save and close Revit to make sure I clear the schemas in memory.\n- Start Revit again.\n- Use the Schema.ListSchemas() function with no documents open to make sure our custom schemas are not loaded, this clears out.\n- Open the file and use the Schema.ListSchemas() function, now all the schemas that I have erased previously reappear after opening the file!\n\nI'm using the same procedure found in the \"ExtensibleStorageUtility\" code example in the Revit SDK in a macro.\n\nOne observation I have that if I close Revit without saving after step 4, I get no warning to save the file, as if no changes happened to it, although I'm doing the erase inside a transaction.\n\nI tried to utilize the info on ES and Schema behaviours\nfrom [CADD helpdesk hot picks – classification manager schema error](https://www.caddmicrosystems.com/blog/cadd-helpdesk-hot-picks-classification-manager-schema-error),\nbut that didn't work:\n\nAny light on this would be much appreciated.\n\nThe add-in does not create the schema when it's loaded; the schema is created on demand.\n\n**Answer:** I would avoid the try/catch with an empty catch-all.\nUsing that, you will never notice if anything goes wrong.\n[Never catch all exceptions](https://thebuildingcoder.typepad.com/blog/2017/05/prompt-cancel-throws-exception-in-revit-2018.html#5)!\n\nHere is an old article by The Building Coder\non [erasing extensible storage](https://thebuildingcoder.typepad.com/blog/2013/11/erasing-extensible-storage-with-linked-files.html).\n\n**Response:** I already looked at all the Schema related posts in The Building Coder blog.\nNone helped solving the issue in hand.\n\nAfter further investigation, it turned out that the `Schema.EraseSchemaAndAllEntitie` function is working fine in Revit 2019; it is in Revit 2022 that it is failing.\nI haven't tried the in-between versions, but I suspect that this is the case for 2021 as well, as it is in that version that the API change happened, deprecating this function from the `Schema` class and providing one in the `Document` class.\n\n<!------\n\nI attached 2 Revit files with embedded macros for versions 2019 and 2022, both files have the same code except that the 2022 file is using the new Document.EraseSchemaAndAllEntities(...) function along with the deprecated one.\n\nTo replicate the issue:\n\nOpen file es test-V22.rvt in Revit 2022\nRun the embedded macro ListSchemas to examine the OOTB existing schemas\nRun the embedded macro WriteESData to write sample extensible storage data\nrepeat step #2, you should see a new entry of MYID:  SomeData\nSave the file\nRun the embedded macro DeleteSchemas\nRepeat step #2, you should see that the new entry is gone\nSave the file\nClose Revit 2022 (Just to make sure that the schemas are cleared from memory)\nOpen Revit and the file again\nRepeat step #2, the MYID:  SomeData schema reappears again!\nIf you follow the same steps on the file es test-V19.rvt in Revit 2019 the deletion will be successful.\n\nI hope I am doing something silly, but I really think that it is an issue with the API update.\nPlease let me know if you need further info on the test case.\n\nThanks,\n\nSam\n\nes test - V19.rvt\n \nes test - V22.rvt\n\njeremy.tammik\n\nDear Sam,\n\nSorry for not following up immediately and thank you for pointing out this again.\n\n@RPTHOMAS108  just discussed and resolved a similar issue in another thread here in the forum, and I am pretty sure that addresses the same root cause. His explanations will hopefully help resolve your problem as well:\n\nhttps://thebuildingcoder.typepad.com/blog/2021/11/new-analytical-model-api.html#6\n\nI very much hope this helps.\n\nCheers,\n\nJeremy\n\nsnajjar\n\nThank you for your reply @jeremy.tammik, I much appreciate all the help you provide.\n\n-->\n\nI read through all the blog posts and the solution by @RPTHOMAS108, and I'm sorry to say that it does not address the issue I'm having.\n\nThe solution and guidelines are addressing `DataStorage` and `Schema` creation and retrieval,\nI don't have issues there, and I can say that we are following the proposed best practices mentioned in the blog post for the creation procedures:\n\n- Schemas are being created on-demand\n- Using new Entity(Schema) instead of new Entity(GUID)\n- Not passing entities ByRef\n- Utilizing ExtensibleStorageFilter and Schema.Lookup(SchemaGuid).\n\nMy issue is with <u>deleting</u> the schema, which is working fine in 2019 but not in 2022.\n\nI am testing this in freshly created Revit files which I have included in my previous response with embedded macro code. The same code is being used in both files, but the 2022 one is not working.\n\nThe reason we are seeking Schema deletion is that when a Revit file that contains a newer version of the schema (adding more fields for example) and it has a linked Revit file with an older version, Revit will display a warning when the file is opened. This warning dialog is hindering our client's automation software that opens Revit files and process them automatically. We don't have control over that software nor want to suppress this warning because, while we are sure that this will not affect the tools we are developing and the integrity of the file, we can't guarantee that for all other vendors and the suppression will hide all such warnings for data coming from all the installed addins. Our goal is to provide a tool to delete our schema from the linked files to resolve the issue.\n\nI really hope this can be looked at by the development team to see if it is a bug caused by the API update that took place in Revit 2021.\n\n**Answer:** I've not looked into this;\nit should be possible to delete the schema if it is not used regardless, so that does seem wrong (especially if it previously worked).\nDid you have schema conflicts in the 2019 version though?\n\nHowever, one thing that occurred to me as I read your latest message is that you should only get that warning in the first place if you've done something wrong in terms of managing the schemas.\nWhen you create a schema with a GUID that is that version forever.\nTo add additional members, you should create a new version and transfer the data (leave the old one alone, do not reuse it's GUID).\n\nYou say, <i>a newer version of the schema (adding more fields for example)</i>.\n\nNo such thing exists!\n\nIf you have created such a situation, you are in serious trouble.\n\nAn existing schema cannot be modified:\n\n**Response:** I followed the procedure above (2022 version only) and was also not able to remove the schema, so regardless of misuse something seemingly warranting some further investigation with the `EraseSchemaAndAllEntities` methods perhaps, i.e., this is a clean file to start with, presumably.\n\nNote that the macro doesn't delete the `DataStorage` element, but I deleted this manually prior to step 6.\nHowever, I still wasn't able to permanently remove the schema.\n\nI note that the old method `Schema.EraseSchemaAndAllEntities` has a Boolean `overrideWriteAccessWithUserPermission` which is not present in the new `Document` method of the same name.\n\nThis may be a conceptual choice going forward but may be part of the issue (changes to underlying method that serves both). Also, the test was only conducted within the macro environment (add-in id is explicitly set in the attribute).\n\nI made the below minor change so any exceptions would show up but still no exceptions were reported:\n\n<center>\n<img src=\"img/estorage_erase_error.png\" alt=\"Extensible storage schema erase error\" title=\"Extensible storage schema erase error\" width=\"600\"/>  <!-- 856 × 324 p -->\n</center>\n\n**Response:** Your observation is spot-on, my usual procedure is to change the guid if I ever change something in the schema so a new schema would be created, but it looks like I missed doing that in one class, and this is why I am seeking the deletion functionality.\nThis should not be an issue for future updates, but I need to provide a resolution for the models edited by the current version.\n\nThe issue with not being able to delete the schema is irrelevant to what I did wrong.\n\nThe sample files are in their simplest forms, freshly made out of the architectural template and contain no elements, just the embedded macro scripts.\n\n**Answer:** The devteam replied: After running `DeleteSchemas` macro, open Manage > Purge Unused.\nIn the tree, select Extensible Storage Schema.\nCheck the schema a9dc2b48 and click OK to purge it.\nRun `ListSchemas` &ndash; the schema is purged.\nSo, please use Purge Unused to delete schemas without entities.\n \nI pointed out that this question comes from add-in developers automating processes and asked how they should run the purge command programmatically.\nWe'll see what they come up with next.\n  \nA similar issue came up again with a new customer, and the devteam underline:\n\nI would strongly recommend to any developer not to reuse a GUID for a new or modified schema for any reason, even if you think it has been purged from one document it may not be purged from other documents and you are setting yourselves up for a potential in-memory conflict.\n \nWe have seen this many times from developers who copied and did not modify the GUID in our samples.\n\n**Question:** Recently I faced the same issue: for some projects, I got an InternalException while trying to remove ExtensibleStorage schemas.\nThe exception does not occur after I unloaded IFC links. \n\n**Answer:** Thank you for your interesting observation.\nIt would be nice (and very useful) if the other parties concerned could test and hopefully verify this solution.\n\n**Response:** I created a very small example with IFC link (link with a few walls created in Revit2020):\n\n- [zip/estorage_delete_schema_example.zip](/Users/jta/a/doc/revit/tbc/git/a/zip/estorage_delete_schema_example.zip)\n\nIt includes 4 macros:\n\n- Create example schema\n- Remove example schema\n- List all schemata\n- Remove all schemata\n\nIn Revit 2020, I am not able to remove any schemata when the IFC link is loaded.\n\nAn InternalException also occurs when removing schemata when there is more than one project file opened (Revit 2020).\n\n**Answer:** I logged the issue REVIT-196204 [IFC link prevents extensible storage delete] for this \n\nInternalException when trying to remove schemas is currently not a big issue for me.\n\nI landed on this thread because of difficulties related to upgrade from Revit 2020 to Revit 2023.\nIn a few models we experience some critical errors when trying to upgrade to version 2023.\nWe came to the point that it could be directly or indirectly related to schemas.\nAfter we remove ExStorage schemas the upgrade to 2023 is successful.\n\nI noticed that removing schemas and entities sometimes causes Errors and Warnings, for example:\n\n- Error: Can't keep elements joined. (Model Lines, Walls)\n- Warning: Highlighted lines overlap. Lines may not form closed loops. (Model Lines)\n\nPossibly this is just because the elements are regenerated after the entity is removed.\n\nI wouldn't believe that ExStorages could cause any upgrade issues  if I didn't see it happening.\n\nWhat is your opinion on the possibility that ExtensibleStorage schemas and entities may cause upgrade issues?\n\n**Answer:** A link opens a document in the background, but you can't edit that linked document, can you?\nDoes the linked document contain the same schema itself?\nIf so, then I would see it as logical why the linked document causes issues. Should not cause an exception though.\n\nExtensible storage schema is an application-wide object.\nIf it exists at all in the application, it will populate and \"infect\" every single document that you touch.\nThat makes it hard to remove, and complicated to understand.\n\nThe development team analysed the development ticket and decided not to make any changes, explaining:\n\nThe `Document` class provides the method `EraseSchemaAndAllEntities`:\n\n<pre>\n  # Erases Schema and all its Entities from the document.\n  remarks\n     # The Schema remains in memory.\n  in ESSchema* schema\n     # The Schema to erase.\n  since 2021\n  validate DocumentValidation::isDocumentModifiable(this)\n  throws ArgumentException\n     # No write access to this Schema.\n</pre>\n\nThe [version of `EraseSchemaAndAllEntities` erasing `Schema` from all open documents had been deprecated and removed](https://www.revitapidocs.com/2023/80983aac-0cca-c211-1c7b-b5350624f046.htm):\n\n- 2023 | Resource Not Available for the Active API Year: `EraseSchemaAndAllEntities` Method\n  &ndash; Erases all Entities corresponding to this Schema from all open documents and erases this Schema from memory.\n\nThe [Document.EraseSchemaAndAllEntities](https://www.revitapidocs.com/2023/50debcb0-3c4f-b32b-2edb-8a6ef7b4bf8d.htm) method\nshould be used instead:\n\n- Erases Schema and all its Entities from the document.\n\nMany thanks to Sam, Marek and Richard for all their research and the fruitful discussion."
  },
  {
    "original_filename": "1973_estorage_rm",
    "header_text": "Extensible Storage Schema Conflict",
    "local_header_href": "#6",
    "chunk_text": "####<a name=\"6\"></a> Extensible Storage Schema Conflict\n\nAnother aspect was tagged on at the end of the above:\n\n**Question:** OK, I guess I need to jump on board the Schema issue.\nI'm also getting an error for an EnigmaSchema that is in multiple files:\n\n<center>\n<img src=\"img/estorage_schema_conflict.png\" alt=\"Extensible storage schema conflict\" title=\"Extensible storage schema conflict\" width=\"445\"/>  <!-- 445 × 331 -->\n</center>\n\nNo idea how to get this to be removed.\nAny help would be appreciated.\n\n**Answer:** You have to write a macro/addin that calls the above function and if that doesn't work it is usually due to entities on elements in nested families etc.\nSo, it is not easy because sometimes it involves iterating families opening them calling the above and reloading them.\nThis issue is also evident on links where the documents for such are loaded in the background and are not editable from the file they are linked into.\n\nOnce a schema is loaded, then a different one loaded with the same id will cause this.\nDevelopers often don't appreciate that even changing the documentation for a schema makes it different.\nAny change to the structure of the schema or documentation makes it different.\nIn this case, prevention is better than cure because the cure is very hard to achieve.\n\nNot sure who wrote the EnigmaSchema, but they obviously wanted to leave no details.\n\nWhat I've also noticed in the past (not sure it is still true) is that once you get this dialogue then you can't remove the schema because it is in conflict.\nSo, in the case of links for example you had to unload them all and deal with each file separately, i.e., to have Revit always in a state where the conflict had not arisen when you go to remove the schema.\nIt made removing them from loaded families virtually impossible.\nHopefully things are not that hard anymore.\n\nSee also the suggestion above about purging, which may work from an end user perspective:\n\n> After running DeleteSchemas macro, open Manage &gt; Purge Unused.\nIn the tree, select Extensible Storage Schema.\nCheck the schema id and click OK to purge it.\nRun ListSchemas &ndash; the schema is purged.\nSo, please use Purge Unused to delete schemas without entities."
  }
]